{
  "faculty": "Applied Science",
  "major": "Biomedical Engineering",
  "totalCredits": 146,
  "notes": "UBC Applied Science (Engineering) - Biomedical Engineering curriculum outline. First year uses Pre-Biomedical Engineering Standardized Timetable (PBME STT) which differs from standard engineering first year.",
  "years": [
    {
      "year": 1,
      "label": "Year 1",
      "terms": [
        {
          "term": 1,
          "courses": [
            {
              "code": "APSC 100",
              "title": "",
              "credits": 3,
              "year": 1,
              "term": 1,
              "description": "Introduction to Engineering I An introduction to the engineering profession including: roles and responsibilities of the engineer, the engineering disciplines, sustainability, an introduction to the engineering design process, introduction and application of the relevant foundational scientific principles, prototyping, engineering graphics, technical communication, and engineering ethics.",
              "prerequisites": "APSC 100\n\nCorequisites: APSC 173"
            },
            {
              "code": "APSC 160",
              "title": "",
              "credits": 3,
              "year": 1,
              "term": 1,
              "description": "Introduction to Computation in Engineering Design Analysis and simulation, laboratory data acquisition and processing, measurement interfaces, engineering tools, computer systems organization, programming languages. Credit will only be given for one of:"
            },
            {
              "code": "BMEG 101",
              "title": "Introduction to Biomedical Engineering",
              "credits": 3,
              "year": 1,
              "term": 1,
              "description": "Foundational material spanning the four streams of the BMEG undergraduate program. Topics include: sensors and instrumentation; biosignals; physiological modeling; biomechanics; biomaterials; cellular engineering; regenerative medicine; and engineering design in these contexts. *] Credit will only be granted for one of",
              "prerequisites": "APSC 100.\n\nCorequisites: BMEG 102. BMEG_V 102 (2) Biomedical Engineering Lab Introduction to the breadth of laboratory and experimental techniques in biomedical engineering. Hydrogel design, genetic engineering of bacteria, bioinformatics pipeline construction, electrical instrumentation, and bioreactor design."
            },
            {
              "code": "BMEG 102",
              "title": "and",
              "credits": 2,
              "year": 1,
              "term": 1,
              "description": "Introduction to the breadth of laboratory and experimental techniques in biomedical engineering. Hydrogel design, genetic engineering of bacteria, bioinformatics pipeline construction, electrical instrumentation, and bioreactor design. Credit will only be granted for one of"
            },
            {
              "code": "CHEM 121",
              "title": "",
              "credits": 4,
              "year": 1,
              "term": 1,
              "description": "Structure and Bonding in Chemistry Fundamentals of bonding theories and structural chemistry, with applications relevant to modern society.",
              "prerequisites": "One of CHEM_V 12,"
            },
            {
              "code": "CHEM 123",
              "title": "",
              "credits": 4,
              "year": 1,
              "term": 1,
              "description": "Thermodynamics, Kinetics and Organic Chemistry Fundamentals of chemical reactivity: thermodynamics; kinetics; organic chemistry, including stereochemistry; applications relevant to modern society.",
              "prerequisites": "One of"
            }
          ]
        },
        {
          "term": 2,
          "courses": [
            {
              "code": "MATH 100",
              "title": "Differential Calculus with Applications\n\n\nDerivatives of elementary functions",
              "credits": 3,
              "year": 1,
              "term": 2,
              "description": "Differential Calculus with Applications Derivatives of elementary functions. Applications and modelling: graphing, optimization. Consult the Faculty of Science Credit Exclusion List: https://vancouver.calendar.ubc.ca/faculties-colleges-and-schools/facult…",
              "prerequisites": "A score of 80% or higher in BC Pre-calculus 12. High school calculus is strongly recommended."
            },
            {
              "code": "MATH 101",
              "title": "Integral Calculus with Applications",
              "credits": 3,
              "year": 1,
              "term": 2,
              "description": "The definite integral, integration techniques, applications, modelling, infinite series.",
              "prerequisites": "One of MATH_V 100, MATH_V 102, MATH_V 104, MATH_V 110, MATH_V 120, MATH_V 180, MATH_V 184.\n\nEquivalency: MATH_V 103, 105."
            },
            {
              "code": "MATH 152",
              "title": "Linear Systems\n\n\n2D and 3D geometry, vectors and matrices, eigenvalues and vibration, physical applications",
              "credits": 3,
              "year": 1,
              "term": 2,
              "description": "Linear Systems 2D and 3D geometry, vectors and matrices, eigenvalues and vibration, physical applications. Laboratories demonstrate computer solutions of large systems. Please consult the Faculty of Science Credit Exclusion List: https://vancouver.calendar.ubc.ca/faculties-colleges-and-schools/facult… [3-1*-0]",
              "prerequisites": "Corequisites: [MATH101]"
            },
            {
              "code": "PHYS 157",
              "title": "",
              "credits": 3,
              "year": 1,
              "term": 2,
              "description": "Introductory Physics for Engineers I Heat, thermodynamics, oscillations, waves, and sound.",
              "prerequisites": "One of PHYS 12, PHYS 100.\n\nCorequisites: One of MATH 100, MATH 102, MATH 104, MATH 110, MATH 120, MATH 180, MATH 184."
            },
            {
              "code": "PHYS 158",
              "title": ", SCIE 001 and a score of 68% or higher in one of MATH 101, MATH 103, MATH 105, MATH 121, SCIE 001. Corequisite: One of MATH 152, MATH 221, MATH 223",
              "credits": 3,
              "year": 1,
              "term": 2,
              "description": "Introductory Physics for Engineers II Electricity and magnetism, DC and AC circuits, optics.",
              "prerequisites": "PHYS 157.\n\nCorequisites: One of MATH 101, MATH 103, MATH 105, MATH 121."
            },
            {
              "code": "PHYS 170",
              "title": "",
              "credits": 3,
              "year": 1,
              "term": 2,
              "description": "Mechanics I Statics of particles, equilibrium or rigid bodies, rigid body statics and internal forces, trusses; kinematics: rectilinear motion; dynamics: Newton's second law, friction, impulse, momentum, work and energy. Recommended pre-requisites: one of PHYS 12,",
              "prerequisites": "Corequisites: One of MATH 200, MATH 217, MATH 226, MATH 253, MATH 254."
            },
            {
              "code": "WRDS 150",
              "title": "",
              "credits": 3,
              "year": 1,
              "term": 2,
              "description": "Writing and Research in the Disciplines Writing and reading in disciplines across the academy, focusing on practices that research disciplines share and those that differentiate them. Restricted to students not in the Faculty of Arts. Credit can be granted for only one of"
            }
          ]
        }
      ]
    },
    {
      "year": 2,
      "label": "Year 2",
      "terms": [
        {
          "term": 1,
          "courses": [
            {
              "code": "BMEG 201",
              "title": "Technical Communication for Biomedical Engineers",
              "credits": 3,
              "year": 2,
              "term": 1,
              "description": "Report preparation, business correspondence, and oral presentation in biomedical engineering specific cases and projects. Credit will be granted for only one of"
            },
            {
              "code": "BMEG 210",
              "title": "Thermodynamics in Biomedical Engineering",
              "credits": 3,
              "year": 2,
              "term": 1,
              "description": "Work, heat and energy; material and energy balances; the first law and second law of thermodynamics; entropy and process reversibility; availability (energy) analysis; Hess's Law; thermodynamic properties of fluids; and applications to biomedical systems.",
              "prerequisites": "PHYS 157. CHEM 123 is recommended"
            },
            {
              "code": "BMEG 220",
              "title": "Circuits and Electromagnetics with Application to Biomedical Engineering",
              "credits": 4,
              "year": 2,
              "term": 1,
              "description": "Electromagnetic phenomena in the body; bioinstrumentation; electrostatic and electromagnetic fields, forces, capacitance and inductance; bio-effects of electromagnetic fields; and modelling electrical components of physiological and biomedical systems. *]",
              "prerequisites": "All of PHYS 158, MATH 253, MATH 256.\n\nCorequisites: MATH 264."
            },
            {
              "code": "BMEG 230",
              "title": "Biomechanics I",
              "credits": 4,
              "year": 2,
              "term": 1,
              "description": "Integrating the study of two dimensional movement of animals and humans with the study of the manner in which forces on biomechanical structures such as bones, ligaments, tendons, muscles and joints cause motion. Techniques of solid mechanics and two dimensional rigid body dynamics. Students who have received credit for MECH 435 cannot also receive credit for"
            },
            {
              "code": "BMEG 245",
              "title": "The Fundamental Units of Life: From Cells To Systems",
              "credits": 4,
              "year": 2,
              "term": 1,
              "description": "The structure and function of cells and how they are organized to generate tissues and organ systems [3-3*-0]",
              "prerequisites": "One of CHEM 12, CHEM 100. BIOL 12 strongly recommended"
            },
            {
              "code": "BMEG 250",
              "title": "Cellular Physiology and Biophysics",
              "credits": 4,
              "year": 2,
              "term": 1,
              "description": "Cellular structure and mechanisms of membrane transport, signal transduction, muscle mechanochemistry and neurotransmission. Structure and hierarchical organization up to the level of tissues. Light and electron microscopy.",
              "prerequisites": "All of BMEG 245, MATH 256."
            }
          ]
        },
        {
          "term": 2,
          "courses": [
            {
              "code": "BMEG 257",
              "title": "Biomedical Engineering Design I",
              "credits": 4,
              "year": 2,
              "term": 2,
              "description": "Engineering design process for biomedical technologies. Practical skills in engineering design, computer aided design, electronic circuits, programming, and rapid prototyping in the context of biomedical technologies. Introduction to broader ethical and sustainability considerations for biomedical technology design.",
              "prerequisites": "Either (a) all of BMEG 101, BMEG 102 or (b) all of APSC 101, BMEG 200, PHYS 159."
            },
            {
              "code": "CPEN 221",
              "title": "or 223",
              "credits": 4,
              "year": 2,
              "term": 2,
              "description": "Design, implementation, reasoning about software systems: Abstraction and specification of software, testing, verification, abstract data types, object-oriented design, design patterns, type hierarchies, concurrent software design. [3-2-1*]",
              "prerequisites": "Prerequisites: APSC 160 – Introduction to Computation in Engineering Design"
            },
            {
              "code": "MATH 253",
              "title": "or 226",
              "credits": 3,
              "year": 2,
              "term": 2,
              "description": "Multivariable Calculus Partial and directional derivatives; maxima and minima; Lagrange multipliers and second derivative test; multiple integrals and applications. Please consult the Faculty of Science Credit Exclusion List: https://vancouver.calendar.ubc.ca/faculties-colleges-and-schools/facult…",
              "prerequisites": "One of"
            },
            {
              "code": "MATH 256",
              "title": "Differential Equations\n\n\nLinear ordinary differential equations, Laplace transforms, Fourier series and separation of variables for linear partial differential equations",
              "credits": 3,
              "year": 2,
              "term": 2,
              "description": "Differential Equations Linear ordinary differential equations, Laplace transforms, Fourier series and separation of variables for linear partial differential equations. Consult the Faculty of Science Credit Exclusion List: https://vancouver.calendar.ubc.ca/faculties-colleges-and-schools/facult… .",
              "prerequisites": "One of"
            },
            {
              "code": "MATH 264",
              "title": "content is strongly coupled to BMEG 220 and ELEC 211 with topics and student evaluations weighted accordingly",
              "credits": 1,
              "year": 2,
              "term": 2,
              "description": "Vector Calculus for Electrical Engineering Divergence, gradient, curl, theorems of Gauss and Stokes. Applications to Electrostatics and Magnetostatics. MATH 264 content is strongly coupled to BMEG 220 and ELEC 211 with topics and student evaluations weighted accordingly. Corequisite: One of BMEG 220, ELEC 211.",
              "prerequisites": "One of"
            },
            {
              "code": "CHBE 251",
              "title": "This course is not eligible for Credit/D/Fail grading",
              "credits": 3,
              "year": 2,
              "term": 2,
              "description": "Transport Phenomena I Fluid Mechanics. Momentum-transfer in fluids in laminar and turbulent flow; microscopic and macroscopic material; momentum and energy balances; rheology; dimensional analysis; flow in conduits; pumps; fluid metering. *]",
              "prerequisites": "[PHYS170]\n\nCorequisites: One of MATH 255, MATH 256."
            }
          ]
        }
      ]
    },
    {
      "year": 3,
      "label": "Year 3",
      "terms": [
        {
          "term": 1,
          "courses": [
            {
              "code": "BIOC 202",
              "title": "",
              "credits": 3,
              "year": 3,
              "term": 1
            },
            {
              "code": "BMEG 310",
              "title": "Introduction to Bioinformatics",
              "credits": 4,
              "year": 3,
              "term": 1,
              "description": "Principles behind the methods of bioinformatics. The use of bioinformatics databases and tools for solving problems in genomics, proteomics, structural biology and evolutionary biology.",
              "prerequisites": "BMEG 245 and one of CPEN 221, CPEN 223."
            },
            {
              "code": "BMEG 321",
              "title": "Biomedical Instrumentation",
              "credits": 3,
              "year": 3,
              "term": 1,
              "prerequisites": "Either (a) MATH 256 or (b) all of MATH 265, MATH 267; and either (a)",
              "description": "Fundamental working principles of medical instruments used for measurements of nervous, respiratory and circulatory systems with focus on biopotential signals. Other topics include medical imaging, as well as minimally invasive and robotic surgery. Credit will only be granted for one of"
            },
            {
              "code": "BMEG 350",
              "title": "Human Structure/Function from Cells to Systems",
              "credits": 4,
              "year": 3,
              "term": 1,
              "description": "Human anatomy, histology and physiology with examples from biomedical engineering. Anatomical compartmentation and function regulation; homeostatic control systems, sensors and effectors; intercellular communication strategies; and cellular and organ function assessment.",
              "prerequisites": "All of BMEG 245, BMEG 250."
            },
            {
              "code": "BMEG 357",
              "title": "Biomedical Engineering Design II",
              "credits": 3,
              "year": 3,
              "term": 1,
              "description": "Creating innovations in biomedical technologies. Supervised design process for clinical clients, involving the building, testing, and verification of prototypes with potential users. [3*-3*-0]",
              "prerequisites": "BMEG 257."
            }
          ]
        },
        {
          "term": 2,
          "courses": [
            {
              "code": "BMEG 371",
              "title": "Transport Phenomena within Cells and Tissues",
              "credits": 3,
              "year": 3,
              "term": 2,
              "description": "Fluid flow and mass transport analysis within healthy and diseased cells and tissues using mathematics. Drug delivery and tissue engineering. *]",
              "prerequisites": "One of MATH 253, MATH 217 and either (a) MATH 256 or (b) all of MATH 255, MATH 257.\n\nEquivalency: CHBE 470"
            },
            {
              "code": "CHEM 233",
              "title": "",
              "credits": 3,
              "year": 3,
              "term": 2,
              "description": "Organic Chemistry for the Biological Sciences Reactions and properties of carbonyl compounds, carbohydrates, amino acids, nucleic acids. Credit will be granted for only one of"
            },
            {
              "code": "CHEM 235",
              "title": "Organic Chemistry Laboratory",
              "credits": 1,
              "year": 3,
              "term": 2,
              "description": "Techniques of organic chemistry. To be taken in conjunction with, or in the term following, CHEM 233. Credit will be granted for only one of CHEM 235 or CHEM 203.",
              "prerequisites": "One of CHEM 123, CHEM 135, SCIE 001.\n\nCorequisites: [CHEM233]"
            },
            {
              "code": "STAT 251",
              "title": "",
              "credits": 3,
              "year": 3,
              "term": 2
            },
            {
              "code": "ELECTIVE",
              "title": "Technical Electives",
              "credits": 6,
              "year": 3,
              "term": 2
            }
          ]
        }
      ]
    },
    {
      "year": 4,
      "label": "Year 4",
      "terms": [
        {
          "term": 1,
          "courses": [
            {
              "code": "BMEG 401",
              "title": "Economics of Healthcare Solutions",
              "credits": 3,
              "year": 4,
              "term": 1,
              "description": "Canadian and USA engineering economics in BME and healthcare systems. Economic equivalence, cost estimation, risk assessment, regulatory frameworks, economic optimization, intangible factors, ethics, sustainability, financial tools, commercialization and regulator regimes."
            },
            {
              "code": "BMEG 455",
              "title": "Professionalism and Ethics in Biomedical Engineering",
              "credits": 3,
              "year": 4,
              "term": 1,
              "description": "Ethical, equity, and diversity issues and professionalism in Biomedical Engineering practice and design. Case studies and design projects will be used to expand on the foundation of biomedical engineering design, applying real-world ethical dilemmas including professional, medical, and research ethics."
            },
            {
              "code": "BMEG 457",
              "title": "Biomedical Engineering Design Project",
              "credits": 6,
              "year": 4,
              "term": 1,
              "description": "Capstone design and development of a practical biomedical device or system. Projects provided by local industry and engineering research laboratories. ;",
              "prerequisites": "All of BMEG 350, BMEG 357. BMEG_V 470 (3) Cellular Responses to Forces and Biomaterials Mechanical forces and biomaterials regulating cellular functions critical to tissue development, regeneration and repair. Prerequisite: All of BMEG 245, BMEG 250, BMEG 350. BMEG_V 474 (3) Stem Cells and Regenerative Medicine Biology and applications of stem cells in regenerative medicine. Modelling human biology and disease in vitro and in vivo. Regulatory and commercialization pathways for regenerative medicine innovations. Prerequisite: All of BMEG 245, BMEG 250, BMEG 350."
            }
          ]
        },
        {
          "term": 2,
          "courses": [
            {
              "code": "STAT 300",
              "title": "",
              "credits": 3,
              "year": 4,
              "term": 2
            },
            {
              "code": "ELECTIVE",
              "title": "Technical Electives",
              "credits": 15,
              "year": 4,
              "term": 2
            },
            {
              "code": "CPEN 221",
              "title": "Students planning to complete the Bioinformatics option should take .",
              "credits": 3,
              "year": 4,
              "term": 2,
              "description": "Design, implementation, reasoning about software systems: Abstraction and specification of software, testing, verification, abstract data types, object-oriented design, design patterns, type hierarchies, concurrent software design. [3-2-1*]",
              "prerequisites": "Prerequisites: APSC 160 – Introduction to Computation in Engineering Design"
            }
          ]
        }
      ]
    }
  ]
}