{
  "faculty": "Applied Science",
  "major": "Chemical and Biological Engineering",
  "totalCredits": 161,
  "notes": "UBC Applied Science (Engineering) - Chemical and Biological Engineering curriculum outline. First year is common to most engineering programs.",
  "years": [
    {
      "year": 1,
      "label": "Year 1",
      "terms": [
        {
          "term": 1,
          "courses": [
            {
              "code": "APSC 100",
              "title": "",
              "credits": 3,
              "year": 1,
              "term": 1,
              "description": "Introduction to Engineering I An introduction to the engineering profession including: roles and responsibilities of the engineer, the engineering disciplines, sustainability, an introduction to the engineering design process, introduction and application of the relevant foundational scientific principles, prototyping, engineering graphics, technical communication, and engineering ethics.",
              "prerequisites": "APSC 100\n\nCorequisites: APSC 173"
            },
            {
              "code": "APSC 101",
              "title": "",
              "credits": 3,
              "year": 1,
              "term": 1,
              "description": "Introduction to Engineering II An introduction to the engineering profession including: the engineering design process, sustainability, prototype testing, introduction and application of the relevant foundational scientific principles, team functioning, engineering graphics, and technical communication. Prerequisite:",
              "prerequisites": "APSC 100."
            },
            {
              "code": "APSC 160",
              "title": "",
              "credits": 3,
              "year": 1,
              "term": 1,
              "description": "Introduction to Computation in Engineering Design Analysis and simulation, laboratory data acquisition and processing, measurement interfaces, engineering tools, computer systems organization, programming languages. Credit will only be given for one of:"
            },
            {
              "code": "CHEM 154",
              "title": "",
              "credits": 3,
              "year": 1,
              "term": 1,
              "description": "Chemistry for Engineering Chemical bonding, properties of matter. Chemical thermodynamics with applications to phase equilibria, aqueous equilibria and electrochemistry. Processes at surfaces. [3-3*-0]",
              "prerequisites": "CHEM 12."
            },
            {
              "code": "WRDS 150",
              "title": "",
              "credits": 3,
              "year": 1,
              "term": 1,
              "description": "Writing and Research in the Disciplines Writing and reading in disciplines across the academy, focusing on practices that research disciplines share and those that differentiate them. Restricted to students not in the Faculty of Arts. Credit can be granted for only one of"
            },
            {
              "code": "MATH 100",
              "title": "; intended for students with no previous knowledge of Calculus. Please consult the Faculty of Science Credit Exclusion List:",
              "credits": 3,
              "year": 1,
              "term": 1,
              "description": "https://vancouver.calendar.ubc.ca/faculties-colleges-and-schools/facult… . Not for credit for students with AP Calculus AB, AP Calculus BC, or a passing score on the UBC-SFU-UVIC-UNBC Calculus Challenge Examination.5]",
              "prerequisites": "A grade of 80% or higher in BC Principles of Mathematics 12 or Pre-calculus 12."
            }
          ]
        },
        {
          "term": 2,
          "courses": [
            {
              "code": "MATH 101",
              "title": "Integral Calculus with Applications",
              "credits": 3,
              "year": 1,
              "term": 2,
              "description": "The definite integral, integration techniques, applications, modelling, infinite series.",
              "prerequisites": "One of MATH_V 100, MATH_V 102, MATH_V 104, MATH_V 110, MATH_V 120, MATH_V 180, MATH_V 184.\n\nEquivalency: MATH_V 103, 105."
            },
            {
              "code": "MATH 152",
              "title": "Linear Systems",
              "credits": 3,
              "year": 1,
              "term": 2,
              "description": "2D and 3D geometry, vectors and matrices, eigenvalues and vibration, physical applications. Laboratories demonstrate computer solutions of large systems. Please consult the Faculty of Science Credit Exclusion List: https://vancouver.calendar.ubc.ca/faculties-colleges-and-schools/facult… [3-1*-0]",
              "prerequisites": "Corequisites: [MATH101]\n\nCorequisites: [MATH101] MATH_V 180 (4) Differential Calculus with Applications Topics as for\n\nCorequisites: [MATH101] MATH_V 180 (4) Differential Calculus with Applications Topics as for"
            },
            {
              "code": "PHYS 157",
              "title": "Introductory Physics for Engineers I",
              "credits": 3,
              "year": 1,
              "term": 2,
              "description": "Heat, thermodynamics, oscillations, waves, and sound.",
              "prerequisites": "One of PHYS 12, PHYS 100.\n\nCorequisites: One of MATH 100, MATH 102, MATH 104, MATH 110, MATH 120, MATH 180, MATH 184."
            },
            {
              "code": "PHYS 158",
              "title": "Introductory Physics for Engineers II",
              "credits": 3,
              "year": 1,
              "term": 2,
              "description": "Electricity and magnetism, DC and AC circuits, optics.",
              "prerequisites": "PHYS 157.\n\nCorequisites: One of MATH 101, MATH 103, MATH 105, MATH 121."
            },
            {
              "code": "PHYS 159",
              "title": "Introductory Physics Laboratory for Engineers",
              "credits": 1,
              "year": 1,
              "term": 2,
              "description": "A laboratory course with emphasis on experimental design, measurement and analysis techniques.",
              "prerequisites": "One of PHYS 12, PHYS 100.\n\nCorequisites: One of PHYS 157, PHYS 158. PHYS_V 170 (3) Mechanics I Statics of particles, equilibrium or rigid bodies, rigid body statics and internal forces, trusses; kinematics: rectilinear motion; dynamics: Newton's second law, friction, impulse, momentum, work and energy. Recommended pre-requisites: one of PHYS 12, PHYS 100 and one of MATH 100, MATH 102, MATH 104, MATH 110, MATH 120, MATH 180, MATH 184. Recommended co-requisite: one of MATH 101, MATH 103, MATH 105, MATH 121."
            },
            {
              "code": "PHYS 170",
              "title": "",
              "credits": 3,
              "year": 1,
              "term": 2,
              "description": "Mechanics I Statics of particles, equilibrium or rigid bodies, rigid body statics and internal forces, trusses; kinematics: rectilinear motion; dynamics: Newton's second law, friction, impulse, momentum, work and energy. Recommended pre-requisites: one of PHYS 12,",
              "prerequisites": "Corequisites: One of MATH 200, MATH 217, MATH 226, MATH 253, MATH 254."
            },
            {
              "code": "ELECTIVE",
              "title": "Complementary Studies electives",
              "credits": 3,
              "year": 1,
              "term": 2
            }
          ]
        }
      ]
    },
    {
      "year": 2,
      "label": "Year 2",
      "terms": [
        {
          "term": 1,
          "courses": [
            {
              "code": "CHBE 201",
              "title": "Prerequisite: All of CHEM 154, MATH 101",
              "credits": 3,
              "year": 2,
              "term": 1,
              "description": "Integrated Technical Communication Written and oral communication in chemical and biological engineering: business correspondence, laboratory reports, technical description, and poster presentations. Restricted to students in second year of the Chemical and Biological Engineering programs. Corequisite:",
              "prerequisites": "One of APSC 176, ENGL 110, ENGL 111, ENGL 112, ENGL 120, ENGL 121, WRDS 150."
            },
            {
              "code": "CHBE 220",
              "title": "Founding Principles in Chemical and Biological Engineering I",
              "credits": 4,
              "year": 2,
              "term": 1,
              "description": "Introduction to Chemical and Biological Engineering profession and the physical sciences that form the founding principles of the discipline. Recommended Corequisite:"
            },
            {
              "code": "CHBE 221",
              "title": "Founding Principles in Chemical and Biological Engineering II",
              "credits": 4,
              "year": 2,
              "term": 1,
              "description": "Introduction to Chemical and Biological Engineering profession with emphasis on the biological sciences that form the founding principles of the discipline. Prerequisite:"
            },
            {
              "code": "CHBE 230",
              "title": "Computational Methods",
              "credits": 3,
              "year": 2,
              "term": 1,
              "description": "Mathematical formulation of chemical and biological engineering problems; standard techniques of numerical analysis and their application to chemical, environmental and biotechnological systems; program development; use of commercial numerical analysis software.",
              "prerequisites": "APSC 160.\n\nCorequisites: MATH 256."
            },
            {
              "code": "CHBE 241",
              "title": "This course is not eligible for Credit/D/Fail grading",
              "credits": 3,
              "year": 2,
              "term": 1,
              "description": "Material and Energy Balances Introduction to Chemical and Biological Engineering; units; stoichiometry; phase equilibria; material balances; energy balances.",
              "prerequisites": "All of CHEM 154, MATH 152."
            },
            {
              "code": "CHBE 244",
              "title": "Chemical and Biological Engineering Thermodynamics I",
              "credits": 3,
              "year": 2,
              "term": 1,
              "description": "Energy and the first law; second law of thermodynamics; entropy; availability (energy) analysis; thermodynamic properties of fluids, application to power generation, refrigeration, and liquefaction, as well as biological, environmental, and electrochemical systems. *] Prerequisite:"
            }
          ]
        },
        {
          "term": 2,
          "courses": [
            {
              "code": "CHBE 251",
              "title": "This course is not eligible for Credit/D/Fail grading",
              "credits": 3,
              "year": 2,
              "term": 2,
              "description": "Transport Phenomena I Fluid Mechanics. Momentum-transfer in fluids in laminar and turbulent flow; microscopic and macroscopic material; momentum and energy balances; rheology; dimensional analysis; flow in conduits; pumps; fluid metering. *]",
              "prerequisites": "[PHYS170]\n\nCorequisites: One of MATH 255, MATH 256."
            },
            {
              "code": "CHBE 263",
              "title": "Introduction to Chemical and Biological Engineering Laboratory Practice",
              "credits": 1,
              "year": 2,
              "term": 2,
              "description": "Introduction to Chemical and Biological Engineering laboratory practice with topics in physical, inorganic and organic chemistry.",
              "prerequisites": "Corequisites: All of\n\nCorequisites: All of\n\nCorequisites: All of"
            },
            {
              "code": "CHBE 264",
              "title": "Chemical and Biological Engineering Laboratory",
              "credits": 3,
              "year": 2,
              "term": 2,
              "description": "Laboratory experiment in 2nd year Chemical and Biological Engineering Prerequisite:"
            },
            {
              "code": "CHEM 250",
              "title": "Inorganic Chemistry for Engineers",
              "credits": 3,
              "year": 2,
              "term": 2,
              "description": "Chemistry of selected groups of inorganic compounds, considered in relation to industrial processes.",
              "prerequisites": "One of CHEM 123, CHEM 130, CHEM 154, SCIE 001."
            },
            {
              "code": "CHEM 260",
              "title": "Organic Chemistry for Engineers",
              "credits": 3,
              "year": 2,
              "term": 2,
              "description": "A description of the properties and reactions of organic compounds.",
              "prerequisites": "One of CHEM 123, CHEM 130, CHEM 154, SCIE 001."
            },
            {
              "code": "MATH 253",
              "title": "Multivariable Calculus",
              "credits": 3,
              "year": 2,
              "term": 2,
              "description": "Partial and directional derivatives; maxima and minima; Lagrange multipliers and second derivative test; multiple integrals and applications. Please consult the Faculty of Science Credit Exclusion List: https://vancouver.calendar.ubc.ca/faculties-colleges-and-schools/facult…",
              "prerequisites": "One of MATH 101, MATH 103, MATH 105, MATH 121, SCIE 001."
            },
            {
              "code": "MATH 256",
              "title": "Differential Equations",
              "credits": 3,
              "year": 2,
              "term": 2,
              "description": "Linear ordinary differential equations, Laplace transforms, Fourier series and separation of variables for linear partial differential equations. Consult the Faculty of Science Credit Exclusion List:\nhttps://vancouver.calendar.ubc.ca/faculties-colleges-and-schools/facult…\n.",
              "prerequisites": "One of MATH_V 101, MATH_V 103, MATH_V 105, MATH_V 121, SCIE_V 001 and one of MATH_V 152, MATH_V 221, MATH_V 223.\n\nCorequisites: One of MATH_V 200, MATH_V 217, MATH_V 226, MATH_V 253."
            }
          ]
        }
      ]
    },
    {
      "year": 3,
      "label": "Year 3",
      "terms": [
        {
          "term": 1,
          "courses": [
            {
              "code": "CHBE 345",
              "title": "Unit Operations",
              "credits": 4,
              "year": 3,
              "term": 1,
              "description": "Stage-wise mass transfer operations; extraction and absorption; single and stage-wise binary and multi-component distillation; principles and equipment design for continuous contact mass transfer operations including absorption, binary distillation and others such as extraction, drying, and humidification. *]",
              "prerequisites": "All of"
            },
            {
              "code": "CHBE 346",
              "title": "for students enrolled in CHBE or fourth-year standing in BASc",
              "credits": 3,
              "year": 3,
              "term": 1,
              "description": "Chemical and Biological Engineering Thermodynamics II Volumetric and thermodynamic properties of fluids; equations of state; heat effects; ideal and non-ideal mixtures; fugacities and activity coefficients; vapor-liquid and liquid-liquid phase equilibrium; solubility of gases and solids in liquids; chemical reaction equilibrium; equilibrium partitioning of pollutants. Recommended",
              "prerequisites": "MATH 256. *] Prerequisite: All of"
            },
            {
              "code": "CHBE 352",
              "title": "This course is not eligible for Credit/D/Fail grading",
              "credits": 4,
              "year": 3,
              "term": 1,
              "description": "Transport Phenomena II Heat and mass transfer; conduction and molecular diffusion; convective transfer; analogies among heat, mass and momentum transfer; heat exchanger design; mass transfer coefficients; interphase mass transfer. *]",
              "prerequisites": "One of"
            },
            {
              "code": "CHBE 355",
              "title": "for students enrolled in CHBE or third-year standing in BASc",
              "credits": 3,
              "year": 3,
              "term": 1,
              "description": "Kinetics and Reactor Design Kinetics of homogeneous chemical and biological reactions, isothermal ideal reactor design, analysis of non-ideal reactors using residence time distribution and mixing models.",
              "prerequisites": "All of"
            },
            {
              "code": "CHBE 356",
              "title": "This course is not eligible for Credit/D/Fail grading",
              "credits": 4,
              "year": 3,
              "term": 1,
              "description": "Process Dynamics and Control Introduction to modelling of chemical processes; transient response analysis; design of feedback control systems; stability analysis; frequency response analysis; process control applications; instrumentation; advanced control techniques; distributed control systems.",
              "prerequisites": "MATH_V 255 or MATH_V 256."
            },
            {
              "code": "CHBE 362",
              "title": "Process Engineering Laboratory",
              "credits": 3,
              "year": 3,
              "term": 1,
              "description": "Experiments to illustrate and use material presented in 200 and 300-level CHBE courses. Field trips may be required.",
              "prerequisites": "All of"
            },
            {
              "code": "CHBE 370",
              "title": "Prerequisite: Third-year or higher standing in BASc. or BSc",
              "credits": 3,
              "year": 3,
              "term": 1,
              "description": "Fundamentals of Sustainable Engineering Introduction to sustainable practice for Chemical and Biological Engineers. Pollution prevention, cleaner production, green chemistry and engineering, and sustainable design; environmental impact assessment including life-cycle assessment, total cost analysis and environmental systems analysis; applications in chemical and biological process industries. *]",
              "prerequisites": "All of"
            }
          ]
        },
        {
          "term": 2,
          "courses": [
            {
              "code": "CHBE 376",
              "title": "This course is not eligible for Credit/D/Fail grading",
              "credits": 4,
              "year": 3,
              "term": 2,
              "description": "Computer Flowsheeting and Unit Operation Design Theory and practice of computer flowsheeting in chemical plant design; hands-on use of modern process simulators, prediction of thermodynamic properties of fluids; behaviour of single and multiphase systems. Design of unit operations.",
              "prerequisites": "CHBE241\n\nCorequisites: All of"
            },
            {
              "code": "STAT 251",
              "title": "",
              "credits": 3,
              "year": 3,
              "term": 2
            },
            {
              "code": "ELECTIVE",
              "title": "Complementary Studies electives",
              "credits": 3,
              "year": 3,
              "term": 2
            },
            {
              "code": "APSC 278",
              "title": "",
              "credits": 3,
              "year": 3,
              "term": 2,
              "description": "Engineering Materials Atomic bonding; crystal structures and imperfections; properties of metals, ceramics, polymers, wood, concrete and fibre composite materials; selection of materials; corrosion; mechanical testing and heat treatment."
            },
            {
              "code": "CHBE 366",
              "title": "This course is not eligible for Credit/D/Fail grading",
              "credits": 3,
              "year": 3,
              "term": 2,
              "description": "Chemical Engineering Laboratory Experiments to illustrate and use material presented in 300-level Chemical Engineering program courses. Field trips may be required.",
              "prerequisites": "All of"
            },
            {
              "code": "CHBE 365",
              "title": "This course is not eligible for Credit/D/Fail grading",
              "credits": 3,
              "year": 3,
              "term": 2,
              "description": "Biological Engineering Laboratory Laboratory experiments to illustrate key concepts and measurement techniques in biotechnology as used by engineers. Field trips may be required.",
              "prerequisites": "All of"
            },
            {
              "code": "CHBE 381",
              "title": "Biological Engineering and Bio-Manufacturing I",
              "credits": 3,
              "year": 3,
              "term": 2,
              "description": "Biological process engineering in the fields of biotechnology and biomedical engineering; enzymatic and cellular kinetics; cell culture, bioreactor mass transport and process development; bioreactor design and operation. Credit will be granted for only one of"
            }
          ]
        }
      ]
    },
    {
      "year": 4,
      "label": "Year 4",
      "terms": [
        {
          "term": 1,
          "courses": [
            {
              "code": "APSC 450",
              "title": "",
              "credits": 2,
              "year": 4,
              "term": 1,
              "description": "Professional Engineering Practice Legislation affecting the practice of engineering; ethical principles and responsibilities. Management of engineering enterprises; labour relations, safety and environmental legislation. Restricted to engineering undergraduate students in the final year of their program."
            },
            {
              "code": "CHBE 456",
              "title": "Heterogenous Catalysis and Advanced Reactor Design",
              "credits": 3,
              "year": 4,
              "term": 1,
              "description": "Definition of heterogeneous catalysis; properties of catalysts; kinetics of catalytic reactions; ideal heterogeneous reactors; non-isothermal reactor design; mass and heat transfer effects in heterogeneous reactors; examples of industrial reactors. *]",
              "prerequisites": "All of"
            },
            {
              "code": "CHBE 459",
              "title": "Chemical and Biological Engineering Economics",
              "credits": 3,
              "year": 4,
              "term": 1,
              "description": "Estimation of capital and operating costs; interest calculations; taxes; economic comparison of alternatives; economic optimization.",
              "prerequisites": "Third-year or higher standing in BASc or BSc."
            },
            {
              "code": "CHBE 464",
              "title": "Chemical and Biological Engineering Laboratory",
              "credits": 4,
              "year": 4,
              "term": 1,
              "description": "Experiments in unit operations relating to process, environmental and biological engineering. Experiments are designed to provide experience in instrumentation and control. Field trips may be required. ;",
              "prerequisites": "All of"
            }
          ]
        },
        {
          "term": 2,
          "courses": [
            {
              "code": "ELECTIVE",
              "title": "Complementary Studies electives",
              "credits": 3,
              "year": 4,
              "term": 2
            },
            {
              "code": "CHBE 454",
              "title": "Chemical Process and Product Design",
              "credits": 8,
              "year": 4,
              "term": 2,
              "description": "8-month project-based course, integrating chemical engineering concepts with economics, life cycle analysis and health and safety considerations in the design of major chemical processes. ;",
              "prerequisites": "All of"
            },
            {
              "code": "CHBE 471",
              "title": "Chemical Process Engineering",
              "credits": 4,
              "year": 4,
              "term": 2,
              "description": "Selection and design of major equipment used in chemical process plants, including heat exchangers, separators, reactors. Recommended pre-requisite:"
            },
            {
              "code": "CHBE 453",
              "title": "Biological Process and Product Design",
              "credits": 8,
              "year": 4,
              "term": 2,
              "description": "8-month project-based course, integrating chemical and biological engineering concepts with economics, life cycle analysis and health and safety considerations in the design of major biological processes. ;",
              "prerequisites": "All of"
            },
            {
              "code": "CHBE 481",
              "title": "Biological Engineering and Bio-Manufacturing II",
              "credits": 4,
              "year": 4,
              "term": 2,
              "description": "Bioprocess flowsheeting; production-scale fermenter design; product recovery and purification; bioseparations; chromatography; viral inactivation and removal; process validation.",
              "prerequisites": "CHBE381"
            }
          ]
        }
      ]
    }
  ]
}