{
  "faculty": "Applied Science",
  "major": "Civil Engineering",
  "totalCredits": 158,
  "notes": "UBC Applied Science (Engineering) - Civil Engineering curriculum outline. First year is common to most engineering programs.",
  "years": [
    {
      "year": 1,
      "label": "Year 1",
      "terms": [
        {
          "term": 1,
          "courses": [
            {
              "code": "APSC 100",
              "title": "",
              "credits": 3,
              "year": 1,
              "term": 1,
              "description": "Introduction to Engineering I An introduction to the engineering profession including: roles and responsibilities of the engineer, the engineering disciplines, sustainability, an introduction to the engineering design process, introduction and application of the relevant foundational scientific principles, prototyping, engineering graphics, technical communication, and engineering ethics.",
              "prerequisites": "APSC 100\n\nCorequisites: APSC 173"
            },
            {
              "code": "APSC 101",
              "title": "",
              "credits": 3,
              "year": 1,
              "term": 1,
              "description": "Introduction to Engineering II An introduction to the engineering profession including: the engineering design process, sustainability, prototype testing, introduction and application of the relevant foundational scientific principles, team functioning, engineering graphics, and technical communication. Prerequisite:",
              "prerequisites": "APSC 100."
            },
            {
              "code": "APSC 160",
              "title": "",
              "credits": 3,
              "year": 1,
              "term": 1,
              "description": "Introduction to Computation in Engineering Design Analysis and simulation, laboratory data acquisition and processing, measurement interfaces, engineering tools, computer systems organization, programming languages. Credit will only be given for one of:"
            },
            {
              "code": "CHEM 154",
              "title": "",
              "credits": 3,
              "year": 1,
              "term": 1,
              "description": "Chemistry for Engineering Chemical bonding, properties of matter. Chemical thermodynamics with applications to phase equilibria, aqueous equilibria and electrochemistry. Processes at surfaces. [3-3*-0]",
              "prerequisites": "CHEM 12."
            },
            {
              "code": "WRDS 150",
              "title": "",
              "credits": 3,
              "year": 1,
              "term": 1,
              "description": "Writing and Research in the Disciplines Writing and reading in disciplines across the academy, focusing on practices that research disciplines share and those that differentiate them. Restricted to students not in the Faculty of Arts. Credit can be granted for only one of"
            },
            {
              "code": "MATH 100",
              "title": "; intended for students with no previous knowledge of Calculus. Please consult the Faculty of Science Credit Exclusion List:",
              "credits": 3,
              "year": 1,
              "term": 1,
              "description": "https://vancouver.calendar.ubc.ca/faculties-colleges-and-schools/facult… . Not for credit for students with AP Calculus AB, AP Calculus BC, or a passing score on the UBC-SFU-UVIC-UNBC Calculus Challenge Examination.5]",
              "prerequisites": "A grade of 80% or higher in BC Principles of Mathematics 12 or Pre-calculus 12."
            }
          ]
        },
        {
          "term": 2,
          "courses": [
            {
              "code": "MATH 101",
              "title": "Integral Calculus with Applications",
              "credits": 3,
              "year": 1,
              "term": 2,
              "description": "The definite integral, integration techniques, applications, modelling, infinite series.",
              "prerequisites": "One of MATH_V 100, MATH_V 102, MATH_V 104, MATH_V 110, MATH_V 120, MATH_V 180, MATH_V 184.\n\nEquivalency: MATH_V 103, 105."
            },
            {
              "code": "MATH 152",
              "title": "Linear Systems",
              "credits": 3,
              "year": 1,
              "term": 2,
              "description": "2D and 3D geometry, vectors and matrices, eigenvalues and vibration, physical applications. Laboratories demonstrate computer solutions of large systems. Please consult the Faculty of Science Credit Exclusion List: https://vancouver.calendar.ubc.ca/faculties-colleges-and-schools/facult… [3-1*-0]",
              "prerequisites": "Corequisites: [MATH101]\n\nCorequisites: [MATH101] MATH_V 180 (4) Differential Calculus with Applications Topics as for\n\nCorequisites: [MATH101] MATH_V 180 (4) Differential Calculus with Applications Topics as for"
            },
            {
              "code": "PHYS 157",
              "title": "Introductory Physics for Engineers I",
              "credits": 3,
              "year": 1,
              "term": 2,
              "description": "Heat, thermodynamics, oscillations, waves, and sound.",
              "prerequisites": "One of PHYS 12, PHYS 100.\n\nCorequisites: One of MATH 100, MATH 102, MATH 104, MATH 110, MATH 120, MATH 180, MATH 184."
            },
            {
              "code": "PHYS 158",
              "title": "Introductory Physics for Engineers II",
              "credits": 3,
              "year": 1,
              "term": 2,
              "description": "Electricity and magnetism, DC and AC circuits, optics.",
              "prerequisites": "PHYS 157.\n\nCorequisites: One of MATH 101, MATH 103, MATH 105, MATH 121."
            },
            {
              "code": "PHYS 159",
              "title": "or (d) SCIE 001",
              "credits": 1,
              "year": 1,
              "term": 2,
              "description": "A laboratory course with emphasis on experimental design, measurement and analysis techniques.",
              "prerequisites": "One of PHYS 12, PHYS 100.\n\nCorequisites: One of PHYS 157, PHYS 158. PHYS_V 170 (3) Mechanics I Statics of particles, equilibrium or rigid bodies, rigid body statics and internal forces, trusses; kinematics: rectilinear motion; dynamics: Newton's second law, friction, impulse, momentum, work and energy. Recommended pre-requisites: one of PHYS 12, PHYS 100 and one of MATH 100, MATH 102, MATH 104, MATH 110, MATH 120, MATH 180, MATH 184. Recommended co-requisite: one of MATH 101, MATH 103, MATH 105, MATH 121.\n\nCorequisites: One of MATH 200, MATH 217, MATH 226, MATH 253.\n\nCorequisites: One of MATH 200, MATH 217, MATH 226, MATH 253.\n\nCorequisites: One of MATH 200, MATH 217, MATH 226, MATH 253.\n\nCorequisites: One of MATH 200, MATH 217, MATH 226, MATH 253."
            },
            {
              "code": "PHYS 170",
              "title": "",
              "credits": 3,
              "year": 1,
              "term": 2,
              "description": "Mechanics I Statics of particles, equilibrium or rigid bodies, rigid body statics and internal forces, trusses; kinematics: rectilinear motion; dynamics: Newton's second law, friction, impulse, momentum, work and energy. Recommended pre-requisites: one of PHYS 12,",
              "prerequisites": "Corequisites: One of MATH 200, MATH 217, MATH 226, MATH 253, MATH 254."
            },
            {
              "code": "ELECTIVE",
              "title": "Complementary Studies electives",
              "credits": 3,
              "year": 1,
              "term": 2
            }
          ]
        }
      ]
    },
    {
      "year": 2,
      "label": "Year 2",
      "terms": [
        {
          "term": 1,
          "courses": [
            {
              "code": "APSC 278",
              "title": "",
              "credits": 3,
              "year": 2,
              "term": 1,
              "description": "Engineering Materials Atomic bonding; crystal structures and imperfections; properties of metals, ceramics, polymers, wood, concrete and fibre composite materials; selection of materials; corrosion; mechanical testing and heat treatment."
            },
            {
              "code": "APSC 279",
              "title": "",
              "credits": 1,
              "year": 2,
              "term": 1,
              "description": "Engineering Materials Laboratory Atomic bonding; crystal structures and imperfections; properties of metals, ceramics, polymers, wood, concrete and fibre composite materials; selection of materials; corrosion; mechanical testing and heat treatment. [0-2*- 0] Corequisite:",
              "prerequisites": "Corequisites: APSC_V 278"
            },
            {
              "code": "CIVL 201",
              "title": "",
              "credits": 3,
              "year": 2,
              "term": 1,
              "description": "Introduction to Civil Engineering The design process; graphical, visualization and computational tools; civil engineering disciplines; decision-making; teamwork; conceptual design project reflecting community, economic, environmental, sustainability and technical considerations. Corequisite:",
              "prerequisites": "One of APSC 176, ENGL 110, ENGL 111, ENGL 120, ENGL 121, WRDS 150."
            },
            {
              "code": "CIVL 203",
              "title": "",
              "credits": 3,
              "year": 2,
              "term": 1,
              "description": "Technical Communication in Civil Engineering Written and oral communication in civil engineering. Business correspondence, business meetings, poster presentations, oral presentations and technical reports. Restricted to students in second year of the Civil Engineering program. Corequisite:",
              "prerequisites": "One of APSC_V 176, ENGL_V 110, ENGL_V 111, ENGL_V 120, ENGL_V 121, WRDS_V 150."
            },
            {
              "code": "CIVL 204",
              "title": "",
              "credits": 3,
              "year": 2,
              "term": 1,
              "description": "Fundamentals of Environmental Engineering Environmental engineering issues and projects; application of scientific and engineering principles to addressing these; soil, water and air pollution, and remediation.",
              "prerequisites": "CHEM 154."
            },
            {
              "code": "CIVL 210",
              "title": "",
              "credits": 4,
              "year": 2,
              "term": 1,
              "description": "Soil Mechanics I Soil classification, principle of effective stress, analysis of seepage, filter criteria, introduction to shear strength and slope stability analysis. [3-2*-1]",
              "prerequisites": "One of"
            },
            {
              "code": "CIVL 215",
              "title": "",
              "credits": 4,
              "year": 2,
              "term": 1,
              "description": "Fluid Mechanics I Fluid properties, hydrostatics, kinematics, and fluid dynamics: energy and momentum methods with applications. Dimensional analysis, modelling, introduction to flow in pipes and forces on immersed objects.",
              "prerequisites": "All of PHYS 170, MATH 101."
            }
          ]
        },
        {
          "term": 2,
          "courses": [
            {
              "code": "CIVL 230",
              "title": "",
              "credits": 4,
              "year": 2,
              "term": 2,
              "description": "Solid Mechanics Stress and strain, Hooke's law, axially loaded members, torsion, shear forces and bending moments in beams, bending and shear stresses in beams, composite members, introduction to inelastic and statically indeterminate problems.",
              "prerequisites": "All of PHYS 170, MATH 101."
            },
            {
              "code": "CIVL 231",
              "title": "",
              "credits": 4,
              "year": 2,
              "term": 2,
              "description": "Structural Mechanics Deflection of beams and structural systems; analysis of determinate structures; combined axial load and bending; beam- columns; buckling (stability); biaxial stresses and strains; construction and testing of model structures.",
              "prerequisites": "All of MATH 152,"
            },
            {
              "code": "CIVL 235",
              "title": "",
              "credits": 4,
              "year": 2,
              "term": 2,
              "description": "Plane Surveying Theory and application of plane surveying methods. Introduction to and use of compass, transit, tape, and level. Construction and topographic surveys. Reduction of field data and construction of drawings. Demonstration of modern instruments, remote sensing methods and geographical information systems (GIS)."
            },
            {
              "code": "EOSC 210",
              "title": "",
              "credits": 3,
              "year": 2,
              "term": 2,
              "description": "Earth Science for Engineers Focus on the interaction between society and the geologic environment. Locating, assessing and developing natural resources; understanding and preparing for natural hazards, design of structures and waste disposal sites.",
              "prerequisites": "Corequisites: One of CIVL 215, MINE 200."
            },
            {
              "code": "MATH 253",
              "title": "Multivariable Calculus",
              "credits": 3,
              "year": 2,
              "term": 2,
              "description": "Partial and directional derivatives; maxima and minima; Lagrange multipliers and second derivative test; multiple integrals and applications. Please consult the Faculty of Science Credit Exclusion List: https://vancouver.calendar.ubc.ca/faculties-colleges-and-schools/facult…",
              "prerequisites": "One of MATH 101, MATH 103, MATH 105, MATH 121, SCIE 001."
            },
            {
              "code": "MATH 256",
              "title": "Differential Equations",
              "credits": 3,
              "year": 2,
              "term": 2,
              "description": "Linear ordinary differential equations, Laplace transforms, Fourier series and separation of variables for linear partial differential equations. Consult the Faculty of Science Credit Exclusion List:\nhttps://vancouver.calendar.ubc.ca/faculties-colleges-and-schools/facult…\n.",
              "prerequisites": "One of MATH_V 101, MATH_V 103, MATH_V 105, MATH_V 121, SCIE_V 001 and one of MATH_V 152, MATH_V 221, MATH_V 223.\n\nCorequisites: One of MATH_V 200, MATH_V 217, MATH_V 226, MATH_V 253."
            },
            {
              "code": "STAT 251",
              "title": "",
              "credits": 3,
              "year": 2,
              "term": 2
            },
            {
              "code": "ELECTIVE",
              "title": "2This course satisfies the impact of technology on society requirement within the Complementary Studies Courses.",
              "credits": 3,
              "year": 2,
              "term": 2
            }
          ]
        }
      ]
    },
    {
      "year": 3,
      "label": "Year 3",
      "terms": [
        {
          "term": 1,
          "courses": [
            {
              "code": "CIVL 300",
              "title": "",
              "credits": 3,
              "year": 3,
              "term": 1,
              "description": "Construction Engineering and Management Project delivery systems: traditional; construction management; turnkey; project management. Network planning methods. Activity planning, including construction methods selection. Estimating, bidding and bonding. Project control tools and procedures. Human resources, including equity considerations; occupational health and safety and quality control."
            },
            {
              "code": "CIVL 301",
              "title": "",
              "credits": 3,
              "year": 3,
              "term": 1,
              "description": "Modelling and Decision-Making in Civil Engineering Introduction to systems engineering; applications of decision-making, modelling, and programming, including probabilistic analyses and optimization, to civil engineering projects; review of numerical methods",
              "prerequisites": "All of MATH 152,"
            },
            {
              "code": "CIVL 302",
              "title": "",
              "credits": 3,
              "year": 3,
              "term": 1,
              "description": "Civil Engineering Impacts The social and biophysical context of infrastructure and the impact of civil engineering on people, the economy, and the environment. Specific topics vary from year to year. Prerequisite:"
            },
            {
              "code": "CIVL 303",
              "title": "",
              "credits": 3,
              "year": 3,
              "term": 1,
              "description": "Computational Tools in Civil Engineering Computational and numerical solutions to civil engineering problems; application to a civil engineering design project that reflects community, economic, environmental and technical considerations.",
              "prerequisites": "All of"
            },
            {
              "code": "CIVL 305",
              "title": "",
              "credits": 3,
              "year": 3,
              "term": 1,
              "description": "Introduction to Environmental Engineering Applications Environmental legislation; risk assessment; urban water; mass balance; water and wastewater treatment; environmental impact assessment. Prerequisite:"
            },
            {
              "code": "CIVL 311",
              "title": "",
              "credits": 4,
              "year": 3,
              "term": 1,
              "description": "Soil Mechanics II One-dimensional compression and stress-strain response of soils with application to estimation of the settlements and capacities of foundations and of retaining walls. [3-2*-1] Prerequisite:"
            }
          ]
        },
        {
          "term": 2,
          "courses": [
            {
              "code": "CIVL 315",
              "title": "",
              "credits": 4,
              "year": 3,
              "term": 2,
              "description": "Fluid Mechanics II Two-dimensional flow around immersed objects; velocity and pressure fields; lift and drag on cylinders and aerofoils; fluid loads on structures and structural response; pumps and turbines; analysis and design of pipeline systems; unsteady flow in pipes; frictionless water hammer analysis. [3-2*-1]",
              "prerequisites": "One of ENVE 201,"
            },
            {
              "code": "CIVL 316",
              "title": "",
              "credits": 4,
              "year": 3,
              "term": 2,
              "description": "Hydrology and Open Channel Flow Introduction to open channel hydraulics, engineering hydrology, and water resource systems; estimation of design discharge; flood statistics; nonuniform steady open channel flow; energy and momentum principles, backwater analysis; culvert and bridge hydraulics. [3-2*-1] Prerequisite:"
            },
            {
              "code": "CIVL 320",
              "title": "",
              "credits": 3,
              "year": 3,
              "term": 2,
              "description": "Civil Engineering Materials The structure and properties of common Civil Engineering materials: aggregates, Portland cement, concrete, wood, steel and other construction materials. The emphasis is on the relationship between the structure of materials and their mechanical and durability properties.",
              "prerequisites": "All of APSC_V 278, APSC_V 279."
            },
            {
              "code": "CIVL 331",
              "title": "",
              "credits": 4,
              "year": 3,
              "term": 2,
              "description": "Steel and Timber Design Introduction to limit states design of steel and timber structures: design objectives, design loads and load combinations, structural safety, material properties, design of tension and compression members, beams, columns, and connections. Prerequisite:"
            },
            {
              "code": "CIVL 332",
              "title": "",
              "credits": 3,
              "year": 3,
              "term": 2,
              "description": "Structural Analysis Introduction to indeterminate structural analysis; approximate analysis of structures; calculation of displacements using virtual work; flexibility (force) method; stiffness method for frames; moment distribution method; influence lines, introduction to structural dynamics.",
              "prerequisites": "All of"
            },
            {
              "code": "CIVL 340",
              "title": "",
              "credits": 3,
              "year": 3,
              "term": 2,
              "description": "Transportation Engineering I The analysis and design of transportation facilities; vehicle motion and vehicle/pavement interaction; geometric design of roadways; traffic flow analysis and level of service; fundamentals of intersection design; traffic safety.",
              "prerequisites": "STAT 251."
            }
          ]
        }
      ]
    },
    {
      "year": 4,
      "label": "Year 4",
      "terms": [
        {
          "term": 1,
          "courses": [
            {
              "code": "CIVL 402",
              "title": "",
              "credits": 3,
              "year": 4,
              "term": 1,
              "description": "Professionalism and Law in Civil Engineering The Professional Governance Act; professional ethics, conflicts of interest, confidentiality and accountability; health and safety; sustainable development and environmental stewardship; equity considerations; design and construction contracts, specifications and tendering; labour and employment law; dispute resolution; evidence and expert witnesses; torts and legal liability."
            },
            {
              "code": "CIVL 403",
              "title": "",
              "credits": 3,
              "year": 4,
              "term": 1,
              "description": "Engineering Economic Analysis Time value of money; cash flow analysis; comparing options; depreciation, taxes, and inflation; financial accounting; company structures; public sector projects; decision-making."
            },
            {
              "code": "CIVL 409",
              "title": "",
              "credits": 3,
              "year": 4,
              "term": 1,
              "description": "Municipal Engineering Design of municipal infrastructure, including streets, water supply networks, and sewers, garbage collection and solid waste management. Focus is on solutions for providing an adequate water supply, collecting and disposing of stormwater and sewage, and managing excess stormwater flow.",
              "prerequisites": "All of"
            }
          ]
        },
        {
          "term": 2,
          "courses": [
            {
              "code": "CIVL 430",
              "title": "",
              "credits": 4,
              "year": 4,
              "term": 2,
              "description": "Design of Concrete Structures Non-linear response of reinforced concrete members subjected to axial load, bending and shear; design of simple one-way members including beams, columns, slabs and footings. [3-2*-1] Prerequisite:"
            },
            {
              "code": "CIVL 445",
              "title": "",
              "credits": 3,
              "year": 4,
              "term": 2,
              "description": "Civil Engineering Design Project I Integration and application of previously acquired knowledge and skills to find design solutions for a multi-disciplinary civil engineering project. Focus on conceptual and preliminary design. [2*-0- 4] Prerequisite:"
            },
            {
              "code": "CIVL 446",
              "title": "",
              "credits": 2,
              "year": 4,
              "term": 2,
              "description": "Civil Engineering Design Project II Integration and application of previously acquired knowledge and skills to find design solutions for a multi-disciplinary civil engineering design project. Focus on detailed design. [2*-0-2] Prerequisite:"
            },
            {
              "code": "ELECTIVE",
              "title": "Technical electives",
              "credits": 15,
              "year": 4,
              "term": 2
            }
          ]
        }
      ]
    }
  ]
}