{
  "faculty": "Applied Science",
  "major": "Computer Engineering",
  "totalCredits": 142,
  "notes": "UBC Applied Science (Engineering) - Computer Engineering curriculum outline. First year is common to most engineering programs.",
  "years": [
    {
      "year": 1,
      "label": "Year 1",
      "terms": [
        {
          "term": 1,
          "courses": [
            {
              "code": "APSC 100",
              "title": "",
              "credits": 3,
              "year": 1,
              "term": 1,
              "description": "Introduction to Engineering I An introduction to the engineering profession including: roles and responsibilities of the engineer, the engineering disciplines, sustainability, an introduction to the engineering design process, introduction and application of the relevant foundational scientific principles, prototyping, engineering graphics, technical communication, and engineering ethics.",
              "prerequisites": "APSC 100\n\nCorequisites: APSC 173"
            },
            {
              "code": "APSC 101",
              "title": "",
              "credits": 3,
              "year": 1,
              "term": 1,
              "description": "Introduction to Engineering II An introduction to the engineering profession including: the engineering design process, sustainability, prototype testing, introduction and application of the relevant foundational scientific principles, team functioning, engineering graphics, and technical communication.",
              "prerequisites": "APSC 100."
            },
            {
              "code": "APSC 160",
              "title": "",
              "credits": 3,
              "year": 1,
              "term": 1,
              "description": "Introduction to Computation in Engineering Design Analysis and simulation, laboratory data acquisition and processing, measurement interfaces, engineering tools, computer systems organization, programming languages. Credit will only be given for one of: APSC 160, CPSC 301, or EOSC 211."
            },
            {
              "code": "CHEM 154",
              "title": "",
              "credits": 3,
              "year": 1,
              "term": 1
            },
            {
              "code": "WRDS 150",
              "title": "",
              "credits": 3,
              "year": 1,
              "term": 1
            },
            {
              "code": "MATH 100",
              "title": "Differential Calculus with Applications\n\n\nDerivatives of elementary functions",
              "credits": 3,
              "year": 1,
              "term": 1,
              "description": "Differential Calculus with Applications Derivatives of elementary functions. Applications and modelling: graphing, optimization. Consult the Faculty of Science Credit Exclusion List: https://vancouver.calendar.ubc.ca/faculties-colleges-and-schools/facult…",
              "prerequisites": "A score of 80% or higher in BC Pre-calculus 12. High school calculus is strongly recommended."
            }
          ]
        },
        {
          "term": 2,
          "courses": [
            {
              "code": "MATH 101",
              "title": "",
              "credits": 3,
              "year": 1,
              "term": 2,
              "description": "Integral Calculus with Applications The definite integral, integration techniques, applications, modelling, infinite series. Equivalency:"
            },
            {
              "code": "MATH 152",
              "title": "Linear Systems\n\n\n2D and 3D geometry, vectors and matrices, eigenvalues and vibration, physical applications",
              "credits": 3,
              "year": 1,
              "term": 2,
              "description": "Linear Systems 2D and 3D geometry, vectors and matrices, eigenvalues and vibration, physical applications. Laboratories demonstrate computer solutions of large systems. Please consult the Faculty of Science Credit Exclusion List: https://vancouver.calendar.ubc.ca/faculties-colleges-and-schools/facult… [3-1*-0] Corequisite: [MATH101]"
            },
            {
              "code": "PHYS 157",
              "title": "",
              "credits": 3,
              "year": 1,
              "term": 2
            },
            {
              "code": "PHYS 158",
              "title": "",
              "credits": 3,
              "year": 1,
              "term": 2
            },
            {
              "code": "PHYS 159",
              "title": "",
              "credits": 1,
              "year": 1,
              "term": 2
            },
            {
              "code": "PHYS 170",
              "title": "",
              "credits": 3,
              "year": 1,
              "term": 2
            },
            {
              "code": "ELECTIVE",
              "title": "Complementary Studies electives",
              "credits": 3,
              "year": 1,
              "term": 2
            }
          ]
        }
      ]
    },
    {
      "year": 2,
      "label": "Year 2",
      "terms": [
        {
          "term": 1,
          "courses": [
            {
              "code": "CPEN 211",
              "title": "",
              "credits": 5,
              "year": 2,
              "term": 1,
              "description": "There will be 12 lab experiments to complete during the term, 6 on Digital Systems plus 6 on Microcomputers, plus possibly some homework assignments. These labs can be mostly done on your own computer using digital logic boards that you purchase and various (free) software packages — see below on Course Materials below regarding important details. Bring your completed work along to the scheduled Lab session and demonstrate it working and it will be graded by the TAs on the quality of your solution plus your confidence and competence in demonstrating your knowledge of the solution.",
              "prerequisites": "Prerequisites: APSC 160 – Introduction to Computation in Engineering Design"
            },
            {
              "code": "CPEN 221",
              "title": "",
              "credits": 5,
              "year": 2,
              "term": 1,
              "description": "Design, implementation, reasoning about software systems: Abstraction and specification of software, testing, verification, abstract data types, object-oriented design, design patterns, type hierarchies, concurrent software design. [3-2-1*]",
              "prerequisites": "Prerequisites: APSC 160 – Introduction to Computation in Engineering Design"
            },
            {
              "code": "CPEN 281",
              "title": "or",
              "credits": 3,
              "year": 2,
              "term": 1,
              "description": "Written and oral communication in engineering. Technical description, report preparation, business correspondence, and oral presentation of technical material. Restricted to students in second year of Electrical and Computer Engineering programs. Credit will be granted for only one of ELEC 281, CPEN 281, BMEG 201, or APSC 201.",
              "prerequisites": "Prerequisites: ONE ofAPSC 176 – Engineering Communication ENGL 110 – Approaches to LiteratureENGL 111 – Approaches to Non-fictional ProseENGL 112 – Strategies for University WritingENGL 120 – Literature and CriticismENGL 121 – Introduction to Literary TheoryWRDS 150 – Writing and Research in the Disciplines"
            },
            {
              "code": "CPSC 221",
              "title": "",
              "credits": 4,
              "year": 2,
              "term": 1
            },
            {
              "code": "CPEN 212",
              "title": "",
              "credits": 4,
              "year": 2,
              "term": 1,
              "description": "Abstractions that support program execution on a modern computing system. Virtualization and indirection, dynamic dispatch, hardware and operating system abstractions, program structure, memory structure and management, concurrency, and interconnects.",
              "prerequisites": "Prerequisites: CPEN 211; And one of CPEN 221, CPEN 223, or CPSC 259"
            }
          ]
        },
        {
          "term": 2,
          "courses": [
            {
              "code": "ELEC 201",
              "title": "",
              "credits": 4,
              "year": 2,
              "term": 2,
              "description": "Your request has been blocked and logged because it has been identified as potentially automated or malicious by an automated UBC Cybersecurity system.",
              "prerequisites": "MATH 101 – Integral Calculus with Applications AND ONE of PHYS 108 – Enriched Physics II PHYS 118 – Electricity, Light and Radiation PHYS 158 – Introductory Physics for Engineers II Corequisites: ONE of MATH 255 – Ordinary Differential Equations MATH 256 – Differential Equations MATH 265 – Linear Differential Equations"
            },
            {
              "code": "MATH 220",
              "title": "Mathematical Proof\n\n\nSets and functions; induction; cardinality; properties of the real numbers; sequences, series, and limits",
              "credits": 3,
              "year": 2,
              "term": 2,
              "description": "Mathematical Proof Sets and functions; induction; cardinality; properties of the real numbers; sequences, series, and limits. Logic, structure, style, and clarity of proofs emphasized throughout.",
              "prerequisites": "Either (a) a score of 64% or higher in one of MATH 101, MATH 103, MATH 105, SCIE 001 or (b) one of MATH 121, MATH 200, MATH 217, MATH 226, MATH 253, MATH 254."
            },
            {
              "code": "MATH 253",
              "title": "Multivariable Calculus\n\n\nPartial and directional derivatives; maxima and minima; Lagrange multipliers and second derivative test; multiple integrals and applications",
              "credits": 3,
              "year": 2,
              "term": 2,
              "description": "Multivariable Calculus Partial and directional derivatives; maxima and minima; Lagrange multipliers and second derivative test; multiple integrals and applications. Please consult the Faculty of Science Credit Exclusion List: https://vancouver.calendar.ubc.ca/faculties-colleges-and-schools/facult…",
              "prerequisites": "One of MATH 101, MATH 103, MATH 105, MATH 121, SCIE 001."
            },
            {
              "code": "MATH 256",
              "title": "Differential Equations\n\n\nLinear ordinary differential equations, Laplace transforms, Fourier series and separation of variables for linear partial differential equations",
              "credits": 3,
              "year": 2,
              "term": 2,
              "description": "Differential Equations Linear ordinary differential equations, Laplace transforms, Fourier series and separation of variables for linear partial differential equations. Consult the Faculty of Science Credit Exclusion List: https://vancouver.calendar.ubc.ca/faculties-colleges-and-schools/facult… .",
              "prerequisites": "One of"
            },
            {
              "code": "ELECTIVE",
              "title": "Electives",
              "credits": 4,
              "year": 2,
              "term": 2
            }
          ]
        }
      ]
    },
    {
      "year": 3,
      "label": "Year 3",
      "terms": [
        {
          "term": 1,
          "courses": [
            {
              "code": "CPEN 331",
              "title": "",
              "credits": 4,
              "year": 3,
              "term": 1,
              "description": "Introduction to operating systems, their design and their implementation. Process concurrency, synchronization, communication and scheduling. Device drivers, memory management, virtual memory, file systems, networking and security. [3-3-0]",
              "prerequisites": "Prerequisites: CPEN 212 – Computing Systems II AND CPEN 221 – Software Construction I"
            },
            {
              "code": "CPEN 391",
              "title": "",
              "credits": 6,
              "year": 3,
              "term": 1,
              "description": "Design and implementation of a hardware platform and software design and implementation at the operating system and application layers. Project management skills. Effective presentations. Going-forward, credit will be given for only one of CPEN291, CPEN391. [2-6-0]",
              "prerequisites": "Prerequisites: ALL OF CPEN 212, CPSC 221, ELEC 201"
            }
          ]
        },
        {
          "term": 2,
          "courses": [
            {
              "code": "CPSC 320",
              "title": "",
              "credits": 3,
              "year": 3,
              "term": 2
            },
            {
              "code": "MATH 318",
              "title": "One of , , ,",
              "credits": 3,
              "year": 3,
              "term": 2,
              "description": "Probability with Physical Applications Random variables, discrete and continuous distributions. Random walk, Markov chains, Monte Carlo methods. Characteristic functions, limit laws. Please consult the Faculty of Science Credit Exclusion List: https://vancouver.calendar.ubc.ca/faculties-colleges-and-schools/facult… Corequisite: One of MATH 256, MATH 257, MATH 316, MATH 358, MECH 358, PHYS 312.",
              "prerequisites": "One of MATH 152, MATH 221, MATH 223."
            },
            {
              "code": "ELECTIVE",
              "title": "Electives",
              "credits": 16,
              "year": 3,
              "term": 2
            }
          ]
        }
      ]
    },
    {
      "year": 4,
      "label": "Year 4",
      "terms": [
        {
          "term": 1,
          "courses": [
            {
              "code": "APSC 450",
              "title": "",
              "credits": 2,
              "year": 4,
              "term": 1,
              "description": "Management of engineering enterprises; labour relations, safety and environmental legislation. Restricted to engineering undergraduate students in the final year of their program."
            },
            {
              "code": "CPEN 481",
              "title": "or",
              "credits": 3,
              "year": 4,
              "term": 1,
              "description": "Your request has been blocked and logged because it has been identified as potentially automated or malicious by an automated UBC Cybersecurity system."
            }
          ]
        },
        {
          "term": 2,
          "courses": [
            {
              "code": "CPEN 491",
              "title": "",
              "credits": 10,
              "year": 4,
              "term": 2,
              "description": "Design, analysis, and implementation of solutions in response to a real world computer engineering problem, provided by industry, research laboratories, or other suitable entities. Includes coverage of topics such as project management.",
              "prerequisites": "Prerequisites: ALL OF CPEN 331 – Operating Systems CPSC 320 – Intermediate Algorithm Design and Analysis AND ONE OF CPEN 311 – Digital Systems Design CPEN 322 – Software Construction II AND ONE OF CPEN 291 – Computer Engineering Design Studio I CPEN 391 – Computer Engineering Design Studio II"
            },
            {
              "code": "ELECTIVE",
              "title": "Electives",
              "credits": 20,
              "year": 4,
              "term": 2
            }
          ]
        }
      ]
    }
  ]
}