{
  "faculty": "Applied Science",
  "major": "Electrical Engineering",
  "totalCredits": 145,
  "notes": "UBC Applied Science (Engineering) - Electrical Engineering curriculum outline. First year is common to most engineering programs.",
  "years": [
    {
      "year": 1,
      "label": "Year 1",
      "terms": [
        {
          "term": 1,
          "courses": [
            {
              "code": "APSC 100",
              "title": "",
              "credits": 3,
              "year": 1,
              "term": 1,
              "description": "Introduction to Engineering I An introduction to the engineering profession including: roles and responsibilities of the engineer, the engineering disciplines, sustainability, an introduction to the engineering design process, introduction and application of the relevant foundational scientific principles, prototyping, engineering graphics, technical communication, and engineering ethics.",
              "prerequisites": "APSC 100\n\nCorequisites: APSC 173"
            },
            {
              "code": "APSC 101",
              "title": "",
              "credits": 3,
              "year": 1,
              "term": 1,
              "description": "Introduction to Engineering II An introduction to the engineering profession including: the engineering design process, sustainability, prototype testing, introduction and application of the relevant foundational scientific principles, team functioning, engineering graphics, and technical communication. Prerequisite:",
              "prerequisites": "APSC 100."
            },
            {
              "code": "APSC 160",
              "title": "",
              "credits": 3,
              "year": 1,
              "term": 1,
              "description": "Introduction to Computation in Engineering Design Analysis and simulation, laboratory data acquisition and processing, measurement interfaces, engineering tools, computer systems organization, programming languages. Credit will only be given for one of:"
            },
            {
              "code": "CHEM 154",
              "title": "",
              "credits": 3,
              "year": 1,
              "term": 1,
              "description": "Chemistry for Engineering Chemical bonding, properties of matter. Chemical thermodynamics with applications to phase equilibria, aqueous equilibria and electrochemistry. Processes at surfaces. [3-3*-0]",
              "prerequisites": "CHEM 12."
            },
            {
              "code": "WRDS 150",
              "title": "",
              "credits": 3,
              "year": 1,
              "term": 1,
              "description": "Writing and Research in the Disciplines Writing and reading in disciplines across the academy, focusing on practices that research disciplines share and those that differentiate them. Restricted to students not in the Faculty of Arts. Credit can be granted for only one of"
            },
            {
              "code": "MATH 100",
              "title": "; intended for students with no previous knowledge of Calculus. Please consult the Faculty of Science Credit Exclusion List:",
              "credits": 3,
              "year": 1,
              "term": 1,
              "description": "https://vancouver.calendar.ubc.ca/faculties-colleges-and-schools/facult… . Not for credit for students with AP Calculus AB, AP Calculus BC, or a passing score on the UBC-SFU-UVIC-UNBC Calculus Challenge Examination.5]",
              "prerequisites": "A grade of 80% or higher in BC Principles of Mathematics 12 or Pre-calculus 12."
            }
          ]
        },
        {
          "term": 2,
          "courses": [
            {
              "code": "MATH 101",
              "title": "Integral Calculus with Applications",
              "credits": 3,
              "year": 1,
              "term": 2,
              "description": "The definite integral, integration techniques, applications, modelling, infinite series.",
              "prerequisites": "One of MATH_V 100, MATH_V 102, MATH_V 104, MATH_V 110, MATH_V 120, MATH_V 180, MATH_V 184.\n\nEquivalency: MATH_V 103, 105."
            },
            {
              "code": "MATH 152",
              "title": "Linear Systems",
              "credits": 3,
              "year": 1,
              "term": 2,
              "description": "2D and 3D geometry, vectors and matrices, eigenvalues and vibration, physical applications. Laboratories demonstrate computer solutions of large systems. Please consult the Faculty of Science Credit Exclusion List: https://vancouver.calendar.ubc.ca/faculties-colleges-and-schools/facult… [3-1*-0]",
              "prerequisites": "Corequisites: [MATH101]\n\nCorequisites: [MATH101] MATH_V 180 (4) Differential Calculus with Applications Topics as for\n\nCorequisites: [MATH101] MATH_V 180 (4) Differential Calculus with Applications Topics as for"
            },
            {
              "code": "PHYS 157",
              "title": "Introductory Physics for Engineers I",
              "credits": 3,
              "year": 1,
              "term": 2,
              "description": "Heat, thermodynamics, oscillations, waves, and sound.",
              "prerequisites": "One of PHYS 12, PHYS 100.\n\nCorequisites: One of MATH 100, MATH 102, MATH 104, MATH 110, MATH 120, MATH 180, MATH 184."
            },
            {
              "code": "PHYS 158",
              "title": "Introductory Physics for Engineers II",
              "credits": 3,
              "year": 1,
              "term": 2,
              "description": "Electricity and magnetism, DC and AC circuits, optics.",
              "prerequisites": "PHYS 157.\n\nCorequisites: One of MATH 101, MATH 103, MATH 105, MATH 121."
            },
            {
              "code": "PHYS 159",
              "title": "or (d) SCIE 001",
              "credits": 1,
              "year": 1,
              "term": 2,
              "description": "A laboratory course with emphasis on experimental design, measurement and analysis techniques.",
              "prerequisites": "One of PHYS 12, PHYS 100.\n\nCorequisites: One of PHYS 157, PHYS 158. PHYS_V 170 (3) Mechanics I Statics of particles, equilibrium or rigid bodies, rigid body statics and internal forces, trusses; kinematics: rectilinear motion; dynamics: Newton's second law, friction, impulse, momentum, work and energy. Recommended pre-requisites: one of PHYS 12, PHYS 100 and one of MATH 100, MATH 102, MATH 104, MATH 110, MATH 120, MATH 180, MATH 184. Recommended co-requisite: one of MATH 101, MATH 103, MATH 105, MATH 121.\n\nCorequisites: One of MATH 200, MATH 217, MATH 226, MATH 253.\n\nCorequisites: One of MATH 200, MATH 217, MATH 226, MATH 253.\n\nCorequisites: One of MATH 200, MATH 217, MATH 226, MATH 253.\n\nCorequisites: One of MATH 200, MATH 217, MATH 226, MATH 253."
            },
            {
              "code": "PHYS 170",
              "title": "",
              "credits": 3,
              "year": 1,
              "term": 2,
              "description": "Mechanics I Statics of particles, equilibrium or rigid bodies, rigid body statics and internal forces, trusses; kinematics: rectilinear motion; dynamics: Newton's second law, friction, impulse, momentum, work and energy. Recommended pre-requisites: one of PHYS 12,",
              "prerequisites": "Corequisites: One of MATH 200, MATH 217, MATH 226, MATH 253, MATH 254."
            },
            {
              "code": "ELECTIVE",
              "title": "Complementary Studies electives",
              "credits": 3,
              "year": 1,
              "term": 2
            }
          ]
        }
      ]
    },
    {
      "year": 2,
      "label": "Year 2",
      "terms": [
        {
          "term": 1,
          "courses": [
            {
              "code": "CPEN 211",
              "title": "",
              "credits": 5,
              "year": 2,
              "term": 1,
              "description": "There will be 12 lab experiments to complete during the term, 6 on Digital Systems plus 6 on Microcomputers, plus possibly some homework assignments. These labs can be mostly done on your own computer using digital logic boards that you purchase and various (free) software packages — see below on Course Materials below regarding important details. Bring your completed work along to the scheduled Lab session and demonstrate it working and it will be graded by the TAs on the quality of your solution plus your confidence and competence in demonstrating your knowledge of the solution.",
              "prerequisites": "Prerequisites: APSC 160 – Introduction to Computation in Engineering Design"
            },
            {
              "code": "CPSC 259",
              "title": "",
              "credits": 4,
              "year": 2,
              "term": 1,
              "description": "Data Structures and Algorithms for Electrical Engineers Advanced procedural programming. Fundamental algorithms for sorting and searching. Data structures including lists, trees, and hash tables. Introduction to scripting languages and file input/output.",
              "prerequisites": "APSC 160."
            },
            {
              "code": "ELEC 201",
              "title": "",
              "credits": 4,
              "year": 2,
              "term": 1,
              "description": "The fundamentals of analysis of lumped linear time-invariant circuits; network theorems; operational amplifiers; first order circuits; DC analysis of diodes, BJT and FET circuits. [4-2*-1*]",
              "prerequisites": "Prerequisites: MATH 101 – Integral Calculus with Applications AND ONE of PHYS 108 – Enriched Physics II PHYS 118 – Electricity, Light and Radiation PHYS 158 – Introductory Physics for Engineers II\n\nCorequisites: ONE of MATH 255 – Ordinary Differential Equations MATH 256 – Differential Equations MATH 265 – Linear Differential Equations"
            },
            {
              "code": "ELEC 202",
              "title": "",
              "credits": 4,
              "year": 2,
              "term": 1,
              "description": "Phasor analysis and AC three phase power; transfer functions; Bode plots; filters and resonance; Laplace transforms; transformers; two-port networks.  First and second order circuits.",
              "prerequisites": "Prerequisites: MATH 101 – Integral Calculus with Applications to Physical Sciences and Engineering AND ONE of PHYS 118 – Electricity, Light and Radiation PHYS 158 – Introductory Physics for Engineers II AND ONE of MATH 255 – Ordinary Differential Equations MATH 256 – Differential Equations AND ONE of ELEC 201 – Circuit Analysis I ELEC 203 – Basic Circuit Analysis"
            },
            {
              "code": "ELEC 211",
              "title": "",
              "credits": 2,
              "year": 2,
              "term": 1,
              "description": "Electrostatics, electric currents, dielectrics, capacitance, electrostatic potential, magnetostatics. [2-0-1]",
              "prerequisites": "Prerequisites: ONE OF MATH 263 – Differential Equations MATH 253 – Ordinary Differential Equations AND ONE OF PHYS 108 – Enriched Physics II PHYS 118 – Electricity, Light and Radiation PHYS 158 – Introductory Physics for Engineers II *note APSC 178 also accepted\n\nCorequisites: MATH 264 – Vector Calculus for Electrical Engineering (MATH 264 will be taught with ELEC 211 in an integrated fashion; the two courses will share the 3 weekly hours allotted to them.)"
            },
            {
              "code": "ELEC 221",
              "title": "",
              "credits": 4,
              "year": 2,
              "term": 1,
              "description": "Complex numbers, LTI systems,  convolution sum, discrete-time Fourier series and transforms, z-transform, sampling, introduction to filtering and modulation, feedback systems, stability. [3-0-2]",
              "prerequisites": "Prerequisites: ONE of MATH 255 – Ordinary Differential Equations MATH 256 – Differential equations"
            }
          ]
        },
        {
          "term": 2,
          "courses": [
            {
              "code": "ELEC 281",
              "title": "or",
              "credits": 3,
              "year": 2,
              "term": 2,
              "description": "Written and oral communication in engineering. Technical description, report preparation, business correspondence, and oral presentation of technical material. Restricted to students in second year of Electrical and Computer Engineering programs. Credit will be granted for only one of ELEC 281, CPEN 281, BMEG 201, or APSC 201.",
              "prerequisites": "Prerequisites: ONE ofAPSC 176 – Engineering Communication ENGL 110 – Approaches to LiteratureENGL 111 – Approaches to Non-fictional ProseENGL 112 – Strategies for University WritingENGL 120 – Literature and CriticismENGL 121 – Introduction to Literary TheoryWRDS 150 – Writing and Research in the Disciplines"
            },
            {
              "code": "ELEC 291",
              "title": "",
              "credits": 6,
              "year": 2,
              "term": 2,
              "description": "Design projects involving electronic devices and circuits, electromagnetics, signals and systems, and microcomputers.  [2-6-0]",
              "prerequisites": "Prerequisites: ALL of ELEC 201 and CPEN 211"
            },
            {
              "code": "MATH 253",
              "title": "Multivariable Calculus",
              "credits": 3,
              "year": 2,
              "term": 2,
              "description": "Partial and directional derivatives; maxima and minima; Lagrange multipliers and second derivative test; multiple integrals and applications. Please consult the Faculty of Science Credit Exclusion List: https://vancouver.calendar.ubc.ca/faculties-colleges-and-schools/facult…",
              "prerequisites": "One of MATH 101, MATH 103, MATH 105, MATH 121, SCIE 001."
            },
            {
              "code": "MATH 256",
              "title": "Differential Equations",
              "credits": 3,
              "year": 2,
              "term": 2,
              "description": "Linear ordinary differential equations, Laplace transforms, Fourier series and separation of variables for linear partial differential equations. Consult the Faculty of Science Credit Exclusion List:\nhttps://vancouver.calendar.ubc.ca/faculties-colleges-and-schools/facult…\n.",
              "prerequisites": "One of MATH_V 101, MATH_V 103, MATH_V 105, MATH_V 121, SCIE_V 001 and one of MATH_V 152, MATH_V 221, MATH_V 223.\n\nCorequisites: One of MATH_V 200, MATH_V 217, MATH_V 226, MATH_V 253."
            },
            {
              "code": "MATH 264",
              "title": "content is strongly coupled to BMEG 220 and ELEC 211 with topics and student evaluations weighted accordingly. Prerequisite: One of MATH 200, MATH 217, MATH 226, MATH 253, MATH 254. Corequisite: One of BMEG 220, ELEC 211",
              "credits": 1,
              "year": 2,
              "term": 2,
              "description": "Vector Calculus for Electrical Engineering Divergence, gradient, curl, theorems of Gauss and Stokes. Applications to Electrostatics and Magnetostatics. MATH 264 content is strongly coupled to BMEG 220 and ELEC 211 with topics and student evaluations weighted accordingly. Corequisite: One of BMEG 220, ELEC 211.",
              "prerequisites": "One of"
            },
            {
              "code": "ELEC 271",
              "title": "Students in the Biomedical Engineering Option will take  and  instead of .",
              "credits": 3,
              "year": 2,
              "term": 2,
              "description": "Effective communication in a multidisciplinary environment, introduction to emerging areas of biomedical engineering and biotechnology, ethics, and responsibility. Restricted to students admitted to the Biomedical Engineering program in Electrical Engineering.",
              "prerequisites": "Corequisites: ELEC 202"
            }
          ]
        }
      ]
    },
    {
      "year": 3,
      "label": "Year 3",
      "terms": [
        {
          "term": 1,
          "courses": [
            {
              "code": "ELEC 301",
              "title": "",
              "credits": 4,
              "year": 3,
              "term": 1,
              "description": "Analysis and design of electronic circuits; biasing of and small-signal models for transistors; frequency response of amplifiers; feedback and stability aspects of amplifier design; OP-AMPs; active filters; oscillators; IC specification and selection. Credit will only be given for one of EECE 356, ELEC 301 or EECE 374.",
              "prerequisites": "Prerequisites: Either (a) one of ELEC 201, ELEC 203 and ELEC 202; or (b) ELEC 204."
            },
            {
              "code": "ELEC 311",
              "title": "",
              "credits": 4,
              "year": 3,
              "term": 1,
              "description": "Waves and propagation;Maxwell’s equations; applications including transmission lines; impedance matching and Smith charts; reflection and refraction; waveguidesandantennas. [4-0-0]",
              "prerequisites": "Prerequisites: ELEC 211 – Engineering Electromagnetics AND EITHER: (A) ALL of or (B) ALL of or (C) ALL of MATH 101 – Integral Calculus with Applications to Physical Sciences and Engineering MATH 101- Integral Calculus with Applications to Physical Sciences and Engineering MATH 101- Integral Calculus with Applications to Physical Sciences and Engineering MATH 263 – Multivariable and Vector Calculus MATH 253 – Multivariable Calculus MATH 253 – Multivariable Calculus MATH 265 – Linear Differential Equations MATH 264 – Vector Calculus for Electrical Engineering MATH 256 – Differential equations MATH 267 – Mathematical Methods for Electrical and Computer Engineering MATH 265- Linear Differential Equations MATH 264 – Vector Calculus for Electrical Engineering MATH 267 – Mathematical Methods for Electrical and Computer Engineering"
            },
            {
              "code": "ELEC 315",
              "title": "",
              "credits": 4,
              "year": 3,
              "term": 1,
              "description": "Fundamental aspects of electronic materials such as: semiconductors, metals, dielectrics, piezoelectrics, magnetic materials,and their applications in devices such as diodes, transistors, and transducers."
            },
            {
              "code": "ELEC 341",
              "title": "",
              "credits": 4,
              "year": 3,
              "term": 1,
              "description": "Continuous time system analysis by Laplace transforms; system modeling by transfer function and state space methods; feedback, stability and sensitivity; control design; frequency domain analysis. Credit will be given for only one of EECE 360 or 369. [4-0-0]",
              "prerequisites": "Prerequisites: ONE of ELEC 202 – Circuit Analysis II ELEC 204 – Linear Circuits"
            }
          ]
        },
        {
          "term": 2,
          "courses": [
            {
              "code": "ELEC 342",
              "title": "",
              "credits": 4,
              "year": 3,
              "term": 2,
              "description": "Three phase power; transformers and harmonics; magnetic materials and circuits, electromechanical energy conversion; DC machines; rotating magnetic field, AC induction and synchronous machines; variable frequency operation, brushless DC machines; stepper and single-phase motors. Credit will be granted for only one of ELEC 342, ELEC 343, ELEC 344. [3-3*-1]",
              "prerequisites": "Prerequisites: ALL of PHYS 170 – Mechanics I ELEC 202 – Circuit Analysis II"
            },
            {
              "code": "ELEC 391",
              "title": "",
              "credits": 6,
              "year": 3,
              "term": 2,
              "description": "Introduction to project management. Problem definition. Design principles and practices. Implementation techniques.  Testing and evaluation. Effective presentations. The technical content includes aspects of electronics, communications, control systems, and motors and machines. [2-6-0]",
              "prerequisites": "Prerequisites: ONE of CPEN 291, ELEC 291, or ELEC 292 AND TWO of ELEC 301, ELEC 311, ELEC 341, ELEC 342"
            },
            {
              "code": "MATH 318",
              "title": "Probability with Physical Applications",
              "credits": 3,
              "year": 3,
              "term": 2,
              "description": "Random variables, discrete and continuous distributions. Random walk, Markov chains, Monte Carlo methods. Characteristic functions, limit laws. Please consult the Faculty of Science Credit Exclusion List: https://vancouver.calendar.ubc.ca/faculties-colleges-and-schools/facult…",
              "prerequisites": "One of MATH 152, MATH 221, MATH 223.\n\nCorequisites: One of MATH 256, MATH 257, MATH 316, MATH 358, MECH 358, PHYS 312."
            },
            {
              "code": "ELECTIVE",
              "title": "Electives",
              "credits": 4,
              "year": 3,
              "term": 2
            }
          ]
        }
      ]
    },
    {
      "year": 4,
      "label": "Year 4",
      "terms": [
        {
          "term": 1,
          "courses": [
            {
              "code": "APSC 450",
              "title": "",
              "credits": 2,
              "year": 4,
              "term": 1,
              "description": "Professional Engineering Practice Legislation affecting the practice of engineering; ethical principles and responsibilities. Management of engineering enterprises; labour relations, safety and environmental legislation. Restricted to engineering undergraduate students in the final year of their program."
            },
            {
              "code": "ELEC 481",
              "title": "or",
              "credits": 3,
              "year": 4,
              "term": 1,
              "description": "Time-money relationships; economic analysis of alternatives including the effects of interest rates, inflation, depreciation, taxation and uncertainty; cost estimation and budgeting; financial analysis of engineering operations."
            }
          ]
        },
        {
          "term": 2,
          "courses": [
            {
              "code": "ELEC 491",
              "title": "",
              "credits": 10,
              "year": 4,
              "term": 2,
              "description": "Design, analysis, and implementation of solutions in response to a real-world electrical engineering problem, provided by industry, research laboratories, or other suitable entities. Includes coverage of topics such as project management.",
              "prerequisites": "Prerequisites: ELEC 391 Electrical Engineering Design Studio"
            },
            {
              "code": "ELECTIVE",
              "title": "Electives",
              "credits": 18,
              "year": 4,
              "term": 2
            }
          ]
        }
      ]
    }
  ]
}