{
  "faculty": "Applied Science",
  "major": "Engineering Physics",
  "totalCredits": 136,
  "notes": "UBC Applied Science (Engineering) - Engineering Physics curriculum outline. First year is common to most engineering programs.",
  "years": [
    {
      "year": 1,
      "label": "Year 1",
      "terms": [
        {
          "term": 1,
          "courses": [
            {
              "code": "APSC 100",
              "title": "",
              "credits": 3,
              "year": 1,
              "term": 1,
              "description": "Introduction to Engineering I An introduction to the engineering profession including: roles and responsibilities of the engineer, the engineering disciplines, sustainability, an introduction to the engineering design process, introduction and application of the relevant foundational scientific principles, prototyping, engineering graphics, technical communication, and engineering ethics.",
              "prerequisites": "APSC 100\n\nCorequisites: APSC 173"
            },
            {
              "code": "APSC 101",
              "title": "",
              "credits": 3,
              "year": 1,
              "term": 1,
              "description": "Introduction to Engineering II An introduction to the engineering profession including: the engineering design process, sustainability, prototype testing, introduction and application of the relevant foundational scientific principles, team functioning, engineering graphics, and technical communication. Prerequisite:",
              "prerequisites": "APSC 100."
            },
            {
              "code": "APSC 160",
              "title": "",
              "credits": 3,
              "year": 1,
              "term": 1,
              "description": "Introduction to Computation in Engineering Design Analysis and simulation, laboratory data acquisition and processing, measurement interfaces, engineering tools, computer systems organization, programming languages. Credit will only be given for one of:"
            },
            {
              "code": "CHEM 154",
              "title": "",
              "credits": 3,
              "year": 1,
              "term": 1,
              "description": "Chemistry for Engineering Chemical bonding, properties of matter. Chemical thermodynamics with applications to phase equilibria, aqueous equilibria and electrochemistry. Processes at surfaces. [3-3*-0]",
              "prerequisites": "CHEM 12."
            },
            {
              "code": "WRDS 150",
              "title": "",
              "credits": 3,
              "year": 1,
              "term": 1,
              "description": "Writing and Research in the Disciplines Writing and reading in disciplines across the academy, focusing on practices that research disciplines share and those that differentiate them. Restricted to students not in the Faculty of Arts. Credit can be granted for only one of"
            },
            {
              "code": "MATH 100",
              "title": "; intended for students with no previous knowledge of Calculus. Please consult the Faculty of Science Credit Exclusion List:",
              "credits": 3,
              "year": 1,
              "term": 1,
              "description": "https://vancouver.calendar.ubc.ca/faculties-colleges-and-schools/facult… . Not for credit for students with AP Calculus AB, AP Calculus BC, or a passing score on the UBC-SFU-UVIC-UNBC Calculus Challenge Examination.5]",
              "prerequisites": "A grade of 80% or higher in BC Principles of Mathematics 12 or Pre-calculus 12."
            }
          ]
        },
        {
          "term": 2,
          "courses": [
            {
              "code": "MATH 101",
              "title": "Integral Calculus with Applications",
              "credits": 3,
              "year": 1,
              "term": 2,
              "description": "The definite integral, integration techniques, applications, modelling, infinite series.",
              "prerequisites": "One of MATH_V 100, MATH_V 102, MATH_V 104, MATH_V 110, MATH_V 120, MATH_V 180, MATH_V 184.\n\nEquivalency: MATH_V 103, 105."
            },
            {
              "code": "MATH 152",
              "title": "Linear Systems",
              "credits": 3,
              "year": 1,
              "term": 2,
              "description": "2D and 3D geometry, vectors and matrices, eigenvalues and vibration, physical applications. Laboratories demonstrate computer solutions of large systems. Please consult the Faculty of Science Credit Exclusion List: https://vancouver.calendar.ubc.ca/faculties-colleges-and-schools/facult… [3-1*-0]",
              "prerequisites": "Corequisites: [MATH101]\n\nCorequisites: [MATH101] MATH_V 180 (4) Differential Calculus with Applications Topics as for\n\nCorequisites: [MATH101] MATH_V 180 (4) Differential Calculus with Applications Topics as for"
            },
            {
              "code": "PHYS 157",
              "title": "Introductory Physics for Engineers I",
              "credits": 3,
              "year": 1,
              "term": 2,
              "description": "Heat, thermodynamics, oscillations, waves, and sound.",
              "prerequisites": "One of PHYS 12, PHYS 100.\n\nCorequisites: One of MATH 100, MATH 102, MATH 104, MATH 110, MATH 120, MATH 180, MATH 184."
            },
            {
              "code": "PHYS 158",
              "title": "Introductory Physics for Engineers II",
              "credits": 3,
              "year": 1,
              "term": 2,
              "description": "Electricity and magnetism, DC and AC circuits, optics.",
              "prerequisites": "PHYS 157.\n\nCorequisites: One of MATH 101, MATH 103, MATH 105, MATH 121."
            },
            {
              "code": "PHYS 159",
              "title": "or (d) SCIE 001",
              "credits": 1,
              "year": 1,
              "term": 2,
              "description": "A laboratory course with emphasis on experimental design, measurement and analysis techniques.",
              "prerequisites": "One of PHYS 12, PHYS 100.\n\nCorequisites: One of PHYS 157, PHYS 158. PHYS_V 170 (3) Mechanics I Statics of particles, equilibrium or rigid bodies, rigid body statics and internal forces, trusses; kinematics: rectilinear motion; dynamics: Newton's second law, friction, impulse, momentum, work and energy. Recommended pre-requisites: one of PHYS 12, PHYS 100 and one of MATH 100, MATH 102, MATH 104, MATH 110, MATH 120, MATH 180, MATH 184. Recommended co-requisite: one of MATH 101, MATH 103, MATH 105, MATH 121.\n\nCorequisites: One of MATH 200, MATH 217, MATH 226, MATH 253.\n\nCorequisites: One of MATH 200, MATH 217, MATH 226, MATH 253.\n\nCorequisites: One of MATH 200, MATH 217, MATH 226, MATH 253.\n\nCorequisites: One of MATH 200, MATH 217, MATH 226, MATH 253."
            },
            {
              "code": "PHYS 170",
              "title": "",
              "credits": 3,
              "year": 1,
              "term": 2,
              "description": "Mechanics I Statics of particles, equilibrium or rigid bodies, rigid body statics and internal forces, trusses; kinematics: rectilinear motion; dynamics: Newton's second law, friction, impulse, momentum, work and energy. Recommended pre-requisites: one of PHYS 12,",
              "prerequisites": "Corequisites: One of MATH 200, MATH 217, MATH 226, MATH 253, MATH 254."
            },
            {
              "code": "ELECTIVE",
              "title": "Complementary Studies electives",
              "credits": 3,
              "year": 1,
              "term": 2
            }
          ]
        }
      ]
    },
    {
      "year": 2,
      "label": "Year 2",
      "terms": [
        {
          "term": 1,
          "courses": [
            {
              "code": "CPEN 221",
              "title": "",
              "credits": 4,
              "year": 2,
              "term": 1,
              "description": "Design, implementation, reasoning about software systems: Abstraction and specification of software, testing, verification, abstract data types, object-oriented design, design patterns, type hierarchies, concurrent software design. [3-2-1*]",
              "prerequisites": "Prerequisites: APSC 160 – Introduction to Computation in Engineering Design"
            },
            {
              "code": "ELEC 204",
              "title": "",
              "credits": 4,
              "year": 2,
              "term": 1,
              "description": "Basic concepts and analysis techniques in the context of electric and electronic circuits including Bode plots and the Laplace transform. Treatment of RLC circuits, phasors, op-amps. Introduction to nonlinear circuit elements, diodes, BJT, FET circuits. [4-0-1]",
              "prerequisites": "Prerequisites: MATH 152 – Linear Systems AND ONE of PHYS 108 – Enriched Physics II PHYS 118 – Electricity, Light and Radiation PHYS 158 – Introductory Physics for Engineers II\n\nCorequisites: ONE of MATH 255 – Ordinary Differential Equations MATH 256 – Differential equations"
            },
            {
              "code": "ENPH 253",
              "title": "",
              "credits": 5,
              "year": 2,
              "term": 1,
              "description": "Introduction to Instrument Design Practice in engineering design and instrument development including mechanical and electrical design, and communications with sensors, actuators. Micro-controller implementation and system integration. Engineering design review process and presentations. Engineering communication in design and product release. Prerequisite:"
            },
            {
              "code": "ENPH 259",
              "title": "",
              "credits": 3,
              "year": 2,
              "term": 1,
              "description": "Experimental Techniques Basic experimental techniques in acquisition, analysis, and presentation and communication of data and technical results.",
              "prerequisites": "One of APSC 176, ENGL 110, ENGL 111, ENGL 112, ENGL 120, ENGL 121, WRDS 150 and either (a) all of PHYS 108, PHYS 109 or (b) one of PHYS 102, PHYS 153 or (c) SCIE 001 or (d) all of PHYS 157, PHYS 158, PHYS 159 or (e) all of PHYS 118, PHYS 119 or (f) all of PHYS 108, PHYS 119."
            },
            {
              "code": "ENPH 270",
              "title": "",
              "credits": 2,
              "year": 2,
              "term": 1,
              "description": "Mechanics II Dynamics: systems of particles, kinematics and kinetics of rigid bodies (plane motion), energy and momentum, rotating coordinates.",
              "prerequisites": "PHYS 170."
            },
            {
              "code": "MATH 217",
              "title": "Multivariable and Vector Calculus",
              "credits": 4,
              "year": 2,
              "term": 1,
              "description": "Partial differentiation, extreme values, multiple integration, vector fields, line and surface integrals, the divergence theorem, Green's and Stokes' theorems. Intended for students in Honours Physics and Engineering Physics. Please consult the Faculty of Science Credit Exclusion List: https://vancouver.calendar.ubc.ca/faculties-colleges-and-schools/facult…",
              "prerequisites": "A score of 68% or higher in one of PHYS 102, PHYS 108, PHYS 118, PHYS 153, PHYS 158, SCIE 001 and a score of 68% or higher in one of"
            }
          ]
        },
        {
          "term": 2,
          "courses": [
            {
              "code": "MATH 255",
              "title": "Ordinary Differential Equations\n\n\nReview of linear systems; nonlinear equations and applications; phase plane analysis; Laplace transforms; numerical methods",
              "credits": 3,
              "year": 2,
              "term": 2,
              "description": "Ordinary Differential Equations Review of linear systems; nonlinear equations and applications; phase plane analysis; Laplace transforms; numerical methods. Please consult the Faculty of Science Credit Exclusion List: https://vancouver.calendar.ubc.ca/faculties-colleges-and-schools/facult…",
              "prerequisites": "One of"
            },
            {
              "code": "MATH 257",
              "title": "Partial Differential Equations",
              "credits": 3,
              "year": 2,
              "term": 2,
              "description": "Introduction to partial differential equations; Fourier series; the heat, wave and potential equations; boundary-value problems; numerical methods. Please consult the Faculty of Science Credit Exclusion List: https://vancouver.calendar.ubc.ca/faculties-colleges-and-schools/facult…",
              "prerequisites": "One of MATH 215, MATH 255, MATH 256, MATH 258."
            },
            {
              "code": "ENPH 257",
              "title": "",
              "credits": 2,
              "year": 2,
              "term": 2,
              "description": "Heat and Thermodynamics Thermometry, thermal properties of matter; heat transfer by conduction; convection and radiation; kinetic theory of gases and gas laws; heat engines; refrigeration; change of state; first and second laws of thermodynamics.",
              "prerequisites": "Either (a) SCIE 001 or (b) one of MATH 200, MATH 217, MATH 226, MATH 254, MATH 255; and either (a) all of PHYS 108, PHYS 109 or (b) one of PHYS 102, PHYS 153 or (c) all of PHYS 157, PHYS 158, PHYS 159 or (d) all of PHYS 118, PHYS 119 or (e) all of PHYS 108, PHYS 119."
            },
            {
              "code": "PHYS 250",
              "title": ", CHEM 312. Corequisite: [MATH215]",
              "credits": 3,
              "year": 2,
              "term": 2,
              "description": "PHYS_V 318 (3)\nExperimental Acoustics\nExperimental techniques of acoustics: data acquisition hardware and software, microphones, loudspeakers, noise, vibration and modal analysis.",
              "prerequisites": "One of ENPH 259, PHYS 209, PHYS 229.\nPHYS_V 319 (3)\nElectronics Laboratory\nA project-oriented lab introducing the design and construction of microprocessor-controlled devices. Prerequisite: One of PHYS 209, PHYS 219, ENPH 259.\nPHYS_V 330 (3)\nModern Physics\nQuantum physics, nuclear energy and particle physics at a level suitable for third- and fourth-year Science students not proceeding to a physics degree. Not for credit towards a B.Sc. in Astronomy, Biophysics or Physics. Prerequisite: Either (a) one of MATH 100, MATH 102, MATH 104, MATH 110, MATH 180, MATH 184 and one of"
            },
            {
              "code": "APSC 202",
              "title": "",
              "credits": 3,
              "year": 2,
              "term": 2,
              "description": "Technical Communication Engineering Physics Written and oral communication in business correspondence, engineering design methods, report preparation, and oral presentations of technical material. Restricted to students in second year of the Engineering Physics Program.",
              "prerequisites": "One of"
            },
            {
              "code": "ELECTIVE",
              "title": "Complementary Studies electives",
              "credits": 3,
              "year": 2,
              "term": 2
            }
          ]
        }
      ]
    },
    {
      "year": 3,
      "label": "Year 3",
      "terms": [
        {
          "term": 1,
          "courses": [
            {
              "code": "APSC 278",
              "title": "",
              "credits": 3,
              "year": 3,
              "term": 1,
              "description": "Engineering Materials Atomic bonding; crystal structures and imperfections; properties of metals, ceramics, polymers, wood, concrete and fibre composite materials; selection of materials; corrosion; mechanical testing and heat treatment."
            },
            {
              "code": "APSC 279",
              "title": "",
              "credits": 1,
              "year": 3,
              "term": 1,
              "description": "Engineering Materials Laboratory Atomic bonding; crystal structures and imperfections; properties of metals, ceramics, polymers, wood, concrete and fibre composite materials; selection of materials; corrosion; mechanical testing and heat treatment. [0-2*- 0] Corequisite:",
              "prerequisites": "Corequisites: APSC_V 278"
            },
            {
              "code": "CPEN 312",
              "title": "",
              "credits": 3,
              "year": 3,
              "term": 1,
              "description": "Data representation in digital computers; boolean algebra; the design and optimization and implementation of combinatorial and sequential circuits; modern digital circuit technologies; memory and programmable logic devices; organization and operation of microcomputers; data/address bus organization; input-output interfacing. Credit will be given for only one of CPEN 312 or CPEN 211.",
              "prerequisites": "Prerequisites: ONE of ELEC 201 – Circuit Analysis I ELEC 203 – Basic Circuit Analysis ELEC 204 – Linear Circuits MECH 221 – Engineering Science I"
            },
            {
              "code": "ELEC 221",
              "title": "",
              "credits": 4,
              "year": 3,
              "term": 1,
              "description": "Complex numbers, LTI systems,  convolution sum, discrete-time Fourier series and transforms, z-transform, sampling, introduction to filtering and modulation, feedback systems, stability. [3-0-2]",
              "prerequisites": "Prerequisites: ONE of MATH 255 – Ordinary Differential Equations MATH 256 – Differential equations"
            },
            {
              "code": "ENPH 353",
              "title": "",
              "credits": 3,
              "year": 3,
              "term": 1,
              "description": "Engineering Physics Project I Engineering project planning, execution and reporting. The course involves carrying out an open-ended Engineering project to meet specific performance metrics on an industry relevant topic selected by instructors. Reporting on progress is both oral and written.",
              "prerequisites": "All of"
            },
            {
              "code": "MATH 307",
              "title": "Applied Linear Algebra",
              "credits": 3,
              "year": 3,
              "term": 1,
              "prerequisites": "One of MATH 152, MATH 221, MATH 223 and one of MATH 200, MATH 217,",
              "description": "Applications of linear algebra to problems in science and engineering; use of computer algebra systems for solving problems in linear algebra."
            }
          ]
        },
        {
          "term": 2,
          "courses": [
            {
              "code": "MATH 305",
              "title": "Applied Complex Analysis\n\n\nFunctions of a complex variable, Cauchy-Riemann equations, contour integration, Laurent series, residues, integrals of multi-valued functions, Fourier transforms",
              "credits": 3,
              "year": 3,
              "term": 2,
              "description": "Applied Complex Analysis Functions of a complex variable, Cauchy-Riemann equations, contour integration, Laurent series, residues, integrals of multi-valued functions, Fourier transforms. Please consult the Faculty of Science Credit Exclusion List: https://vancouver.calendar.ubc.ca/faculties-colleges-and-schools/facult…",
              "prerequisites": "One of"
            },
            {
              "code": "MECH 280",
              "title": "Introduction to Fluid Mechanics",
              "credits": 3,
              "year": 3,
              "term": 2,
              "description": "Fluid properties; statics; kinematics, dynamics, energy, and momentum principles for control volumes; dimensional analysis and similarity; laminar and turbulent flow; pipe flow; principles of centrifugal pumps.",
              "prerequisites": "All of MATH 152, PHYS 170 and one of MATH 217, MATH 253; and either (a) PHYS 131 and one of PHYS 108, PHYS 118; or (b) PHYS 153 or (c) all of PHYS 157, PHYS 158, PHYS 159."
            },
            {
              "code": "MECH 325",
              "title": "Machine Design",
              "credits": 4,
              "year": 3,
              "term": 2,
              "description": "Selection of flexible drives, bearings, fluid power system components, and couplings. Design of shafts, bolted joints and power screws. Design and selection of gears, gear trains, and mechanisms. Recommended co-requisite:"
            },
            {
              "code": "PHYS 301",
              "title": "Electricity and Magnetism",
              "credits": 3,
              "year": 3,
              "term": 2,
              "description": "and one of",
              "prerequisites": "One of PHYS 102, PHYS 108, PHYS 118, PHYS 153, PHYS 158, SCIE 001 and one of MATH 217, MATH 227, MATH 317 and one of MATH 215, MATH 255."
            },
            {
              "code": "PHYS 304",
              "title": ", 450 or CHEM 312. Prerequisite: One of PHYS 200, PHYS 250",
              "credits": 3,
              "year": 3,
              "term": 2,
              "description": "PHYS_V 454 (3)\nApplied Electromagnetic Theory\nWave propagation and related phenomena in dielectrics, conductors and plasmas. Wave guides, radiation, antennae, special relativity. Credit will be granted for only one of",
              "prerequisites": "One of PHYS_V 301, PHYS_V 354.\nPHYS_V 455 (3)\nStatistical Mechanics"
            },
            {
              "code": "PHYS 350",
              "title": "Applications of Classical Mechanics",
              "credits": 3,
              "year": 3,
              "term": 2,
              "description": "Review of principles. Particle mechanics: Euler's equations, tops and gyroscopes, motion of the Earth, Lagrangian and Hamiltonian methods. Variational principles in optics and mechanics, Liouville's theorem and statistical mechanics. The relationship between classical and quantum mechanics.",
              "prerequisites": ""
            },
            {
              "code": "ELECTIVE",
              "title": "Technical Elective",
              "credits": 3,
              "year": 3,
              "term": 2
            }
          ]
        }
      ]
    },
    {
      "year": 4,
      "label": "Year 4",
      "terms": [
        {
          "term": 1,
          "courses": [
            {
              "code": "ENPH 459",
              "title": "",
              "credits": 5,
              "year": 4,
              "term": 1,
              "description": "Engineering Physics Project II Project planning, management and reporting. This course involves writing a project proposal, carrying out an open-ended Engineering project, and reporting the results both orally and in writing. ; Prerequisite:"
            },
            {
              "code": "MATH 318",
              "title": "Probability with Physical Applications",
              "credits": 3,
              "year": 4,
              "term": 1,
              "description": "Random variables, discrete and continuous distributions. Random walk, Markov chains, Monte Carlo methods. Characteristic functions, limit laws. Please consult the Faculty of Science Credit Exclusion List: https://vancouver.calendar.ubc.ca/faculties-colleges-and-schools/facult…",
              "prerequisites": "One of MATH 152, MATH 221, MATH 223.\n\nCorequisites: One of MATH 256, MATH 257, MATH 316, MATH 358, MECH 358, PHYS 312."
            },
            {
              "code": "MATH 400",
              "title": "Applied Partial Differential Equations",
              "credits": 3,
              "year": 4,
              "term": 1,
              "prerequisites": "One of MATH 300, MATH 305 and one of MATH 256, MATH 257, MATH 316,",
              "description": "Separation of variables, first order equations, Sturm-Liouville theory, integral transform methods."
            }
          ]
        },
        {
          "term": 2,
          "courses": [
            {
              "code": "PHYS 401",
              "title": "",
              "credits": 3,
              "year": 4,
              "term": 2,
              "description": "Electromagnetic Theory Applications of Maxwell's theory. Wave propagation in dielectrics, conductors and plasmas, wave guides, radiation, antennae, and special relativity.",
              "prerequisites": "One of"
            },
            {
              "code": "ELEC 341",
              "title": "One of ,",
              "credits": 4,
              "year": 4,
              "term": 2,
              "description": "Continuous time system analysis by Laplace transforms; system modeling by transfer function and state space methods; feedback, stability and sensitivity; control design; frequency domain analysis. Credit will be given for only one of EECE 360 or 369. [4-0-0]",
              "prerequisites": "Prerequisites: ONE of ELEC 202 – Circuit Analysis II ELEC 204 – Linear Circuits"
            },
            {
              "code": "ELECTIVE",
              "title": "Technical elective",
              "credits": 3,
              "year": 4,
              "term": 2
            }
          ]
        }
      ]
    }
  ]
}