{
  "faculty": "Applied Science",
  "major": "Environmental Engineering",
  "totalCredits": 148,
  "notes": "UBC Applied Science (Engineering) - Environmental Engineering curriculum outline. First year is common to most engineering programs.",
  "years": [
    {
      "year": 1,
      "label": "Year 1",
      "terms": [
        {
          "term": 1,
          "courses": [
            {
              "code": "APSC 100",
              "title": "",
              "credits": 3,
              "year": 1,
              "term": 1,
              "description": "Introduction to Engineering I An introduction to the engineering profession including: roles and responsibilities of the engineer, the engineering disciplines, sustainability, an introduction to the engineering design process, introduction and application of the relevant foundational scientific principles, prototyping, engineering graphics, technical communication, and engineering ethics.",
              "prerequisites": "APSC 100\n\nCorequisites: APSC 173"
            },
            {
              "code": "APSC 101",
              "title": "",
              "credits": 3,
              "year": 1,
              "term": 1,
              "description": "Introduction to Engineering II An introduction to the engineering profession including: the engineering design process, sustainability, prototype testing, introduction and application of the relevant foundational scientific principles, team functioning, engineering graphics, and technical communication. Prerequisite:",
              "prerequisites": "APSC 100."
            },
            {
              "code": "APSC 160",
              "title": "",
              "credits": 3,
              "year": 1,
              "term": 1,
              "description": "Introduction to Computation in Engineering Design Analysis and simulation, laboratory data acquisition and processing, measurement interfaces, engineering tools, computer systems organization, programming languages. Credit will only be given for one of:"
            },
            {
              "code": "CHEM 154",
              "title": "",
              "credits": 3,
              "year": 1,
              "term": 1,
              "description": "Chemistry for Engineering Chemical bonding, properties of matter. Chemical thermodynamics with applications to phase equilibria, aqueous equilibria and electrochemistry. Processes at surfaces. [3-3*-0]",
              "prerequisites": "CHEM 12."
            },
            {
              "code": "WRDS 150",
              "title": "",
              "credits": 3,
              "year": 1,
              "term": 1,
              "description": "Writing and Research in the Disciplines Writing and reading in disciplines across the academy, focusing on practices that research disciplines share and those that differentiate them. Restricted to students not in the Faculty of Arts. Credit can be granted for only one of"
            },
            {
              "code": "MATH 100",
              "title": "Differential Calculus with Applications\n\n\nDerivatives of elementary functions",
              "credits": 3,
              "year": 1,
              "term": 1,
              "description": "Differential Calculus with Applications Derivatives of elementary functions. Applications and modelling: graphing, optimization. Consult the Faculty of Science Credit Exclusion List: https://vancouver.calendar.ubc.ca/faculties-colleges-and-schools/facult…",
              "prerequisites": "A score of 80% or higher in BC Pre-calculus 12. High school calculus is strongly recommended."
            }
          ]
        },
        {
          "term": 2,
          "courses": [
            {
              "code": "MATH 101",
              "title": "Integral Calculus with Applications",
              "credits": 3,
              "year": 1,
              "term": 2,
              "description": "The definite integral, integration techniques, applications, modelling, infinite series.",
              "prerequisites": "One of MATH_V 100, MATH_V 102, MATH_V 104, MATH_V 110, MATH_V 120, MATH_V 180, MATH_V 184.\n\nEquivalency: MATH_V 103, 105."
            },
            {
              "code": "MATH 152",
              "title": "Linear Systems\n\n\n2D and 3D geometry, vectors and matrices, eigenvalues and vibration, physical applications",
              "credits": 3,
              "year": 1,
              "term": 2,
              "description": "Linear Systems 2D and 3D geometry, vectors and matrices, eigenvalues and vibration, physical applications. Laboratories demonstrate computer solutions of large systems. Please consult the Faculty of Science Credit Exclusion List: https://vancouver.calendar.ubc.ca/faculties-colleges-and-schools/facult… [3-1*-0]",
              "prerequisites": "Corequisites: [MATH101]"
            },
            {
              "code": "PHYS 157",
              "title": "",
              "credits": 3,
              "year": 1,
              "term": 2,
              "description": "Introductory Physics for Engineers I Heat, thermodynamics, oscillations, waves, and sound.",
              "prerequisites": "One of PHYS 12, PHYS 100.\n\nCorequisites: One of MATH 100, MATH 102, MATH 104, MATH 110, MATH 120, MATH 180, MATH 184."
            },
            {
              "code": "PHYS 158",
              "title": ", SCIE 001 and a score of 68% or higher in one of MATH 101, MATH 103, MATH 105, MATH 121, SCIE 001. Corequisite: One of MATH 152, MATH 221, MATH 223",
              "credits": 3,
              "year": 1,
              "term": 2,
              "description": "Introductory Physics for Engineers II Electricity and magnetism, DC and AC circuits, optics.",
              "prerequisites": "PHYS 157.\n\nCorequisites: One of MATH 101, MATH 103, MATH 105, MATH 121."
            },
            {
              "code": "PHYS 159",
              "title": "",
              "credits": 1,
              "year": 1,
              "term": 2,
              "description": "Introductory Physics Laboratory for Engineers A laboratory course with emphasis on experimental design, measurement and analysis techniques.",
              "prerequisites": "One of PHYS 12, PHYS 100.\n\nCorequisites: One of PHYS 157, PHYS 158."
            },
            {
              "code": "PHYS 170",
              "title": "",
              "credits": 3,
              "year": 1,
              "term": 2,
              "description": "Mechanics I Statics of particles, equilibrium or rigid bodies, rigid body statics and internal forces, trusses; kinematics: rectilinear motion; dynamics: Newton's second law, friction, impulse, momentum, work and energy. Recommended pre-requisites: one of PHYS 12,",
              "prerequisites": "Corequisites: One of MATH 200, MATH 217, MATH 226, MATH 253, MATH 254."
            },
            {
              "code": "ELECTIVE",
              "title": "Complementary Studies electives",
              "credits": 3,
              "year": 1,
              "term": 2
            }
          ]
        }
      ]
    },
    {
      "year": 2,
      "label": "Year 2",
      "terms": [
        {
          "term": 1,
          "courses": [
            {
              "code": "CHBE 230",
              "title": "Computational Methods",
              "credits": 3,
              "year": 2,
              "term": 1,
              "description": "Mathematical formulation of chemical and biological engineering problems; standard techniques of numerical analysis and their application to chemical, environmental and biotechnological systems; program development; use of commercial numerical analysis software.",
              "prerequisites": "APSC 160.\n\nCorequisites: MATH 256."
            },
            {
              "code": "CHBE 241",
              "title": "This course is not eligible for Credit/D/Fail grading",
              "credits": 3,
              "year": 2,
              "term": 1,
              "description": "Material and Energy Balances Introduction to Chemical and Biological Engineering; units; stoichiometry; phase equilibria; material balances; energy balances.",
              "prerequisites": "All of CHEM 154, MATH 152."
            },
            {
              "code": "CHBE 244",
              "title": "Chemical and Biological Engineering Thermodynamics I",
              "credits": 3,
              "year": 2,
              "term": 1,
              "description": "Energy and the first law; second law of thermodynamics; entropy; availability (energy) analysis; thermodynamic properties of fluids, application to power generation, refrigeration, and liquefaction, as well as biological, environmental, and electrochemical systems. *] Prerequisite:"
            },
            {
              "code": "CIVL 204",
              "title": "",
              "credits": 3,
              "year": 2,
              "term": 1,
              "description": "Fundamentals of Environmental Engineering Environmental engineering issues and projects; application of scientific and engineering principles to addressing these; soil, water and air pollution, and remediation.",
              "prerequisites": "CHEM 154."
            },
            {
              "code": "CIVL 215",
              "title": "",
              "credits": 4,
              "year": 2,
              "term": 1,
              "description": "Fluid Mechanics I Fluid properties, hydrostatics, kinematics, and fluid dynamics: energy and momentum methods with applications. Dimensional analysis, modelling, introduction to flow in pipes and forces on immersed objects.",
              "prerequisites": "All of PHYS 170, MATH 101."
            }
          ]
        },
        {
          "term": 2,
          "courses": [
            {
              "code": "ENVE 200",
              "title": "",
              "credits": 4,
              "year": 2,
              "term": 2,
              "description": "Environmental Engineering Design and Decision Making Environmental Engineering design and decision-making, analysis tools and techniques, data illustration and other communication techniques, professional development including ethics and equity. Subject themes include water, air and soil.",
              "prerequisites": "Second-year standing in ENVL."
            },
            {
              "code": "ENVE 201",
              "title": "",
              "credits": 3,
              "year": 2,
              "term": 2,
              "description": "Technical Communications for Environmental Engineering All aspects of technical communication, including report preparation, business correspondence, and oral presentation, applied to environmental engineering specific cases and projects. Corequisite:",
              "prerequisites": "WRDS 150. or equivalent (ENGL 100, 110, 111 or 112)"
            },
            {
              "code": "ENVE 202",
              "title": "",
              "credits": 4,
              "year": 2,
              "term": 2,
              "description": "Environmental Engineering Science Analysis of integrated environmental systems, quantification of fundamental chemical and biological processes, systems design, evaluation of environmental impact, future trends.",
              "prerequisites": "Four of CHEM 154, CIVL 204, CHBE 241."
            },
            {
              "code": "ENVE 203",
              "title": "",
              "credits": 4,
              "year": 2,
              "term": 2,
              "description": "Environmental Engineering and Sustainability Sustainability vocabulary and systems theory relevant to environmental engineering practice, foundational sustainability topics including those relating to urban ecology, industrial ecology/circular economy, and humanitarian engineering, stakeholder analysis, communication, and adaptive change leadership skills Prerequisite:"
            },
            {
              "code": "MATH 253",
              "title": "Multivariable Calculus\n\n\nPartial and directional derivatives; maxima and minima; Lagrange multipliers and second derivative test; multiple integrals and applications",
              "credits": 3,
              "year": 2,
              "term": 2,
              "description": "Multivariable Calculus Partial and directional derivatives; maxima and minima; Lagrange multipliers and second derivative test; multiple integrals and applications. Please consult the Faculty of Science Credit Exclusion List: https://vancouver.calendar.ubc.ca/faculties-colleges-and-schools/facult…",
              "prerequisites": "One of"
            },
            {
              "code": "MATH 256",
              "title": "Differential Equations\n\n\nLinear ordinary differential equations, Laplace transforms, Fourier series and separation of variables for linear partial differential equations",
              "credits": 3,
              "year": 2,
              "term": 2,
              "description": "Differential Equations Linear ordinary differential equations, Laplace transforms, Fourier series and separation of variables for linear partial differential equations. Consult the Faculty of Science Credit Exclusion List: https://vancouver.calendar.ubc.ca/faculties-colleges-and-schools/facult… .",
              "prerequisites": "One of"
            }
          ]
        }
      ]
    },
    {
      "year": 3,
      "label": "Year 3",
      "terms": [
        {
          "term": 1,
          "courses": [
            {
              "code": "CHBE 364",
              "title": "This course is not eligible for Credit/D/Fail grading",
              "credits": 3,
              "year": 3,
              "term": 1,
              "description": "Environmental Engineering Laboratory Laboratory experiments to illustrate key concepts and measurement techniques in environmental engineering as used by engineers.",
              "prerequisites": "Corequisites: One of\n\nCorequisites: One of"
            },
            {
              "code": "CHBE 370",
              "title": "Prerequisite: Third-year or higher standing in BASc. or BSc",
              "credits": 3,
              "year": 3,
              "term": 1,
              "description": "Fundamentals of Sustainable Engineering Introduction to sustainable practice for Chemical and Biological Engineers. Pollution prevention, cleaner production, green chemistry and engineering, and sustainable design; environmental impact assessment including life-cycle assessment, total cost analysis and environmental systems analysis; applications in chemical and biological process industries. *]",
              "prerequisites": "All of"
            },
            {
              "code": "CHBE 373",
              "title": "Water and Wastewater Technology and Engineering",
              "credits": 4,
              "year": 3,
              "term": 1,
              "prerequisites": "One of",
              "description": "Legal, environmental and physicochemical aspects of industrial water pollution and its abatement will be surveyed; techniques for design of wastewater treatment processes currently used in industry; case studies from chemical and process industries will be considered in detail. Credit will be granted for only one of"
            },
            {
              "code": "CHBE 485",
              "title": "Air Pollution Prevention and Air Quality Engineering",
              "credits": 3,
              "year": 3,
              "term": 1,
              "description": "Fate of air-born chemicals and the associated impacts of air pollutants on health, visibility, smog formation, ozone depletion and global warming; air quality and emission standards; atmospheric dispersion of air pollutants; prevention and control technologies for particulates, SOx, NOx, VOCs, and CO2. Credit will be granted for only one of"
            },
            {
              "code": "CIVL 305",
              "title": "",
              "credits": 3,
              "year": 3,
              "term": 1,
              "description": "Introduction to Environmental Engineering Applications Environmental legislation; risk assessment; urban water; mass balance; water and wastewater treatment; environmental impact assessment. Prerequisite:"
            }
          ]
        },
        {
          "term": 2,
          "courses": [
            {
              "code": "CIVL 315",
              "title": "",
              "credits": 4,
              "year": 3,
              "term": 2,
              "description": "Fluid Mechanics II Two-dimensional flow around immersed objects; velocity and pressure fields; lift and drag on cylinders and aerofoils; fluid loads on structures and structural response; pumps and turbines; analysis and design of pipeline systems; unsteady flow in pipes; frictionless water hammer analysis. [3-2*-1]",
              "prerequisites": "One of ENVE 201,"
            },
            {
              "code": "CIVL 316",
              "title": "",
              "credits": 4,
              "year": 3,
              "term": 2,
              "description": "Hydrology and Open Channel Flow Introduction to open channel hydraulics, engineering hydrology, and water resource systems; estimation of design discharge; flood statistics; nonuniform steady open channel flow; energy and momentum principles, backwater analysis; culvert and bridge hydraulics. [3-2*-1] Prerequisite:"
            },
            {
              "code": "ENVE 301",
              "title": "",
              "credits": 3,
              "year": 3,
              "term": 2,
              "description": "Environmental Engineering Intermediate Design Project Real-time, fully-integrated, conceptual and detailed design experiences that address an ill-structured, socially and technically complex environmental engineering problem for communities with consideration to the cultural history and needs of the communities. Corequisite:",
              "prerequisites": "Third-year standing in ENVL or third-year standing in ENVE."
            },
            {
              "code": "EOSC 210",
              "title": "",
              "credits": 3,
              "year": 3,
              "term": 2,
              "description": "Earth Science for Engineers Focus on the interaction between society and the geologic environment. Locating, assessing and developing natural resources; understanding and preparing for natural hazards, design of structures and waste disposal sites.",
              "prerequisites": "Corequisites: One of CIVL 215, MINE 200."
            },
            {
              "code": "STAT 251",
              "title": "",
              "credits": 3,
              "year": 3,
              "term": 2
            },
            {
              "code": "ELECTIVE",
              "title": "Technical Elective",
              "credits": 3,
              "year": 3,
              "term": 2
            }
          ]
        }
      ]
    },
    {
      "year": 4,
      "label": "Year 4",
      "terms": [
        {
          "term": 1,
          "courses": [
            {
              "code": "CHBE 459",
              "title": "Chemical and Biological Engineering Economics",
              "credits": 3,
              "year": 4,
              "term": 1,
              "description": "Estimation of capital and operating costs; interest calculations; taxes; economic comparison of alternatives; economic optimization.",
              "prerequisites": "Third-year or higher standing in BASc or BSc."
            },
            {
              "code": "CHBE 483",
              "title": "Energy Engineering for Climate Change and Sustainability",
              "credits": 3,
              "year": 4,
              "term": 1,
              "description": "Supply and use of conventional and alternative fuels and energy. Design and operation of unit operations for processing of fossil fuels, biomass, and other energy sources. Environmental considerations of energy use. that address climate change and sustainability (water usage, environmental footprint, resource use, etc.). Credit will be granted for only one of"
            },
            {
              "code": "CHBE 486",
              "title": "Waste Mitigation and Processing for Resource Recovery",
              "credits": 3,
              "year": 4,
              "term": 1,
              "description": "How chemical and biological waste impact the environment. Physico-chemical, thermal, and biological methods for minimizing, isolating and sustainably treating solid waste and wastewater, including conversion to bioproducts/ industrial products, energy and clean water. Recommended",
              "prerequisites": "All of"
            },
            {
              "code": "CIVL 402",
              "title": "",
              "credits": 3,
              "year": 4,
              "term": 1,
              "description": "Professionalism and Law in Civil Engineering The Professional Governance Act; professional ethics, conflicts of interest, confidentiality and accountability; health and safety; sustainable development and environmental stewardship; equity considerations; design and construction contracts, specifications and tendering; labour and employment law; dispute resolution; evidence and expert witnesses; torts and legal liability."
            },
            {
              "code": "CIVL 409",
              "title": "",
              "credits": 3,
              "year": 4,
              "term": 1,
              "description": "Municipal Engineering Design of municipal infrastructure, including streets, water supply networks, and sewers, garbage collection and solid waste management. Focus is on solutions for providing an adequate water supply, collecting and disposing of stormwater and sewage, and managing excess stormwater flow.",
              "prerequisites": "All of"
            }
          ]
        },
        {
          "term": 2,
          "courses": [
            {
              "code": "CIVL 416",
              "title": "",
              "credits": 3,
              "year": 4,
              "term": 2,
              "description": "Environmental Hydraulics Application of hydraulic engineering principles to problems of environmental concern. Pollutant transport and dispersion. Mixing in rivers and lakes. Theory of jets and plumes. Design of outfall diffusers.",
              "prerequisites": "All of"
            },
            {
              "code": "CIVL 418",
              "title": "",
              "credits": 3,
              "year": 4,
              "term": 2,
              "description": "Engineering Hydrology Hydrologic processes - weather, precipitation, infiltration, evaporation, snowmelt and runoff generation. Emphasis on quantitative techniques including: hydrograph analysis, reservoir and channel routing, statistical methods and design floods, hydrologic modelling. Prerequisite:"
            },
            {
              "code": "ENVE 401",
              "title": "",
              "credits": 8,
              "year": 4,
              "term": 2,
              "description": "Environmental Engineering Capstone Project Application of chemical, biological, and environmental science; engineering concepts; sustainable development and health and safety considerations; engineering economics; and life cycle analysis. Conceptual and detailed design for a multi-scale and complex environment health and protection problem. ; Prerequisite:"
            },
            {
              "code": "EOSC 329",
              "title": "",
              "credits": 3,
              "year": 4,
              "term": 2,
              "description": "Quantitative Groundwater Hydrology Introduction to theory of groundwater flow; flow nets; regional groundwater resource evaluation; well hydraulics; role of groundwater in geologic processes, case studies. [2-3*-3*]",
              "prerequisites": "One of MATH 101, MATH 103, MATH 105, MATH 121, SCIE 001."
            },
            {
              "code": "ELECTIVE",
              "title": "Technical Electives",
              "credits": 6,
              "year": 4,
              "term": 2
            }
          ]
        }
      ]
    }
  ]
}