{
  "faculty": "Applied Science",
  "major": "Integrated Engineering",
  "totalCredits": 149,
  "notes": "UBC Applied Science (Engineering) - Integrated Engineering curriculum outline. First year is common to most engineering programs.",
  "years": [
    {
      "year": 1,
      "label": "Year 1",
      "terms": [
        {
          "term": 1,
          "courses": [
            {
              "code": "APSC 100",
              "title": "",
              "credits": 3,
              "year": 1,
              "term": 1,
              "description": "Introduction to Engineering I An introduction to the engineering profession including: roles and responsibilities of the engineer, the engineering disciplines, sustainability, an introduction to the engineering design process, introduction and application of the relevant foundational scientific principles, prototyping, engineering graphics, technical communication, and engineering ethics.",
              "prerequisites": "APSC 100\n\nCorequisites: APSC 173"
            },
            {
              "code": "APSC 101",
              "title": "",
              "credits": 3,
              "year": 1,
              "term": 1,
              "description": "Introduction to Engineering II An introduction to the engineering profession including: the engineering design process, sustainability, prototype testing, introduction and application of the relevant foundational scientific principles, team functioning, engineering graphics, and technical communication. Prerequisite:",
              "prerequisites": "APSC 100."
            },
            {
              "code": "APSC 160",
              "title": "",
              "credits": 3,
              "year": 1,
              "term": 1,
              "description": "Introduction to Computation in Engineering Design Analysis and simulation, laboratory data acquisition and processing, measurement interfaces, engineering tools, computer systems organization, programming languages. Credit will only be given for one of:"
            },
            {
              "code": "CHEM 154",
              "title": "",
              "credits": 3,
              "year": 1,
              "term": 1,
              "description": "Chemistry for Engineering Chemical bonding, properties of matter. Chemical thermodynamics with applications to phase equilibria, aqueous equilibria and electrochemistry. Processes at surfaces. [3-3*-0]",
              "prerequisites": "CHEM 12."
            },
            {
              "code": "WRDS 150",
              "title": "",
              "credits": 3,
              "year": 1,
              "term": 1,
              "description": "Writing and Research in the Disciplines Writing and reading in disciplines across the academy, focusing on practices that research disciplines share and those that differentiate them. Restricted to students not in the Faculty of Arts. Credit can be granted for only one of"
            },
            {
              "code": "MATH 100",
              "title": "; intended for students with no previous knowledge of Calculus. Please consult the Faculty of Science Credit Exclusion List:",
              "credits": 3,
              "year": 1,
              "term": 1,
              "description": "https://vancouver.calendar.ubc.ca/faculties-colleges-and-schools/facult… . Not for credit for students with AP Calculus AB, AP Calculus BC, or a passing score on the UBC-SFU-UVIC-UNBC Calculus Challenge Examination.5]",
              "prerequisites": "A grade of 80% or higher in BC Principles of Mathematics 12 or Pre-calculus 12."
            }
          ]
        },
        {
          "term": 2,
          "courses": [
            {
              "code": "MATH 101",
              "title": "Integral Calculus with Applications",
              "credits": 3,
              "year": 1,
              "term": 2,
              "description": "The definite integral, integration techniques, applications, modelling, infinite series.",
              "prerequisites": "One of MATH_V 100, MATH_V 102, MATH_V 104, MATH_V 110, MATH_V 120, MATH_V 180, MATH_V 184.\n\nEquivalency: MATH_V 103, 105."
            },
            {
              "code": "MATH 152",
              "title": "Linear Systems",
              "credits": 3,
              "year": 1,
              "term": 2,
              "description": "2D and 3D geometry, vectors and matrices, eigenvalues and vibration, physical applications. Laboratories demonstrate computer solutions of large systems. Please consult the Faculty of Science Credit Exclusion List: https://vancouver.calendar.ubc.ca/faculties-colleges-and-schools/facult… [3-1*-0]",
              "prerequisites": "Corequisites: [MATH101]\n\nCorequisites: [MATH101] MATH_V 180 (4) Differential Calculus with Applications Topics as for\n\nCorequisites: [MATH101] MATH_V 180 (4) Differential Calculus with Applications Topics as for"
            },
            {
              "code": "PHYS 157",
              "title": "Introductory Physics for Engineers I",
              "credits": 3,
              "year": 1,
              "term": 2,
              "description": "Heat, thermodynamics, oscillations, waves, and sound.",
              "prerequisites": "One of PHYS 12, PHYS 100.\n\nCorequisites: One of MATH 100, MATH 102, MATH 104, MATH 110, MATH 120, MATH 180, MATH 184."
            },
            {
              "code": "PHYS 158",
              "title": "Introductory Physics for Engineers II",
              "credits": 3,
              "year": 1,
              "term": 2,
              "description": "Electricity and magnetism, DC and AC circuits, optics.",
              "prerequisites": "PHYS 157.\n\nCorequisites: One of MATH 101, MATH 103, MATH 105, MATH 121."
            },
            {
              "code": "PHYS 159",
              "title": "or (d) SCIE 001",
              "credits": 1,
              "year": 1,
              "term": 2,
              "description": "A laboratory course with emphasis on experimental design, measurement and analysis techniques.",
              "prerequisites": "One of PHYS 12, PHYS 100.\n\nCorequisites: One of PHYS 157, PHYS 158. PHYS_V 170 (3) Mechanics I Statics of particles, equilibrium or rigid bodies, rigid body statics and internal forces, trusses; kinematics: rectilinear motion; dynamics: Newton's second law, friction, impulse, momentum, work and energy. Recommended pre-requisites: one of PHYS 12, PHYS 100 and one of MATH 100, MATH 102, MATH 104, MATH 110, MATH 120, MATH 180, MATH 184. Recommended co-requisite: one of MATH 101, MATH 103, MATH 105, MATH 121.\n\nCorequisites: One of MATH 200, MATH 217, MATH 226, MATH 253.\n\nCorequisites: One of MATH 200, MATH 217, MATH 226, MATH 253.\n\nCorequisites: One of MATH 200, MATH 217, MATH 226, MATH 253.\n\nCorequisites: One of MATH 200, MATH 217, MATH 226, MATH 253."
            },
            {
              "code": "PHYS 170",
              "title": "",
              "credits": 3,
              "year": 1,
              "term": 2,
              "description": "Mechanics I Statics of particles, equilibrium or rigid bodies, rigid body statics and internal forces, trusses; kinematics: rectilinear motion; dynamics: Newton's second law, friction, impulse, momentum, work and energy. Recommended pre-requisites: one of PHYS 12,",
              "prerequisites": "Corequisites: One of MATH 200, MATH 217, MATH 226, MATH 253, MATH 254."
            },
            {
              "code": "ELECTIVE",
              "title": "Complementary Studies electives",
              "credits": 3,
              "year": 1,
              "term": 2
            }
          ]
        }
      ]
    },
    {
      "year": 2,
      "label": "Year 2",
      "terms": [
        {
          "term": 1,
          "courses": [
            {
              "code": "APSC 278",
              "title": "",
              "credits": 3,
              "year": 2,
              "term": 1,
              "description": "Engineering Materials Atomic bonding; crystal structures and imperfections; properties of metals, ceramics, polymers, wood, concrete and fibre composite materials; selection of materials; corrosion; mechanical testing and heat treatment."
            },
            {
              "code": "APSC 279",
              "title": "",
              "credits": 1,
              "year": 2,
              "term": 1,
              "description": "Engineering Materials Laboratory Atomic bonding; crystal structures and imperfections; properties of metals, ceramics, polymers, wood, concrete and fibre composite materials; selection of materials; corrosion; mechanical testing and heat treatment. [0-2*- 0] Corequisite:",
              "prerequisites": "Corequisites: APSC_V 278"
            },
            {
              "code": "CHBE 241",
              "title": "This course is not eligible for Credit/D/Fail grading",
              "credits": 3,
              "year": 2,
              "term": 1,
              "description": "Material and Energy Balances Introduction to Chemical and Biological Engineering; units; stoichiometry; phase equilibria; material balances; energy balances.",
              "prerequisites": "All of CHEM 154, MATH 152."
            },
            {
              "code": "CHBE 244",
              "title": "Chemical and Biological Engineering Thermodynamics I",
              "credits": 3,
              "year": 2,
              "term": 1,
              "description": "Energy and the first law; second law of thermodynamics; entropy; availability (energy) analysis; thermodynamic properties of fluids, application to power generation, refrigeration, and liquefaction, as well as biological, environmental, and electrochemical systems. *] Prerequisite:"
            },
            {
              "code": "CIVL 215",
              "title": "",
              "credits": 4,
              "year": 2,
              "term": 1,
              "description": "Fluid Mechanics I Fluid properties, hydrostatics, kinematics, and fluid dynamics: energy and momentum methods with applications. Dimensional analysis, modelling, introduction to flow in pipes and forces on immersed objects.",
              "prerequisites": "All of PHYS 170, MATH 101."
            },
            {
              "code": "CPEN 312",
              "title": "",
              "credits": 3,
              "year": 2,
              "term": 1,
              "description": "Data representation in digital computers; boolean algebra; the design and optimization and implementation of combinatorial and sequential circuits; modern digital circuit technologies; memory and programmable logic devices; organization and operation of microcomputers; data/address bus organization; input-output interfacing. Credit will be given for only one of CPEN 312 or CPEN 211.",
              "prerequisites": "Prerequisites: ONE of ELEC 201 – Circuit Analysis I ELEC 203 – Basic Circuit Analysis ELEC 204 – Linear Circuits MECH 221 – Engineering Science I"
            }
          ]
        },
        {
          "term": 2,
          "courses": [
            {
              "code": "ELEC 204",
              "title": "",
              "credits": 4,
              "year": 2,
              "term": 2,
              "description": "Basic concepts and analysis techniques in the context of electric and electronic circuits including Bode plots and the Laplace transform. Treatment of RLC circuits, phasors, op-amps. Introduction to nonlinear circuit elements, diodes, BJT, FET circuits. [4-0-1]",
              "prerequisites": "Prerequisites: MATH 152 – Linear Systems AND ONE of PHYS 108 – Enriched Physics II PHYS 118 – Electricity, Light and Radiation PHYS 158 – Introductory Physics for Engineers II\n\nCorequisites: ONE of MATH 255 – Ordinary Differential Equations MATH 256 – Differential equations"
            },
            {
              "code": "ELEC 205",
              "title": "",
              "credits": 1,
              "year": 2,
              "term": 2,
              "description": "Experiments involving electronic devices and circuits.",
              "prerequisites": "Corequisites: ELEC 204 – Linear Circuits"
            },
            {
              "code": "IGEN 201",
              "title": "",
              "credits": 3,
              "year": 2,
              "term": 2,
              "description": "Integrated Technical Communication Written and oral communication in business correspondence, engineering design methods, report preparation, and oral presentations of technical material. Restricted to students in second year of the Integrated Engineering Program. ;",
              "prerequisites": "One of APSC 176, ENGL 110, ENGL 111, ENGL 112, ENGL 120, ENGL 121, WRDS 150.\n\nEquivalency: APSC201"
            },
            {
              "code": "IGEN 230",
              "title": "",
              "credits": 6,
              "year": 2,
              "term": 2,
              "description": "Introduction to Engineering Design Introduction to engineering design methods, problem solving, working individually and in teams, and methods of communication of results. Engineering design projects will be assigned. Restricted to students in the second year of the Integrated Engineering program. ;"
            },
            {
              "code": "MATH 253",
              "title": "Multivariable Calculus",
              "credits": 3,
              "year": 2,
              "term": 2,
              "description": "Partial and directional derivatives; maxima and minima; Lagrange multipliers and second derivative test; multiple integrals and applications. Please consult the Faculty of Science Credit Exclusion List: https://vancouver.calendar.ubc.ca/faculties-colleges-and-schools/facult…",
              "prerequisites": "One of MATH 101, MATH 103, MATH 105, MATH 121, SCIE 001."
            },
            {
              "code": "MATH 255",
              "title": "Ordinary Differential Equations\n\n\nReview of linear systems; nonlinear equations and applications; phase plane analysis; Laplace transforms; numerical methods",
              "credits": 3,
              "year": 2,
              "term": 2,
              "description": "Ordinary Differential Equations Review of linear systems; nonlinear equations and applications; phase plane analysis; Laplace transforms; numerical methods. Please consult the Faculty of Science Credit Exclusion List: https://vancouver.calendar.ubc.ca/faculties-colleges-and-schools/facult…",
              "prerequisites": "One of"
            },
            {
              "code": "MECH 260",
              "title": "Introduction to Mechanics of Materials",
              "credits": 3,
              "year": 2,
              "term": 2,
              "description": "Statically determinate frames and trusses; normal and shear stresses and strains; shear force and bending moment diagrams; theory of beam bending, torsion of circular rods; transformation of stress and strain in two and three dimensions, Mohr's circle; yield and ultimate failure criteria.",
              "prerequisites": "Either (a) all of MATH 101, PHYS 170 or (b) all of APSC 172, APSC 173, APSC 180."
            }
          ]
        }
      ]
    },
    {
      "year": 3,
      "label": "Year 3",
      "terms": [
        {
          "term": 1,
          "courses": [
            {
              "code": "CHBE 344",
              "title": "This course is not eligible for Credit/D/Fail grading",
              "credits": 3,
              "year": 3,
              "term": 1,
              "description": "Introduction to Unit Operations Foundational concepts and design equations for basic unit operations such as: comminution, screening, filtration, centrifugal separations, evaporation and crystallization. *]",
              "prerequisites": "Either (a) all of"
            },
            {
              "code": "COMR 280",
              "title": "",
              "credits": 3,
              "year": 3,
              "term": 1
            },
            {
              "code": "ELEC 344",
              "title": "",
              "credits": 3,
              "year": 3,
              "term": 1,
              "description": "Characteristics of semiconductor devices; analog circuits; force and torque production; motor principles and torque-speed characteristics; principles of power electronics. Not open to students in Electrical and Computer Engineering. Credit will be granted for only one of ELEC 342, ELEC 343, ELEC 344.",
              "prerequisites": "Prerequisites: skills for this course in include basic circuit analysis ability (i.e. Ohm’s Law, Kirchoff’s Voltage and Current laws.) 10 credits Prerequisite: ONE of ELEC 201 – Circuit Analysis I ELEC 203 – Basic Circuit Analysis ELEC 204 – Linear Circuits MECH 221 – Engineering Science I"
            },
            {
              "code": "IGEN 330",
              "title": "",
              "credits": 6,
              "year": 3,
              "term": 1,
              "description": "Intermediate Engineering Design Intermediate level engineering design projects involving material in the curriculum of the Integrated Engineering program. [1-4;1-4]"
            },
            {
              "code": "MECH 360",
              "title": "Mechanics of Materials",
              "credits": 3,
              "year": 3,
              "term": 1,
              "description": "Beam deflections, singularity functions; use of tabulated solutions; column buckling; Castigliano's theorem, statically indeterminate beams, bending of beams with asymmetric cross-sections, shear centre; principal stresses and stress invariants in three dimensions.",
              "prerequisites": "One of MECH 224, MECH 260."
            }
          ]
        },
        {
          "term": 2,
          "courses": [
            {
              "code": "MECH 375",
              "title": "Credit will be granted for only one of",
              "credits": 3,
              "year": 3,
              "term": 2,
              "description": "Steady and transient conduction. Radiation heat transfer. Convective heat and mass transfer in pipes and from external surfaces. Design of heat exchangers.",
              "prerequisites": "Either (a)"
            },
            {
              "code": "MTRL 280",
              "title": "",
              "credits": 3,
              "year": 3,
              "term": 2,
              "description": "Materials in Design The process of materials selection for different design criteria; the importance of shape and processing variables; the use of computer software in the selection process."
            },
            {
              "code": "STAT 251",
              "title": "",
              "credits": 3,
              "year": 3,
              "term": 2
            },
            {
              "code": "CHBE 356",
              "title": "This course is not eligible for Credit/D/Fail grading",
              "credits": 4,
              "year": 3,
              "term": 2,
              "description": "Process Dynamics and Control Introduction to modelling of chemical processes; transient response analysis; design of feedback control systems; stability analysis; frequency response analysis; process control applications; instrumentation; advanced control techniques; distributed control systems.",
              "prerequisites": "MATH_V 255 or MATH_V 256."
            },
            {
              "code": "ELECTIVE",
              "title": "Technical electives",
              "credits": 6,
              "year": 3,
              "term": 2
            }
          ]
        }
      ]
    },
    {
      "year": 4,
      "label": "Year 4",
      "terms": [
        {
          "term": 1,
          "courses": [
            {
              "code": "APSC 450",
              "title": "",
              "credits": 2,
              "year": 4,
              "term": 1,
              "description": "Professional Engineering Practice Legislation affecting the practice of engineering; ethical principles and responsibilities. Management of engineering enterprises; labour relations, safety and environmental legislation. Restricted to engineering undergraduate students in the final year of their program."
            },
            {
              "code": "CIVL 305",
              "title": "",
              "credits": 3,
              "year": 4,
              "term": 1,
              "description": "Introduction to Environmental Engineering Applications Environmental legislation; risk assessment; urban water; mass balance; water and wastewater treatment; environmental impact assessment. Prerequisite:"
            },
            {
              "code": "IGEN 430",
              "title": "",
              "credits": 6,
              "year": 4,
              "term": 1,
              "description": "Advanced Engineering Design Projects Projects involving all material in the curriculum of the Integrated Engineering Program. Students will be expected to propose a project and complete the design and construction of a prototype. Restricted to students in the fourth year of the Integrated Engineering program. ;"
            },
            {
              "code": "MTRL 340",
              "title": "",
              "credits": 3,
              "year": 4,
              "term": 1,
              "description": "Manufacturing in Materials Engineering Manufacturing processes from a materials perspective; metal casting, heat treating processes, forming processes, machining, and joining. Role of manufacturing in microstructure and material properties development and on component performance."
            }
          ]
        },
        {
          "term": 2,
          "courses": [
            {
              "code": "MINE 350",
              "title": "One of , , , ,  or",
              "credits": 3,
              "year": 4,
              "term": 2,
              "description": "Modelling and Simulation Methods for determining the behaviour of large scale industrial systems and their application to the design and analysis of such systems.",
              "prerequisites": "STAT 251."
            },
            {
              "code": "CHBE 459",
              "title": "Chemical and Biological Engineering Economics",
              "credits": 3,
              "year": 4,
              "term": 2,
              "description": "Estimation of capital and operating costs; interest calculations; taxes; economic comparison of alternatives; economic optimization.",
              "prerequisites": "Third-year or higher standing in BASc or BSc."
            },
            {
              "code": "ELECTIVE",
              "title": "Technical electives",
              "credits": 12,
              "year": 4,
              "term": 2
            },
            {
              "code": "IGEN 201",
              "title": "Students failing  will be required to pass  subsequently.",
              "credits": 3,
              "year": 4,
              "term": 2,
              "description": "Integrated Technical Communication Written and oral communication in business correspondence, engineering design methods, report preparation, and oral presentations of technical material. Restricted to students in second year of the Integrated Engineering Program. ;",
              "prerequisites": "One of APSC 176, ENGL 110, ENGL 111, ENGL 112, ENGL 120, ENGL 121, WRDS 150.\n\nEquivalency: APSC201"
            }
          ]
        }
      ]
    }
  ]
}