{
  "faculty": "Applied Science",
  "major": "Manufacturing Engineering",
  "totalCredits": 154,
  "notes": "UBC Applied Science (Engineering) - Manufacturing Engineering curriculum outline. First year is common to most engineering programs.",
  "years": [
    {
      "year": 1,
      "label": "Year 1",
      "terms": [
        {
          "term": 1,
          "courses": [
            {
              "code": "APSC 100",
              "title": "",
              "credits": 3,
              "year": 1,
              "term": 1,
              "description": "Introduction to Engineering I An introduction to the engineering profession including: roles and responsibilities of the engineer, the engineering disciplines, sustainability, an introduction to the engineering design process, introduction and application of the relevant foundational scientific principles, prototyping, engineering graphics, technical communication, and engineering ethics.",
              "prerequisites": "APSC 100\n\nCorequisites: APSC 173"
            },
            {
              "code": "APSC 101",
              "title": "",
              "credits": 3,
              "year": 1,
              "term": 1,
              "description": "Introduction to Engineering II An introduction to the engineering profession including: the engineering design process, sustainability, prototype testing, introduction and application of the relevant foundational scientific principles, team functioning, engineering graphics, and technical communication. Prerequisite:",
              "prerequisites": "APSC 100."
            },
            {
              "code": "APSC 160",
              "title": "",
              "credits": 3,
              "year": 1,
              "term": 1,
              "description": "Introduction to Computation in Engineering Design Analysis and simulation, laboratory data acquisition and processing, measurement interfaces, engineering tools, computer systems organization, programming languages. Credit will only be given for one of:"
            },
            {
              "code": "CHEM 154",
              "title": "",
              "credits": 3,
              "year": 1,
              "term": 1,
              "description": "Chemistry for Engineering Chemical bonding, properties of matter. Chemical thermodynamics with applications to phase equilibria, aqueous equilibria and electrochemistry. Processes at surfaces. [3-3*-0]",
              "prerequisites": "CHEM 12."
            },
            {
              "code": "WRDS 150",
              "title": "",
              "credits": 3,
              "year": 1,
              "term": 1,
              "description": "Writing and Research in the Disciplines Writing and reading in disciplines across the academy, focusing on practices that research disciplines share and those that differentiate them. Restricted to students not in the Faculty of Arts. Credit can be granted for only one of"
            },
            {
              "code": "MATH 100",
              "title": "Differential Calculus with Applications\n\n\nDerivatives of elementary functions",
              "credits": 3,
              "year": 1,
              "term": 1,
              "description": "Differential Calculus with Applications Derivatives of elementary functions. Applications and modelling: graphing, optimization. Consult the Faculty of Science Credit Exclusion List: https://vancouver.calendar.ubc.ca/faculties-colleges-and-schools/facult…",
              "prerequisites": "A score of 80% or higher in BC Pre-calculus 12. High school calculus is strongly recommended."
            }
          ]
        },
        {
          "term": 2,
          "courses": [
            {
              "code": "MATH 101",
              "title": ", 105",
              "credits": 3,
              "year": 1,
              "term": 2,
              "description": "Integral Calculus with Applications The definite integral, integration techniques, applications, modelling, infinite series. Equivalency:",
              "prerequisites": "One of"
            },
            {
              "code": "MATH 152",
              "title": "Linear Systems\n\n\n2D and 3D geometry, vectors and matrices, eigenvalues and vibration, physical applications",
              "credits": 3,
              "year": 1,
              "term": 2,
              "description": "Linear Systems 2D and 3D geometry, vectors and matrices, eigenvalues and vibration, physical applications. Laboratories demonstrate computer solutions of large systems. Please consult the Faculty of Science Credit Exclusion List: https://vancouver.calendar.ubc.ca/faculties-colleges-and-schools/facult… [3-1*-0]",
              "prerequisites": "Corequisites: [MATH101]"
            },
            {
              "code": "PHYS 157",
              "title": "",
              "credits": 3,
              "year": 1,
              "term": 2,
              "description": "Introductory Physics for Engineers I Heat, thermodynamics, oscillations, waves, and sound.",
              "prerequisites": "One of PHYS 12,"
            },
            {
              "code": "PHYS 158",
              "title": ", SCIE 001 and a score of 68% or higher in one of MATH 101, MATH 103, MATH 105, MATH 121, SCIE 001. Corequisite: One of MATH 152, MATH 221, MATH 223",
              "credits": 3,
              "year": 1,
              "term": 2,
              "description": "Introductory Physics for Engineers II Electricity and magnetism, DC and AC circuits, optics. Prerequisite:",
              "prerequisites": "Either (a) a score of 64% or higher in one of MATH 101, MATH 103, MATH 105, SCIE 001 or (b) one of MATH 121, MATH 200, MATH 217, MATH 226, MATH 253, MATH 254. MATH_V 221 (3) Matrix Algebra Systems of linear equations, operations on matrices, determinants, eigenvalues and eigenvectors, diagonalization of symmetric matrices.\n\nEquivalency: MATH_V 111.\n\nCorequisites: One of MATH 152, MATH 221, MATH 223. MATH_V 227 (3) Advanced Calculus II Parametrization of curves and surfaces; line and surface integrals; theorems of Green, Gauss, Stokes; applications to physics and/or introduction to differential forms. Please consult the Faculty of Science Credit Exclusion List: https://vancouver.calendar.ubc.ca/faculties-colleges-and-schools/facult…"
            },
            {
              "code": "PHYS 159",
              "title": "",
              "credits": 1,
              "year": 1,
              "term": 2,
              "description": "Introductory Physics Laboratory for Engineers A laboratory course with emphasis on experimental design, measurement and analysis techniques.",
              "prerequisites": "One of PHYS 12,"
            },
            {
              "code": "PHYS 170",
              "title": "",
              "credits": 3,
              "year": 1,
              "term": 2,
              "description": "Mechanics I Statics of particles, equilibrium or rigid bodies, rigid body statics and internal forces, trusses; kinematics: rectilinear motion; dynamics: Newton's second law, friction, impulse, momentum, work and energy. Recommended pre-requisites: one of PHYS 12,",
              "prerequisites": "Corequisites: One of MATH 200, MATH 217, MATH 226, MATH 253, MATH 254."
            },
            {
              "code": "ELECTIVE",
              "title": "Complementary Studies electives",
              "credits": 3,
              "year": 1,
              "term": 2
            }
          ]
        }
      ]
    },
    {
      "year": 2,
      "label": "Year 2",
      "terms": [
        {
          "term": 1,
          "courses": [
            {
              "code": "APSC 278",
              "title": "",
              "credits": 3,
              "year": 2,
              "term": 1,
              "description": "Engineering Materials Atomic bonding; crystal structures and imperfections; properties of metals, ceramics, polymers, wood, concrete and fibre composite materials; selection of materials; corrosion; mechanical testing and heat treatment."
            },
            {
              "code": "APSC 279",
              "title": "",
              "credits": 1,
              "year": 2,
              "term": 1,
              "description": "Engineering Materials Laboratory Atomic bonding; crystal structures and imperfections; properties of metals, ceramics, polymers, wood, concrete and fibre composite materials; selection of materials; corrosion; mechanical testing and heat treatment. [0-2*- 0] Corequisite:",
              "prerequisites": "Corequisites: APSC_V 278"
            },
            {
              "code": "CPEN 223",
              "title": "",
              "credits": 4,
              "year": 2,
              "term": 1,
              "description": "Introduction to robust software design: static typing, procedural specifications, unit testing, black-box and white-box tests, user-defined data types (representations, invariants, abstraction functions), data abstractions, communicating design (e.g., UML).",
              "prerequisites": "Prerequisites: APSC 160 – Introduction to Computation in Engineering Design"
            },
            {
              "code": "ELEC 203",
              "title": "",
              "credits": 3,
              "year": 2,
              "term": 1,
              "description": "Ideal passive elements and sources; Kirchhoff’s Laws; DC circuits; natural,  and complete response of first order circuits; operational amplifiers; impedance; phasors; complex power. Not open to students in Electrical and Computer Engineering. [3-2*-0]",
              "prerequisites": "Prerequisites: MATH 101 – Integral Calculus with Applications AND ONE of PHYS 108 – Enriched Physics II PHYS 118 – Electricity, Light and Radiation PHYS 158 – Introductory Physics for Engineers II\n\nCorequisites: ONE of MATH 255 – Ordinary Differential Equations MATH 256 – Differential Equations"
            },
            {
              "code": "MANU 201",
              "title": "",
              "credits": 3,
              "year": 2,
              "term": 1,
              "description": "Technical Communication Written and oral communication in business correspondence, engineering design methods, report preparation and oral presentations of technical material. Restricted to students in second year of the Manufacturing Engineering Program.",
              "prerequisites": "One of APSC 176, ENGL 110, ENGL 111, ENGL 112, ENGL 120, ENGL 121, WRDS 150.\n\nEquivalency: APSC 201"
            },
            {
              "code": "MANU 230",
              "title": "",
              "credits": 4,
              "year": 2,
              "term": 1,
              "description": "Manufacturing Engineering Laboratory Theory, operational constraints, and problem solving in traditional manufacturing processes. Casting, heat treatment, bulk deformation (i.e. rolling, extrusion, drawing), machining, joining, and shaping of composites. Experiments in process and product characterization. ;"
            }
          ]
        },
        {
          "term": 2,
          "courses": [
            {
              "code": "MANU 261",
              "title": "",
              "credits": 3,
              "year": 2,
              "term": 2,
              "description": "Thermodynamics Thermodynamic system and properties, thermodynamic processes; work and heat interactions. Conservation of energy and First Law, internal energy and enthalpy, the Second Law and entropy, application to manufacturing processes.",
              "prerequisites": "All of MATH_V 101, MATH_V 152, PHYS_V 157.\n\nCorequisites: MATH_V 255."
            },
            {
              "code": "MANU 265",
              "title": "",
              "credits": 3,
              "year": 2,
              "term": 2,
              "description": "Machine Dynamics Classifications of mechanisms, velocity, acceleration and force analysis, graphical and computer-oriented vector and matrix methods, balancing, flywheels, gears, gear trains, cams. *]",
              "prerequisites": "All of MATH_V 101, MATH_V 152, PHYS_V 170.\n\nCorequisites: MATH_V 255."
            },
            {
              "code": "MATH 253",
              "title": "Multivariable Calculus\n\n\nPartial and directional derivatives; maxima and minima; Lagrange multipliers and second derivative test; multiple integrals and applications",
              "credits": 3,
              "year": 2,
              "term": 2,
              "description": "Multivariable Calculus Partial and directional derivatives; maxima and minima; Lagrange multipliers and second derivative test; multiple integrals and applications. Please consult the Faculty of Science Credit Exclusion List: https://vancouver.calendar.ubc.ca/faculties-colleges-and-schools/facult…",
              "prerequisites": "One of"
            },
            {
              "code": "MATH 255",
              "title": "Ordinary Differential Equations\n\n\nReview of linear systems; nonlinear equations and applications; phase plane analysis; Laplace transforms; numerical methods",
              "credits": 3,
              "year": 2,
              "term": 2,
              "description": "Ordinary Differential Equations Review of linear systems; nonlinear equations and applications; phase plane analysis; Laplace transforms; numerical methods. Please consult the Faculty of Science Credit Exclusion List: https://vancouver.calendar.ubc.ca/faculties-colleges-and-schools/facult…",
              "prerequisites": "One of"
            },
            {
              "code": "MECH 260",
              "title": "Introduction to Mechanics of Materials",
              "credits": 3,
              "year": 2,
              "term": 2,
              "description": "Statically determinate frames and trusses; normal and shear stresses and strains; shear force and bending moment diagrams; theory of beam bending, torsion of circular rods; transformation of stress and strain in two and three dimensions, Mohr's circle; yield and ultimate failure criteria.",
              "prerequisites": "Either (a) all of MATH 101, PHYS 170 or (b) all of APSC 172, APSC 173, APSC 180."
            },
            {
              "code": "MTRL 263",
              "title": "",
              "credits": 3,
              "year": 2,
              "term": 2,
              "description": "Transport Phenomena I - Fluid Mechanics Fluid statics; fluid mechanics; laminar and turbulent flow; equations of continuity and motion; boundary layers; flow in conduits and packed and fluidized beds; flow measurements."
            },
            {
              "code": "MTRL 264",
              "title": "",
              "credits": 3,
              "year": 2,
              "term": 2,
              "description": "Transport Phenomena II - Heat Transport Conduction, forced and natural convection, and radiation. Heat transfer with fluid flow, applications of heat exchange, and solidification of castings."
            }
          ]
        }
      ]
    },
    {
      "year": 3,
      "label": "Year 3",
      "terms": [
        {
          "term": 1,
          "courses": [
            {
              "code": "CPEN 333",
              "title": "",
              "credits": 3,
              "year": 3,
              "term": 1,
              "description": "Operating systems principles, real-time systems, principles of concurrent and multi-threaded programming, information structures, introduction to object oriented analysis, design, and modeling using UML, testing of software systems.",
              "prerequisites": "Prerequisites: ONE of CPSC 259 – Data Structures and Algorithms for Electrical Engineers CPEN 223 – Software Design for Engineers I"
            },
            {
              "code": "MANU 270",
              "title": "",
              "credits": 3,
              "year": 3,
              "term": 1,
              "description": "Production Systems Management I Impact of operations in increasing productivity and reducing waste."
            },
            {
              "code": "MANU 330",
              "title": "",
              "credits": 6,
              "year": 3,
              "term": 1,
              "description": "Manufacturing Engineering Project I Project-based, multi-step manufacturing engineering design and problem solving. ; Prerequisite:"
            },
            {
              "code": "MANU 378",
              "title": "",
              "credits": 3,
              "year": 3,
              "term": 1,
              "description": "Engineering Materials II Materials selection for different design criteria; importance of shape and processing variables; computer software in selection. Credit will be granted for only one of MTRL 280 or"
            },
            {
              "code": "MANU 380",
              "title": "",
              "credits": 3,
              "year": 3,
              "term": 1,
              "description": "Manufacturing Processes I Correlation between material properties and processibility for practical engineering manufacturing routes. Calculations and design. Application of heat/mass/fluid transport, mechanics and thermodynamics to manufacturing processes. Corequisite:",
              "prerequisites": "All of APSC_V 278, APSC_V 279, MTRL_V 264, MECH_V 260 and one of MECH_V 280, MTRL_V 263."
            },
            {
              "code": "MANU 386",
              "title": "",
              "credits": 3,
              "year": 3,
              "term": 1,
              "description": "Industrial Automation Principle components of manufacturing automation, modelling of sensors-actuators and control systems, robotic programming, programmable logical control (PLC) systems and development of PLC ladder diagrams. [2-3*-1]",
              "prerequisites": "All of"
            }
          ]
        },
        {
          "term": 2,
          "courses": [
            {
              "code": "MECH 360",
              "title": "Mechanics of Materials",
              "credits": 3,
              "year": 3,
              "term": 2,
              "description": "Beam deflections, singularity functions; use of tabulated solutions; column buckling; Castigliano's theorem, statically indeterminate beams, bending of beams with asymmetric cross-sections, shear centre; principal stresses and stress invariants in three dimensions.",
              "prerequisites": "One of MECH 224, MECH 260."
            },
            {
              "code": "MECH 368",
              "title": "Engineering Measurements and Instrumentation",
              "credits": 4,
              "year": 3,
              "term": 2,
              "description": "Industrial measurement needs including: architecture of electronic instrumentation systems; electrical representation of physical quantities; sensors and actuators; analog signal processing using linear and non-linear circuits; computer-based readout including programming for user-interface and data acquisition.",
              "prerequisites": "Either (a) two of MECH_V 220, MECH_V 224, ELEC_V 203 or (b) all of MANU_V 230, ELEC_V 203."
            },
            {
              "code": "MECH 463",
              "title": "Mechanical Vibrations",
              "credits": 4,
              "year": 3,
              "term": 2,
              "description": "Theory of vibration of mechanical systems. Undamped 1 degree of freedom vibration, forced vibrations and resonance, damping, multiple degree of freedom systems, mode shapes and orthogonality, continuous systems, vibration measuring instruments and frequency spectrum analysis. [3-2*-1]",
              "prerequisites": "One of MECH 224, MECH 260."
            },
            {
              "code": "MTRL 455",
              "title": "",
              "credits": 3,
              "year": 3,
              "term": 2,
              "description": "Economic Aspects of Materials Engineering Time value of money, cash flows, capital and operating cost estimation, financial decision making and relevant case studies."
            },
            {
              "code": "STAT 251",
              "title": "",
              "credits": 3,
              "year": 3,
              "term": 2
            },
            {
              "code": "ELECTIVE",
              "title": "Complementary Studies electives",
              "credits": 3,
              "year": 3,
              "term": 2
            }
          ]
        }
      ]
    },
    {
      "year": 4,
      "label": "Year 4",
      "terms": [
        {
          "term": 1,
          "courses": [
            {
              "code": "MANU 370",
              "title": "",
              "credits": 3,
              "year": 4,
              "term": 1,
              "description": "Production Systems Management II Functional area of production and operations management. Decision-making, capacity planning, aggregate planning, inventory management, distribution planning, materials requirements planning and quality control. Prerequisite:"
            },
            {
              "code": "MANU 430",
              "title": "",
              "credits": 6,
              "year": 4,
              "term": 1,
              "description": "Manufacturing Design Capstone Project Project-based, multi-step, multi-part Capstone design project involving manufacturing engineering design methods, problem solving. ; Prerequisite:"
            },
            {
              "code": "MANU 480",
              "title": "",
              "credits": 3,
              "year": 4,
              "term": 1,
              "description": "Manufacturing Processes II Numerical modelling of manufacturing processes, linkage between material, process, properties and product geometry, heat/mass transport, thermodynamics and design principles applied to practical engineering processes. Prerequisite:"
            },
            {
              "code": "MANU 481",
              "title": "",
              "credits": 3,
              "year": 4,
              "term": 1,
              "description": "Manufacturing Processes III Integrating concepts of primary (casting), secondary (deformation), and tertiary (machining and surface treatment) processes and economic and environmental assessment. Prerequisite:"
            }
          ]
        },
        {
          "term": 2,
          "courses": [
            {
              "code": "MANU 485",
              "title": "",
              "credits": 3,
              "year": 4,
              "term": 2,
              "description": "Metal Cutting and Machine Tool Vibrations Metal cutting and grinding mechanics; prediction of force-torque-power in turning, drilling, milling and grinding operations. Machine tool vibrations, forced and self-excited vibrations in machining, experimental modal testing of machine tools, chatter, and stability. Credit will be granted for only one of"
            },
            {
              "code": "MECH 400",
              "title": "Professionalism and Ethics in Engineering",
              "credits": 3,
              "year": 4,
              "term": 2,
              "description": "Professionalism, ethical frameworks, decolonization, equity, diversity, inclusion, law. Obligations of the engineer.",
              "prerequisites": "Fourth-year standing in B.A.Sc."
            },
            {
              "code": "MECH 467",
              "title": "Computer Control of Mechatronics Systems",
              "credits": 4,
              "year": 4,
              "term": 2,
              "description": "Block diagrams and transfer functions, continuous and discrete domain transformations, feedback control system characteristics, control design in both continuous and discrete domain, absolute and relative stability, laboratory examples of Mechatronic systems design. Credit will be granted for only one of",
              "prerequisites": "One of"
            },
            {
              "code": "MECH 491",
              "title": "Computer-Aided Manufacturing",
              "credits": 3,
              "year": 4,
              "term": 2,
              "description": "NC programming and machining with interactive CAD/CAM systems. Curve and surface geometry for tool-path generation. Tool-path generation methodologies. Geometric modelling techniques for simulation and verification of manufacturing processes. Introduction to Computer-Aided Process Planning. Supplementary tutorial laboratory experiments. Recommended co-requisites:"
            },
            {
              "code": "ELECTIVE",
              "title": "Technical Electives",
              "credits": 9,
              "year": 4,
              "term": 2
            }
          ]
        }
      ]
    }
  ]
}