{
  "faculty": "Applied Science",
  "major": "Materials Engineering",
  "totalCredits": 147,
  "notes": "UBC Applied Science (Engineering) - Materials Engineering curriculum outline. First year is common to most engineering programs.",
  "years": [
    {
      "year": 1,
      "label": "Year 1",
      "terms": [
        {
          "term": 1,
          "courses": [
            {
              "code": "APSC 100",
              "title": "",
              "credits": 3,
              "year": 1,
              "term": 1,
              "description": "Introduction to Engineering I An introduction to the engineering profession including: roles and responsibilities of the engineer, the engineering disciplines, sustainability, an introduction to the engineering design process, introduction and application of the relevant foundational scientific principles, prototyping, engineering graphics, technical communication, and engineering ethics.",
              "prerequisites": "APSC 100\n\nCorequisites: APSC 173"
            },
            {
              "code": "APSC 101",
              "title": "",
              "credits": 3,
              "year": 1,
              "term": 1,
              "description": "Introduction to Engineering II An introduction to the engineering profession including: the engineering design process, sustainability, prototype testing, introduction and application of the relevant foundational scientific principles, team functioning, engineering graphics, and technical communication. Prerequisite:",
              "prerequisites": "APSC 100."
            },
            {
              "code": "APSC 160",
              "title": "",
              "credits": 3,
              "year": 1,
              "term": 1,
              "description": "Introduction to Computation in Engineering Design Analysis and simulation, laboratory data acquisition and processing, measurement interfaces, engineering tools, computer systems organization, programming languages. Credit will only be given for one of:"
            },
            {
              "code": "CHEM 154",
              "title": "",
              "credits": 3,
              "year": 1,
              "term": 1,
              "description": "Chemistry for Engineering Chemical bonding, properties of matter. Chemical thermodynamics with applications to phase equilibria, aqueous equilibria and electrochemistry. Processes at surfaces. [3-3*-0]",
              "prerequisites": "CHEM 12."
            },
            {
              "code": "WRDS 150",
              "title": "",
              "credits": 3,
              "year": 1,
              "term": 1,
              "description": "Writing and Research in the Disciplines Writing and reading in disciplines across the academy, focusing on practices that research disciplines share and those that differentiate them. Restricted to students not in the Faculty of Arts. Credit can be granted for only one of"
            },
            {
              "code": "MATH 100",
              "title": "Differential Calculus with Applications\n\n\nDerivatives of elementary functions",
              "credits": 3,
              "year": 1,
              "term": 1,
              "description": "Differential Calculus with Applications Derivatives of elementary functions. Applications and modelling: graphing, optimization. Consult the Faculty of Science Credit Exclusion List: https://vancouver.calendar.ubc.ca/faculties-colleges-and-schools/facult…",
              "prerequisites": "A score of 80% or higher in BC Pre-calculus 12. High school calculus is strongly recommended."
            }
          ]
        },
        {
          "term": 2,
          "courses": [
            {
              "code": "MATH 101",
              "title": ", 105",
              "credits": 3,
              "year": 1,
              "term": 2,
              "description": "Integral Calculus with Applications The definite integral, integration techniques, applications, modelling, infinite series. Equivalency:",
              "prerequisites": "One of"
            },
            {
              "code": "MATH 152",
              "title": "Linear Systems\n\n\n2D and 3D geometry, vectors and matrices, eigenvalues and vibration, physical applications",
              "credits": 3,
              "year": 1,
              "term": 2,
              "description": "Linear Systems 2D and 3D geometry, vectors and matrices, eigenvalues and vibration, physical applications. Laboratories demonstrate computer solutions of large systems. Please consult the Faculty of Science Credit Exclusion List: https://vancouver.calendar.ubc.ca/faculties-colleges-and-schools/facult… [3-1*-0]",
              "prerequisites": "Corequisites: [MATH101]"
            },
            {
              "code": "PHYS 157",
              "title": "",
              "credits": 3,
              "year": 1,
              "term": 2,
              "description": "Introductory Physics for Engineers I Heat, thermodynamics, oscillations, waves, and sound.",
              "prerequisites": "One of PHYS 12,"
            },
            {
              "code": "PHYS 158",
              "title": ", SCIE 001 and a score of 68% or higher in one of MATH 101, MATH 103, MATH 105, MATH 121, SCIE 001. Corequisite: One of MATH 152, MATH 221, MATH 223",
              "credits": 3,
              "year": 1,
              "term": 2,
              "description": "Introductory Physics for Engineers II Electricity and magnetism, DC and AC circuits, optics. Prerequisite:",
              "prerequisites": "Either (a) a score of 64% or higher in one of MATH 101, MATH 103, MATH 105, SCIE 001 or (b) one of MATH 121, MATH 200, MATH 217, MATH 226, MATH 253, MATH 254. MATH_V 221 (3) Matrix Algebra Systems of linear equations, operations on matrices, determinants, eigenvalues and eigenvectors, diagonalization of symmetric matrices.\n\nEquivalency: MATH_V 111.\n\nCorequisites: One of MATH 152, MATH 221, MATH 223. MATH_V 227 (3) Advanced Calculus II Parametrization of curves and surfaces; line and surface integrals; theorems of Green, Gauss, Stokes; applications to physics and/or introduction to differential forms. Please consult the Faculty of Science Credit Exclusion List: https://vancouver.calendar.ubc.ca/faculties-colleges-and-schools/facult…"
            },
            {
              "code": "PHYS 159",
              "title": "",
              "credits": 1,
              "year": 1,
              "term": 2,
              "description": "Introductory Physics Laboratory for Engineers A laboratory course with emphasis on experimental design, measurement and analysis techniques.",
              "prerequisites": "One of PHYS 12,"
            },
            {
              "code": "PHYS 170",
              "title": "",
              "credits": 3,
              "year": 1,
              "term": 2,
              "description": "Mechanics I Statics of particles, equilibrium or rigid bodies, rigid body statics and internal forces, trusses; kinematics: rectilinear motion; dynamics: Newton's second law, friction, impulse, momentum, work and energy. Recommended pre-requisites: one of PHYS 12,",
              "prerequisites": "Corequisites: One of MATH 200, MATH 217, MATH 226, MATH 253, MATH 254."
            },
            {
              "code": "ELECTIVE",
              "title": "Complementary Studies electives",
              "credits": 3,
              "year": 1,
              "term": 2
            }
          ]
        }
      ]
    },
    {
      "year": 2,
      "label": "Year 2",
      "terms": [
        {
          "term": 1,
          "courses": [
            {
              "code": "APSC 278",
              "title": "",
              "credits": 3,
              "year": 2,
              "term": 1,
              "description": "Engineering Materials Atomic bonding; crystal structures and imperfections; properties of metals, ceramics, polymers, wood, concrete and fibre composite materials; selection of materials; corrosion; mechanical testing and heat treatment."
            },
            {
              "code": "APSC 279",
              "title": "",
              "credits": 1,
              "year": 2,
              "term": 1,
              "description": "Engineering Materials Laboratory Atomic bonding; crystal structures and imperfections; properties of metals, ceramics, polymers, wood, concrete and fibre composite materials; selection of materials; corrosion; mechanical testing and heat treatment. [0-2*- 0] Corequisite:",
              "prerequisites": "Corequisites: APSC_V 278"
            },
            {
              "code": "MATH 253",
              "title": "Multivariable Calculus\n\n\nPartial and directional derivatives; maxima and minima; Lagrange multipliers and second derivative test; multiple integrals and applications",
              "credits": 3,
              "year": 2,
              "term": 1,
              "description": "Multivariable Calculus Partial and directional derivatives; maxima and minima; Lagrange multipliers and second derivative test; multiple integrals and applications. Please consult the Faculty of Science Credit Exclusion List: https://vancouver.calendar.ubc.ca/faculties-colleges-and-schools/facult…",
              "prerequisites": "One of"
            },
            {
              "code": "MATH 255",
              "title": "Ordinary Differential Equations\n\n\nReview of linear systems; nonlinear equations and applications; phase plane analysis; Laplace transforms; numerical methods",
              "credits": 3,
              "year": 2,
              "term": 1,
              "description": "Ordinary Differential Equations Review of linear systems; nonlinear equations and applications; phase plane analysis; Laplace transforms; numerical methods. Please consult the Faculty of Science Credit Exclusion List: https://vancouver.calendar.ubc.ca/faculties-colleges-and-schools/facult…",
              "prerequisites": "One of"
            },
            {
              "code": "MECH 260",
              "title": "Introduction to Mechanics of Materials",
              "credits": 3,
              "year": 2,
              "term": 1,
              "description": "Statically determinate frames and trusses; normal and shear stresses and strains; shear force and bending moment diagrams; theory of beam bending, torsion of circular rods; transformation of stress and strain in two and three dimensions, Mohr's circle; yield and ultimate failure criteria.",
              "prerequisites": "Either (a) all of MATH 101, PHYS 170 or (b) all of APSC 172, APSC 173, APSC 180."
            },
            {
              "code": "MTRL 201",
              "title": "",
              "credits": 3,
              "year": 2,
              "term": 1,
              "description": "Technical Communication Written and oral communication in business correspondence, engineering design methods, report preparation, and oral presentations of technical material. Restricted to students in second year of the Materials Engineering Program.",
              "prerequisites": "One of APSC_V 176, ENGL_V 110, ENGL_V 111, ENGL_V 112, ENGL_V 120, ENGL_V 121, WRDS_V 150.\n\nEquivalency: APSC_V 201."
            }
          ]
        },
        {
          "term": 2,
          "courses": [
            {
              "code": "MTRL 250",
              "title": "",
              "credits": 4,
              "year": 2,
              "term": 2,
              "description": "Thermodynamics of Materials I Heat and mass balances applied to materials engineering; thermodynamic principles applied to materials processing: heat of reaction, free energy, activity, phase equilibrium, reactions involving gases, Ellingham diagrams."
            },
            {
              "code": "MTRL 251",
              "title": "",
              "credits": 4,
              "year": 2,
              "term": 2,
              "description": "Thermodynamics of Materials II Behaviour of solutions, phase diagrams, electrochemistry, chemical potential and free energy diagrams applied to materials processing and thermodynamic modelling. Prerequisite:"
            },
            {
              "code": "MTRL 263",
              "title": "",
              "credits": 3,
              "year": 2,
              "term": 2,
              "description": "Transport Phenomena I - Fluid Mechanics Fluid statics; fluid mechanics; laminar and turbulent flow; equations of continuity and motion; boundary layers; flow in conduits and packed and fluidized beds; flow measurements."
            },
            {
              "code": "MTRL 264",
              "title": "",
              "credits": 3,
              "year": 2,
              "term": 2,
              "description": "Transport Phenomena II - Heat Transport Conduction, forced and natural convection, and radiation. Heat transfer with fluid flow, applications of heat exchange, and solidification of castings."
            },
            {
              "code": "MTRL 280",
              "title": "",
              "credits": 3,
              "year": 2,
              "term": 2,
              "description": "Materials in Design The process of materials selection for different design criteria; the importance of shape and processing variables; the use of computer software in the selection process."
            },
            {
              "code": "ELECTIVE",
              "title": "Complementary Studies electives",
              "credits": 6,
              "year": 2,
              "term": 2
            }
          ]
        }
      ]
    },
    {
      "year": 3,
      "label": "Year 3",
      "terms": [
        {
          "term": 1,
          "courses": [
            {
              "code": "MTRL 320",
              "title": "",
              "credits": 2,
              "year": 3,
              "term": 1,
              "description": "Management of Engineering Design Fundamental communication and inter- personal skills, as well as operational processes, that engineers require to effectively work in design teams. Concepts and best practices around project management tools and techniques, team dynamics, planning, and organization. Prerequisite:"
            },
            {
              "code": "MTRL 340",
              "title": "",
              "credits": 3,
              "year": 3,
              "term": 1,
              "description": "Manufacturing in Materials Engineering Manufacturing processes from a materials perspective; metal casting, heat treating processes, forming processes, machining, and joining. Role of manufacturing in microstructure and material properties development and on component performance."
            },
            {
              "code": "MTRL 358",
              "title": "",
              "credits": 3,
              "year": 3,
              "term": 1,
              "description": "Hydrometallurgy I Aqueous extraction of metals from ores and concentrates."
            },
            {
              "code": "MTRL 359",
              "title": "",
              "credits": 1,
              "year": 3,
              "term": 1,
              "description": "Hydrometallurgy I Laboratory Laboratory exercises on aqueous extraction of metals from ores and concentrates. [0-3*-0] Corequisite:"
            },
            {
              "code": "MTRL 361",
              "title": "",
              "credits": 4,
              "year": 3,
              "term": 1,
              "description": "Modelling of Materials Processes Mathematical and physical modelling of processes employed in the production of materials. The application of models to analyze, design and improve materials production."
            },
            {
              "code": "MTRL 363",
              "title": "",
              "credits": 3,
              "year": 3,
              "term": 1,
              "description": "Transport Phenomena III - Mass Transport Mass transfer fundamentals, gas interdiffusivity, Sievert's law, Fick's laws, solid-state diffusion, steady and non-steady state diffusion, mass transfer in quiescence fluids. The application examples are related to metallurgical processes, green technologies, and the semiconductor industry."
            }
          ]
        },
        {
          "term": 2,
          "courses": [
            {
              "code": "MTRL 365",
              "title": "",
              "credits": 3,
              "year": 3,
              "term": 2,
              "description": "Mechanical Behaviour of Materials Polycrystalline and single crystal deformation; dislocation theory; strengthening mechanisms; fracture mechanics; fatigue; high temperature deformation mechanisms."
            },
            {
              "code": "MTRL 378",
              "title": "",
              "credits": 3,
              "year": 3,
              "term": 2,
              "description": "Phase Transformations Solidification and solid state transformations; nucleation and growth processes; segregation and structure in castings; phase changes in steel; transformation diagrams; diffusion equations. *]"
            },
            {
              "code": "MTRL 381",
              "title": "",
              "credits": 1,
              "year": 3,
              "term": 2,
              "description": "Structure and Properties Laboratory Structure and properties of ferrous and non-ferrous metals; heat treatment; hardenability; metallography; age hardening. [0-3*-0]",
              "prerequisites": "Corequisites: All of"
            },
            {
              "code": "MTRL 394",
              "title": "",
              "credits": 4,
              "year": 3,
              "term": 2,
              "description": "Polymers The structure and properties of polymeric materials and reinforced polymers with emphasis on their engineering properties and applications."
            },
            {
              "code": "STAT 251",
              "title": "",
              "credits": 3,
              "year": 3,
              "term": 2
            },
            {
              "code": "ELECTIVE",
              "title": "Technical electives",
              "credits": 3,
              "year": 3,
              "term": 2
            }
          ]
        }
      ]
    },
    {
      "year": 4,
      "label": "Year 4",
      "terms": [
        {
          "term": 1,
          "courses": [
            {
              "code": "APSC 450",
              "title": "",
              "credits": 2,
              "year": 4,
              "term": 1,
              "description": "Professional Engineering Practice Legislation affecting the practice of engineering; ethical principles and responsibilities. Management of engineering enterprises; labour relations, safety and environmental legislation. Restricted to engineering undergraduate students in the final year of their program."
            },
            {
              "code": "MTRL 455",
              "title": "",
              "credits": 3,
              "year": 4,
              "term": 1,
              "description": "Economic Aspects of Materials Engineering Time value of money, cash flows, capital and operating cost estimation, financial decision making and relevant case studies."
            },
            {
              "code": "MTRL 456",
              "title": "",
              "credits": 3,
              "year": 4,
              "term": 1,
              "description": "Environmental Degradation of Materials Fundamental aspects of environmental degradation of metals (corrosion), ceramics, and polymers, with an emphasis on aqueous environments."
            }
          ]
        },
        {
          "term": 2,
          "courses": [
            {
              "code": "MTRL 460",
              "title": "",
              "credits": 3,
              "year": 4,
              "term": 2,
              "description": "Monitoring and Optimization of Materials Processing Measurement systems for materials processing and evaluation, methods of data collection and analysis in materials engineering, materials processing monitoring and control, design of experiments for materials processing and optimization."
            },
            {
              "code": "MTRL 466",
              "title": "",
              "credits": 3,
              "year": 4,
              "term": 2,
              "description": "Engineering Project I Design projects to illustrate the full spectrum of design encountered in Metals and Materials Engineering including the design of components, structures and processes used to manufacture materials."
            },
            {
              "code": "MTRL 467",
              "title": "",
              "credits": 3,
              "year": 4,
              "term": 2,
              "description": "Engineering Project II Design projects to illustrate the full spectrum of design encountered in Metals and Materials Engineering including the design of components, structures and processes used to manufacture materials."
            },
            {
              "code": "ELECTIVE",
              "title": "Technical electives",
              "credits": 21,
              "year": 4,
              "term": 2
            }
          ]
        }
      ]
    }
  ]
}