{
  "faculty": "Applied Science",
  "major": "Mining Engineering",
  "totalCredits": 151,
  "notes": "UBC Applied Science (Engineering) - Mining Engineering curriculum outline. First year is common to most engineering programs.",
  "years": [
    {
      "year": 1,
      "label": "Year 1",
      "terms": [
        {
          "term": 1,
          "courses": [
            {
              "code": "APSC 100",
              "title": "",
              "credits": 3,
              "year": 1,
              "term": 1,
              "description": "Introduction to Engineering I An introduction to the engineering profession including: roles and responsibilities of the engineer, the engineering disciplines, sustainability, an introduction to the engineering design process, introduction and application of the relevant foundational scientific principles, prototyping, engineering graphics, technical communication, and engineering ethics.",
              "prerequisites": "APSC 100\n\nCorequisites: APSC 173"
            },
            {
              "code": "APSC 101",
              "title": "",
              "credits": 3,
              "year": 1,
              "term": 1,
              "description": "Introduction to Engineering II An introduction to the engineering profession including: the engineering design process, sustainability, prototype testing, introduction and application of the relevant foundational scientific principles, team functioning, engineering graphics, and technical communication. Prerequisite:",
              "prerequisites": "APSC 100."
            },
            {
              "code": "APSC 160",
              "title": "",
              "credits": 3,
              "year": 1,
              "term": 1,
              "description": "Introduction to Computation in Engineering Design Analysis and simulation, laboratory data acquisition and processing, measurement interfaces, engineering tools, computer systems organization, programming languages. Credit will only be given for one of:"
            },
            {
              "code": "CHEM 154",
              "title": "",
              "credits": 3,
              "year": 1,
              "term": 1,
              "description": "Chemistry for Engineering Chemical bonding, properties of matter. Chemical thermodynamics with applications to phase equilibria, aqueous equilibria and electrochemistry. Processes at surfaces. [3-3*-0]",
              "prerequisites": "CHEM 12."
            },
            {
              "code": "WRDS 150",
              "title": "",
              "credits": 3,
              "year": 1,
              "term": 1,
              "description": "Writing and Research in the Disciplines Writing and reading in disciplines across the academy, focusing on practices that research disciplines share and those that differentiate them. Restricted to students not in the Faculty of Arts. Credit can be granted for only one of"
            },
            {
              "code": "MATH 100",
              "title": "; intended for students with no previous knowledge of Calculus. Please consult the Faculty of Science Credit Exclusion List:",
              "credits": 3,
              "year": 1,
              "term": 1,
              "description": "https://vancouver.calendar.ubc.ca/faculties-colleges-and-schools/facult… . Not for credit for students with AP Calculus AB, AP Calculus BC, or a passing score on the UBC-SFU-UVIC-UNBC Calculus Challenge Examination.5]",
              "prerequisites": "A grade of 80% or higher in BC Principles of Mathematics 12 or Pre-calculus 12."
            }
          ]
        },
        {
          "term": 2,
          "courses": [
            {
              "code": "MATH 101",
              "title": "Integral Calculus with Applications",
              "credits": 3,
              "year": 1,
              "term": 2,
              "description": "The definite integral, integration techniques, applications, modelling, infinite series.",
              "prerequisites": "One of MATH_V 100, MATH_V 102, MATH_V 104, MATH_V 110, MATH_V 120, MATH_V 180, MATH_V 184.\n\nEquivalency: MATH_V 103, 105."
            },
            {
              "code": "MATH 152",
              "title": "Linear Systems",
              "credits": 3,
              "year": 1,
              "term": 2,
              "description": "2D and 3D geometry, vectors and matrices, eigenvalues and vibration, physical applications. Laboratories demonstrate computer solutions of large systems. Please consult the Faculty of Science Credit Exclusion List: https://vancouver.calendar.ubc.ca/faculties-colleges-and-schools/facult… [3-1*-0]",
              "prerequisites": "Corequisites: [MATH101]\n\nCorequisites: [MATH101] MATH_V 180 (4) Differential Calculus with Applications Topics as for\n\nCorequisites: [MATH101] MATH_V 180 (4) Differential Calculus with Applications Topics as for"
            },
            {
              "code": "PHYS 157",
              "title": "Introductory Physics for Engineers I",
              "credits": 3,
              "year": 1,
              "term": 2,
              "description": "Heat, thermodynamics, oscillations, waves, and sound.",
              "prerequisites": "One of PHYS 12, PHYS 100.\n\nCorequisites: One of MATH 100, MATH 102, MATH 104, MATH 110, MATH 120, MATH 180, MATH 184."
            },
            {
              "code": "PHYS 158",
              "title": "Introductory Physics for Engineers II",
              "credits": 3,
              "year": 1,
              "term": 2,
              "description": "Electricity and magnetism, DC and AC circuits, optics.",
              "prerequisites": "PHYS 157.\n\nCorequisites: One of MATH 101, MATH 103, MATH 105, MATH 121."
            },
            {
              "code": "PHYS 159",
              "title": "or (d) SCIE 001",
              "credits": 1,
              "year": 1,
              "term": 2,
              "description": "A laboratory course with emphasis on experimental design, measurement and analysis techniques.",
              "prerequisites": "One of PHYS 12, PHYS 100.\n\nCorequisites: One of PHYS 157, PHYS 158. PHYS_V 170 (3) Mechanics I Statics of particles, equilibrium or rigid bodies, rigid body statics and internal forces, trusses; kinematics: rectilinear motion; dynamics: Newton's second law, friction, impulse, momentum, work and energy. Recommended pre-requisites: one of PHYS 12, PHYS 100 and one of MATH 100, MATH 102, MATH 104, MATH 110, MATH 120, MATH 180, MATH 184. Recommended co-requisite: one of MATH 101, MATH 103, MATH 105, MATH 121.\n\nCorequisites: One of MATH 200, MATH 217, MATH 226, MATH 253.\n\nCorequisites: One of MATH 200, MATH 217, MATH 226, MATH 253.\n\nCorequisites: One of MATH 200, MATH 217, MATH 226, MATH 253.\n\nCorequisites: One of MATH 200, MATH 217, MATH 226, MATH 253."
            },
            {
              "code": "PHYS 170",
              "title": "",
              "credits": 3,
              "year": 1,
              "term": 2,
              "description": "Mechanics I Statics of particles, equilibrium or rigid bodies, rigid body statics and internal forces, trusses; kinematics: rectilinear motion; dynamics: Newton's second law, friction, impulse, momentum, work and energy. Recommended pre-requisites: one of PHYS 12,",
              "prerequisites": "Corequisites: One of MATH 200, MATH 217, MATH 226, MATH 253, MATH 254."
            },
            {
              "code": "ELECTIVE",
              "title": "Complementary Studies electives",
              "credits": 3,
              "year": 1,
              "term": 2
            }
          ]
        }
      ]
    },
    {
      "year": 2,
      "label": "Year 2",
      "terms": [
        {
          "term": 1,
          "courses": [
            {
              "code": "APSC 201",
              "title": "",
              "credits": 3,
              "year": 2,
              "term": 1,
              "description": "Report preparation, business correspondence, and oral presentation of technical material. Credit will be granted for only one of BMEG 201, CHBE 201, CIVL 203, CPEN 281, ELEC 281, IGEN 201, MANU 201, MECH 226, MTRL 201, or APSC 201.",
              "prerequisites": "One of"
            },
            {
              "code": "CIVL 210",
              "title": "",
              "credits": 4,
              "year": 2,
              "term": 1,
              "description": "Soil Mechanics I Soil classification, principle of effective stress, analysis of seepage, filter criteria, introduction to shear strength and slope stability analysis. [3-2*-1]",
              "prerequisites": "One of"
            },
            {
              "code": "EOSC 210",
              "title": "",
              "credits": 3,
              "year": 2,
              "term": 1,
              "description": "Earth Science for Engineers Focus on the interaction between society and the geologic environment. Locating, assessing and developing natural resources; understanding and preparing for natural hazards, design of structures and waste disposal sites.",
              "prerequisites": "Corequisites: One of CIVL 215, MINE 200."
            },
            {
              "code": "MATH 253",
              "title": "Multivariable Calculus",
              "credits": 3,
              "year": 2,
              "term": 1,
              "description": "Partial and directional derivatives; maxima and minima; Lagrange multipliers and second derivative test; multiple integrals and applications. Please consult the Faculty of Science Credit Exclusion List: https://vancouver.calendar.ubc.ca/faculties-colleges-and-schools/facult…",
              "prerequisites": "One of MATH 101, MATH 103, MATH 105, MATH 121, SCIE 001."
            },
            {
              "code": "MATH 255",
              "title": "or",
              "credits": 3,
              "year": 2,
              "term": 1,
              "description": "Ordinary Differential Equations Review of linear systems; nonlinear equations and applications; phase plane analysis; Laplace transforms; numerical methods. Please consult the Faculty of Science Credit Exclusion List: https://vancouver.calendar.ubc.ca/faculties-colleges-and-schools/facult…",
              "prerequisites": "One of"
            },
            {
              "code": "MECH 260",
              "title": "Introduction to Mechanics of Materials",
              "credits": 3,
              "year": 2,
              "term": 1,
              "description": "Statically determinate frames and trusses; normal and shear stresses and strains; shear force and bending moment diagrams; theory of beam bending, torsion of circular rods; transformation of stress and strain in two and three dimensions, Mohr's circle; yield and ultimate failure criteria.",
              "prerequisites": "Either (a) all of MATH 101, PHYS 170 or (b) all of APSC 172, APSC 173, APSC 180."
            }
          ]
        },
        {
          "term": 2,
          "courses": [
            {
              "code": "MECH 280",
              "title": "Introduction to Fluid Mechanics",
              "credits": 3,
              "year": 2,
              "term": 2,
              "description": "Fluid properties; statics; kinematics, dynamics, energy, and momentum principles for control volumes; dimensional analysis and similarity; laminar and turbulent flow; pipe flow; principles of centrifugal pumps.",
              "prerequisites": "All of MATH 152, PHYS 170 and one of MATH 217, MATH 253; and either (a) PHYS 131 and one of PHYS 108, PHYS 118; or (b) PHYS 153 or (c) all of PHYS 157, PHYS 158, PHYS 159."
            },
            {
              "code": "MINE 200",
              "title": "",
              "credits": 3,
              "year": 2,
              "term": 2,
              "description": "Mineral Resources Engineering I Introduction to the mining life cycle and the design, planning, operation, and closure of mining systems, with a focus on mining methods, mineral processing, community engagement, and social license to operate."
            },
            {
              "code": "MINE 201",
              "title": "",
              "credits": 3,
              "year": 2,
              "term": 2,
              "description": "Mineral Resources Engineering II The design, planning, and operation, and closure of mining operations, with a focus on mineral processing technologies, plant design, waste and tailings management, and the future of mining. Prerequisite:"
            },
            {
              "code": "MINE 202",
              "title": "",
              "credits": 4,
              "year": 2,
              "term": 2,
              "description": "Mineralogy for Resources Engineering Fundamentals of rock and minerals formation. Exploring main techniques used to understand implications of mineralogy in mining and mineral processing.",
              "prerequisites": "CHEM 154"
            },
            {
              "code": "MINE 293",
              "title": "",
              "credits": 1,
              "year": 2,
              "term": 2,
              "description": "Seminar Oral presentations of topics on mine safety, and mining engineering by industry practitioners, faculty and/or stake- and rights-holders."
            },
            {
              "code": "STAT 251",
              "title": "",
              "credits": 3,
              "year": 2,
              "term": 2
            },
            {
              "code": "ELECTIVE",
              "title": "Complementary Studies electives",
              "credits": 3,
              "year": 2,
              "term": 2
            }
          ]
        }
      ]
    },
    {
      "year": 3,
      "label": "Year 3",
      "terms": [
        {
          "term": 1,
          "courses": [
            {
              "code": "APSC 278",
              "title": "",
              "credits": 3,
              "year": 3,
              "term": 1,
              "description": "Engineering Materials Atomic bonding; crystal structures and imperfections; properties of metals, ceramics, polymers, wood, concrete and fibre composite materials; selection of materials; corrosion; mechanical testing and heat treatment."
            },
            {
              "code": "APSC 279",
              "title": "",
              "credits": 1,
              "year": 3,
              "term": 1,
              "description": "Engineering Materials Laboratory Atomic bonding; crystal structures and imperfections; properties of metals, ceramics, polymers, wood, concrete and fibre composite materials; selection of materials; corrosion; mechanical testing and heat treatment. [0-2*- 0] Corequisite:",
              "prerequisites": "Corequisites: APSC_V 278"
            },
            {
              "code": "ELEC 203",
              "title": "",
              "credits": 3,
              "year": 3,
              "term": 1,
              "description": "Ideal passive elements and sources; Kirchhoff’s Laws; DC circuits; natural,  and complete response of first order circuits; operational amplifiers; impedance; phasors; complex power. Not open to students in Electrical and Computer Engineering. [3-2*-0]",
              "prerequisites": "Prerequisites: MATH 101 – Integral Calculus with Applications AND ONE of PHYS 108 – Enriched Physics II PHYS 118 – Electricity, Light and Radiation PHYS 158 – Introductory Physics for Engineers II\n\nCorequisites: ONE of MATH 255 – Ordinary Differential Equations MATH 256 – Differential Equations"
            },
            {
              "code": "MINE 302",
              "title": "",
              "credits": 4,
              "year": 3,
              "term": 1,
              "description": "Underground Mining and Design Selection, design, and development of underground mining methods based upon physical, geological, economic, and environmental constraints. Underground excavation methods and equipment selection.",
              "prerequisites": "Third-year standing."
            },
            {
              "code": "MINE 303",
              "title": "",
              "credits": 4,
              "year": 3,
              "term": 1,
              "description": "Rock Engineering Fundamentals The study of the mechanical and structural properties of rock materials at the laboratory and field scale, with reference to common mining, geological and civil engineering problems.",
              "prerequisites": "One of MECH 260, CIVL 230."
            },
            {
              "code": "MINE 310",
              "title": "",
              "credits": 4,
              "year": 3,
              "term": 1,
              "description": "Surface Mining and Design Surface mining methods, calculation of pit limits, cutoff grades, break-even criteria, stripping ratios, ultimate pit depth and dimensions, and pit sequencing. Geotechnical inputs to surface mine design. Loading and hauling equipment, production rates, capacity and systems.",
              "prerequisites": "Third-year standing."
            }
          ]
        },
        {
          "term": 2,
          "courses": [
            {
              "code": "MINE 331",
              "title": "",
              "credits": 3,
              "year": 3,
              "term": 2,
              "description": "Physical Mineral Processes Mineral processing unit operations and sampling, crushing, grinding, screening, classification, gravity separation, magnetic separation, electrostatic separation, concentrate dewatering practices.",
              "prerequisites": "Third Year Standing."
            },
            {
              "code": "MINE 333",
              "title": "",
              "credits": 3,
              "year": 3,
              "term": 2,
              "description": "Flotation Theory and technology of flotation and ancillary processes.",
              "prerequisites": "Third Year Standing."
            },
            {
              "code": "MINE 350",
              "title": "",
              "credits": 3,
              "year": 3,
              "term": 2,
              "description": "Modelling and Simulation Methods for determining the behaviour of large scale industrial systems and their application to the design and analysis of such systems.",
              "prerequisites": "STAT 251."
            },
            {
              "code": "MINE 380",
              "title": "",
              "credits": 3,
              "year": 3,
              "term": 2,
              "description": "Mine Waste Management Basic geotechnical, hydrological, and water management aspects of mine waste management.",
              "prerequisites": "CIVL 210."
            },
            {
              "code": "MINE 396",
              "title": "",
              "credits": 3,
              "year": 3,
              "term": 2,
              "description": "Engineering Economics Discrete and continuous cash flow models, discounted cash flow analysis, effects of depreciation and taxes, economic analysis of projects, sensitivity and risk analysis, financing and cost of capital.",
              "prerequisites": "Second-year standing in Engineering."
            },
            {
              "code": "ELECTIVE",
              "title": "Complementary Studies Electives",
              "credits": 3,
              "year": 3,
              "term": 2
            }
          ]
        }
      ]
    },
    {
      "year": 4,
      "label": "Year 4",
      "terms": [
        {
          "term": 1,
          "courses": [
            {
              "code": "APSC 450",
              "title": "",
              "credits": 2,
              "year": 4,
              "term": 1,
              "description": "Professional Engineering Practice Legislation affecting the practice of engineering; ethical principles and responsibilities. Management of engineering enterprises; labour relations, safety and environmental legislation. Restricted to engineering undergraduate students in the final year of their program."
            },
            {
              "code": "MINE 402",
              "title": "",
              "credits": 3,
              "year": 4,
              "term": 1,
              "description": "Mine Ventilation and Occupational Health and Safety Design and analysis for ventilation systems for mining. Topics such as ventilation design, ventilation surveys, thermodynamic aspects, psychrometry of air and air conditioning.",
              "prerequisites": "Fourth-year standing."
            },
            {
              "code": "MINE 403",
              "title": "",
              "credits": 3,
              "year": 4,
              "term": 1,
              "description": "Rock Engineering Design The design of rock slopes and underground openings with respect to stress, structure and the rock mass. Stabilization and monitoring of rock movement. Prerequisite:"
            },
            {
              "code": "MINE 432",
              "title": "",
              "credits": 3,
              "year": 4,
              "term": 1,
              "description": "Mineral Process Control Automatic control theory, PID control, Laplace and z-transforms, loop tuning, frequency response, stability analysis, control strategies in flotation, comminution, dewatering, reagent and bin/sump levels, automated load-haul-dump and drilling equipment, instrumentation and soft sensors."
            },
            {
              "code": "MINE 465",
              "title": "",
              "credits": 3,
              "year": 4,
              "term": 1,
              "description": "Materials Handling Knowledge and understanding of equipment used in mining operations, including diesel, electro-mechanical, hydraulic and pneumatic equipment as well as conveyors, load-haul-dump trucks and pumps.",
              "prerequisites": "Third-year standing."
            }
          ]
        },
        {
          "term": 2,
          "courses": [
            {
              "code": "MINE 486",
              "title": "",
              "credits": 3,
              "year": 4,
              "term": 2,
              "description": "Mining and The Environment Environmental topics of importance to engineers practicing within the mining, metallurgical and related industries including technical practices, regulatory and public issues."
            },
            {
              "code": "MINE 491",
              "title": "",
              "credits": 6,
              "year": 4,
              "term": 2,
              "description": "Mine and Plant Engineering Design Feasibility Study Mining Engineering design project from scope definition to final design and project feasibility. Based on a problem from industry and/or research. ;",
              "prerequisites": "All of"
            },
            {
              "code": "MINE 444",
              "title": "",
              "credits": 3,
              "year": 4,
              "term": 2,
              "description": "Urban Mining: Recovering Value From E-waste Technological and social issues related to the recovery of value from e-waste seen through the eyes of engineers, social scientists and economists. Recovery of valuable minerals in the context of circular economy to provide sustainable solutions for our planet.",
              "prerequisites": "Third-year standing"
            },
            {
              "code": "MINE 447",
              "title": "",
              "credits": 3,
              "year": 4,
              "term": 2,
              "description": "Dewatering of Fine Tailings Interparticle forces; DLVO theory of colloid stability; dispersion, coagulation, and flocculation phenomena; settling; thickening and consolidation processes; polymers in mineral processing; measurement techniques in tailings treatment; thickeners and principles of operation; industrial practice.",
              "prerequisites": "Third-year standing"
            },
            {
              "code": "ELECTIVE",
              "title": "Technical Electives",
              "credits": 9,
              "year": 4,
              "term": 2
            }
          ]
        }
      ]
    }
  ]
}